; ModuleID = 'output/wsq.ll'
source_filename = "/home/ponce/git/Dat3M/benchmarks/lfds/wsq.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.WorkStealQueue = type { %union.pthread_mutex_t, i32, i32, i32, i32, [16 x %struct.Obj*], i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.Obj = type { i32 }
%union.pthread_mutexattr_t = type { i32 }
%union.pthread_attr_t = type { i64, [48 x i8] }

@.str = private unnamed_addr constant [14 x i8] c"r->field == 1\00", align 1
@.str.1 = private unnamed_addr constant [44 x i8] c"/home/ponce/git/Dat3M/benchmarks/lfds/wsq.h\00", align 1
@__PRETTY_FUNCTION__.check = private unnamed_addr constant [18 x i8] c"void check(Obj *)\00", align 1
@q = dso_local global %struct.WorkStealQueue zeroinitializer, align 8, !dbg !0
@.str.2 = private unnamed_addr constant [20 x i8] c"newsize < q.MaxSize\00", align 1
@__PRETTY_FUNCTION__.syncPush = private unnamed_addr constant [21 x i8] c"void syncPush(Obj *)\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"count < q.mask\00", align 1
@items = dso_local global [4 x %struct.Obj] zeroinitializer, align 16, !dbg !16

; Function Attrs: noinline nounwind uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "q", scope: !2, file: !21, line: 81, type: !28, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !15, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/ponce/git/Dat3M/benchmarks/lfds/wsq.c", directory: "/home/ponce/git/Dat3M", checksumkind: CSK_MD5, checksum: "edf38254eba72e291d688292029a0502")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "memory_order", file: !6, line: 56, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stdatomic.h", directory: "", checksumkind: CSK_MD5, checksum: "de5d66a1ef2f5448cc1919ff39db92bc")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "memory_order_relaxed", value: 0)
!10 = !DIEnumerator(name: "memory_order_consume", value: 1)
!11 = !DIEnumerator(name: "memory_order_acquire", value: 2)
!12 = !DIEnumerator(name: "memory_order_release", value: 3)
!13 = !DIEnumerator(name: "memory_order_acq_rel", value: 4)
!14 = !DIEnumerator(name: "memory_order_seq_cst", value: 5)
!15 = !{!0, !16}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "items", scope: !2, file: !18, line: 26, type: !19, isLocal: false, isDefinition: true)
!18 = !DIFile(filename: "benchmarks/lfds/wsq.c", directory: "/home/ponce/git/Dat3M", checksumkind: CSK_MD5, checksum: "edf38254eba72e291d688292029a0502")
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !26)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "Obj", file: !21, line: 26, baseType: !22)
!21 = !DIFile(filename: "benchmarks/lfds/wsq.h", directory: "/home/ponce/git/Dat3M", checksumkind: CSK_MD5, checksum: "8b713fb97148388d95730439183e41c1")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Obj", file: !21, line: 24, size: 32, elements: !23)
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !22, file: !21, line: 25, baseType: !25, size: 32)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !{!27}
!27 = !DISubrange(count: 4)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "WorkStealQueue", file: !21, line: 78, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WorkStealQueue", file: !21, line: 66, size: 1536, elements: !30)
!30 = !{!31, !63, !64, !65, !68, !69, !74}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !29, file: !21, line: 67, baseType: !32, size: 320)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !33, line: 72, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!34 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !33, line: 67, size: 320, elements: !35)
!35 = !{!36, !56, !61}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !34, file: !33, line: 69, baseType: !37, size: 320)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !38, line: 22, size: 320, elements: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!39 = !{!40, !41, !42, !43, !44, !45, !47, !48}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !37, file: !38, line: 24, baseType: !25, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !37, file: !38, line: 25, baseType: !7, size: 32, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !37, file: !38, line: 26, baseType: !25, size: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !37, file: !38, line: 28, baseType: !7, size: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !37, file: !38, line: 32, baseType: !25, size: 32, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !37, file: !38, line: 34, baseType: !46, size: 16, offset: 160)
!46 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !37, file: !38, line: 35, baseType: !46, size: 16, offset: 176)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !37, file: !38, line: 36, baseType: !49, size: 128, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !50, line: 53, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !50, line: 49, size: 128, elements: !52)
!52 = !{!53, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !51, file: !50, line: 51, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !51, file: !50, line: 52, baseType: !54, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !34, file: !33, line: 70, baseType: !57, size: 320)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 320, elements: !59)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !{!60}
!60 = !DISubrange(count: 40)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !34, file: !33, line: 71, baseType: !62, size: 64)
!62 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", scope: !29, file: !21, line: 69, baseType: !25, size: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "InitialSize", scope: !29, file: !21, line: 70, baseType: !25, size: 32, offset: 352)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !29, file: !21, line: 72, baseType: !66, size: 32, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_int", file: !6, line: 92, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !25)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !29, file: !21, line: 73, baseType: !66, size: 32, offset: 416)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !29, file: !21, line: 75, baseType: !70, size: 1024, offset: 448)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 1024, elements: !72)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!72 = !{!73}
!73 = !DISubrange(count: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !29, file: !21, line: 76, baseType: !25, size: 32, offset: 1472)
!75 = !{i32 7, !"Dwarf Version", i32 5}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{i32 1, !"wchar_size", i32 4}
!78 = !{i32 7, !"PIC Level", i32 2}
!79 = !{i32 7, !"PIE Level", i32 2}
!80 = !{i32 7, !"uwtable", i32 1}
!81 = !{i32 7, !"frame-pointer", i32 2}
!82 = !{!"Ubuntu clang version 14.0.6"}
!83 = distinct !DISubprogram(name: "init_Obj", scope: !21, file: !21, line: 28, type: !84, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !86)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !71}
!86 = !{}
!87 = !DILocalVariable(name: "r", arg: 1, scope: !83, file: !21, line: 28, type: !71)
!88 = !DILocation(line: 0, scope: !83)
!89 = !DILocation(line: 29, column: 8, scope: !83)
!90 = !DILocation(line: 29, column: 14, scope: !83)
!91 = !DILocation(line: 30, column: 1, scope: !83)
!92 = distinct !DISubprogram(name: "operation", scope: !21, file: !21, line: 32, type: !84, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !86)
!93 = !DILocalVariable(name: "r", arg: 1, scope: !92, file: !21, line: 32, type: !71)
!94 = !DILocation(line: 0, scope: !92)
!95 = !DILocation(line: 33, column: 8, scope: !92)
!96 = !DILocation(line: 33, column: 13, scope: !92)
!97 = !DILocation(line: 34, column: 1, scope: !92)
!98 = distinct !DISubprogram(name: "check", scope: !21, file: !21, line: 36, type: !84, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !86)
!99 = !DILocalVariable(name: "r", arg: 1, scope: !98, file: !21, line: 36, type: !71)
!100 = !DILocation(line: 0, scope: !98)
!101 = !DILocation(line: 37, column: 5, scope: !102)
!102 = distinct !DILexicalBlock(scope: !103, file: !21, line: 37, column: 5)
!103 = distinct !DILexicalBlock(scope: !98, file: !21, line: 37, column: 5)
!104 = !DILocation(line: 37, column: 5, scope: !103)
!105 = !DILocation(line: 38, column: 1, scope: !98)
!106 = distinct !DISubprogram(name: "readV", scope: !21, file: !21, line: 83, type: !107, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !86)
!107 = !DISubroutineType(types: !108)
!108 = !{!25, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!110 = !DILocalVariable(name: "v", arg: 1, scope: !106, file: !21, line: 83, type: !109)
!111 = !DILocation(line: 0, scope: !106)
!112 = !DILocalVariable(name: "expected", scope: !106, file: !21, line: 84, type: !25)
!113 = !DILocation(line: 85, column: 5, scope: !106)
!114 = !DILocation(line: 86, column: 5, scope: !106)
!115 = distinct !DISubprogram(name: "writeV", scope: !21, file: !21, line: 89, type: !116, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !86)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !109, !25}
!118 = !DILocalVariable(name: "v", arg: 1, scope: !115, file: !21, line: 89, type: !109)
!119 = !DILocation(line: 0, scope: !115)
!120 = !DILocalVariable(name: "w", arg: 2, scope: !115, file: !21, line: 89, type: !25)
!121 = !DILocation(line: 90, column: 5, scope: !115)
!122 = !DILocation(line: 91, column: 1, scope: !115)
!123 = distinct !DISubprogram(name: "init_WSQ", scope: !21, file: !21, line: 93, type: !124, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !86)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !25}
!126 = !DILocalVariable(name: "size", arg: 1, scope: !123, file: !21, line: 93, type: !25)
!127 = !DILocation(line: 0, scope: !123)
!128 = !DILocation(line: 94, column: 15, scope: !123)
!129 = !DILocation(line: 95, column: 19, scope: !123)
!130 = !DILocation(line: 96, column: 5, scope: !123)
!131 = !DILocation(line: 97, column: 5, scope: !123)
!132 = !DILocation(line: 98, column: 19, scope: !123)
!133 = !DILocation(line: 98, column: 12, scope: !123)
