; ModuleID = '/home/stefano/huawei/libvsync/datastruct/queue/unbounded/verify/unbounded_queue_verify.c'
source_filename = "/home/stefano/huawei/libvsync/datastruct/queue/unbounded/verify/unbounded_queue_verify.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.vatomic64_s = type { i64 }
%struct.vqueue_ub_s = type { %union.pthread_mutex_t, %union.pthread_mutex_t, %struct.vqueue_ub_node_s*, %struct.vqueue_ub_node_s*, %struct.vqueue_ub_node_s }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.vqueue_ub_node_s = type { i8*, %struct.vatomicptr_s }
%struct.vatomicptr_s = type { i8* }
%struct.locked_trace_s = type { %struct.trace_s, %union.pthread_mutex_t }
%struct.trace_s = type { %struct.trace_unit_s*, i64, i64, i8 }
%struct.trace_unit_s = type { i64, i64 }
%struct.data_s = type { i64, i8 }
%struct.run_info_t = type { i64, i64, i8, i8* (i8*)* }
%union.pthread_attr_t = type { i64, [48 x i8] }
%union.pthread_mutexattr_t = type { i32 }
%struct.smr_none_retire_info_t = type { %struct.smr_node_s*, void (%struct.smr_node_s*, i8*)*, i8* }
%struct.smr_node_s = type { %struct.smr_node_core_s, i32, void (%struct.smr_node_s*, i8*)*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_g_vmem_alloc_count", scope: !2, file: !79, line: 14, type: !80, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !76, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/stefano/huawei/libvsync/datastruct/queue/unbounded/verify/unbounded_queue_verify.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "0e469bf9879777a23b2ea686edfbbfe8")
!4 = !{!5, !10, !13, !14, !31, !43, !48}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "vsize_t", file: !6, line: 43, baseType: !7)
!6 = !DIFile(filename: "include/vsync/vtypes.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "80559d0ebc17bc1f9d7b60e2c36ee0f3")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 46, baseType: !9)
!8 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!9 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuintptr_t", file: !6, line: 37, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !12, line: 90, baseType: !9)
!12 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "run_info_t", file: !16, line: 38, baseType: !17)
!16 = !DIFile(filename: "utils/include/test/thread_launcher.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "b854c1934ab1739fab93f88f22662d53")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 33, size: 256, elements: !18)
!18 = !{!19, !22, !23, !26}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !16, line: 34, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !21, line: 27, baseType: !9)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!22 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !17, file: !16, line: 35, baseType: !5, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "assign_me_to_core", scope: !17, file: !16, line: 36, baseType: !24, size: 8, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "vbool_t", file: !6, line: 44, baseType: !25)
!25 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "run_fun", scope: !17, file: !16, line: 37, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_fun_t", file: !16, line: 30, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!13, !13}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "vqueue_ub_node_t", file: !33, line: 39, baseType: !34)
!33 = !DIFile(filename: "datastruct/queue/unbounded/include/vsync/queue/unbounded_queue_total.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "b4e848a3266a7fc151b6fc5ae8d41cb4")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vqueue_ub_node_s", file: !33, line: 36, size: 128, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !34, file: !33, line: 37, baseType: !13, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !33, line: 38, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "vatomicptr_t", file: !39, line: 44, baseType: !40)
!39 = !DIFile(filename: "atomics/include/vsync/atomic/internal/types.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "566b0c58af89e39a453b706e5dc4ad25")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vatomicptr_s", file: !39, line: 42, size: 64, align: 64, elements: !41)
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_v", scope: !40, file: !39, line: 43, baseType: !13, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "print_fun_t", file: !44, line: 227, baseType: !45)
!44 = !DIFile(filename: "datastruct/queue/unbounded/include/test/queue/ub/queue_interface.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "1ac49a72c99bae51c524b5cddaa9bf59")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !13}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "smr_none_retire_info_t", file: !50, line: 21, baseType: !51)
!50 = !DIFile(filename: "memory/smr/include/test/smr/ismr_none.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "82ae29b5d69fc210cc0afc11677b0a3d")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 17, size: 192, elements: !52)
!52 = !{!53, !74, !75}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !51, file: !50, line: 18, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "smr_node_t", file: !56, line: 25, baseType: !57)
!56 = !DIFile(filename: "memory/smr/include/vsync/smr/internal/smr_node.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "33b22eef5fa32f451294d19fc9760563")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "smr_node_s", file: !56, line: 19, size: 256, elements: !58)
!58 = !{!59, !65, !67, !73}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !57, file: !56, line: 20, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "smr_node_core_t", file: !56, line: 17, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "smr_node_core_s", file: !56, line: 15, size: 64, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !56, line: 16, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !57, file: !56, line: 21, baseType: !66, size: 32, offset: 64)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_fun", scope: !57, file: !56, line: 23, baseType: !68, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "smr_node_destroy_fun", file: !56, line: 13, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72, !13}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_fun_arg", scope: !57, file: !56, line: 24, baseType: !13, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !51, file: !50, line: 19, baseType: !68, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !51, file: !50, line: 20, baseType: !13, size: 64, offset: 128)
!76 = !{!0, !77, !89, !92, !95, !148, !160}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "_g_vmem_free_count", scope: !2, file: !79, line: 15, type: !80, isLocal: false, isDefinition: true)
!79 = !DIFile(filename: "utils/include/test/vmem_stdlib.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "8ea894a152afbfd198826e45bdb67542")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "vatomic64_t", file: !39, line: 39, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vatomic64_s", file: !39, line: 37, size: 64, align: 64, elements: !82)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_v", scope: !81, file: !39, line: 38, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuint64_t", file: !6, line: 36, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !86, line: 27, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !88, line: 45, baseType: !9)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "g_len", scope: !2, file: !91, line: 29, type: !5, isLocal: false, isDefinition: true)
!91 = !DIFile(filename: "datastruct/queue/unbounded/verify/unbounded_queue_verify.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "0e469bf9879777a23b2ea686edfbbfe8")
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "msg", scope: !2, file: !94, line: 22, type: !66, isLocal: false, isDefinition: true)
!94 = !DIFile(filename: "datastruct/queue/unbounded/verify/test_case_5.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "16c3149d045d85103f98b24a19a9ad36")
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "global_trace", scope: !2, file: !50, line: 15, type: !97, isLocal: false, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "locked_trace_t", file: !98, line: 11, baseType: !99)
!98 = !DIFile(filename: "utils/include/test/locked_trace.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "6b9b066c8ea09bc73550cef772f1c7ca")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "locked_trace_s", file: !98, line: 8, size: 576, elements: !100)
!100 = !{!101, !116}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "trace", scope: !99, file: !98, line: 9, baseType: !102, size: 256)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "trace_t", file: !103, line: 23, baseType: !104)
!103 = !DIFile(filename: "utils/include/test/trace_manager.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "ef0cfa2f64930baab6e03245b4188b52")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trace_s", file: !103, line: 18, size: 256, elements: !105)
!105 = !{!106, !113, !114, !115}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !104, file: !103, line: 19, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "trace_unit_t", file: !103, line: 16, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trace_unit_s", file: !103, line: 13, size: 128, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !109, file: !103, line: 14, baseType: !10, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !109, file: !103, line: 15, baseType: !5, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !104, file: !103, line: 20, baseType: !5, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !104, file: !103, line: 21, baseType: !5, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !104, file: !103, line: 22, baseType: !24, size: 8, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !99, file: !98, line: 10, baseType: !117, size: 320, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !21, line: 72, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !21, line: 67, size: 320, elements: !119)
!119 = !{!120, !141, !146}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !118, file: !21, line: 69, baseType: !121, size: 320)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !122, line: 22, size: 320, elements: !123)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!123 = !{!124, !125, !127, !128, !129, !130, !132, !133}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !121, file: !122, line: 24, baseType: !66, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !121, file: !122, line: 25, baseType: !126, size: 32, offset: 32)
!126 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !121, file: !122, line: 26, baseType: !66, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !121, file: !122, line: 28, baseType: !126, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !121, file: !122, line: 32, baseType: !66, size: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !121, file: !122, line: 34, baseType: !131, size: 16, offset: 160)
!131 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !121, file: !122, line: 35, baseType: !131, size: 16, offset: 176)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !121, file: !122, line: 36, baseType: !134, size: 128, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !135, line: 55, baseType: !136)
!135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !135, line: 51, size: 128, elements: !137)
!137 = !{!138, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !136, file: !135, line: 53, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !136, file: !135, line: 54, baseType: !139, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !118, file: !21, line: 70, baseType: !142, size: 320)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 320, elements: !144)
!143 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!144 = !{!145}
!145 = !DISubrange(count: 40)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !118, file: !21, line: 71, baseType: !147, size: 64)
!147 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "g_queue", scope: !2, file: !91, line: 25, type: !150, isLocal: false, isDefinition: true)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "queue_t", file: !44, line: 41, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "vqueue_ub_t", file: !33, line: 47, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vqueue_ub_s", file: !33, line: 41, size: 896, elements: !153)
!153 = !{!154, !156, !157, !158, !159}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "enq_l", scope: !152, file: !33, line: 42, baseType: !155, size: 320)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "queue_lock_t", file: !33, line: 31, baseType: !117)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "deq_l", scope: !152, file: !33, line: 43, baseType: !155, size: 320, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !152, file: !33, line: 44, baseType: !31, size: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !152, file: !33, line: 45, baseType: !31, size: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !152, file: !33, line: 46, baseType: !32, size: 128, offset: 768)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "g_final_state", scope: !2, file: !91, line: 28, type: !162, isLocal: false, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 320, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 5)
!165 = !{i32 7, !"Dwarf Version", i32 5}
!166 = !{i32 2, !"Debug Info Version", i32 3}
!167 = !{i32 1, !"wchar_size", i32 4}
!168 = !{i32 7, !"PIC Level", i32 2}
!169 = !{i32 7, !"PIE Level", i32 2}
!170 = !{i32 7, !"uwtable", i32 1}
!171 = !{i32 7, !"frame-pointer", i32 2}
!172 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!173 = distinct !DISubprogram(name: "t1", scope: !94, file: !94, line: 11, type: !174, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !176)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !5}
!176 = !{}
!177 = !DILocalVariable(name: "tid", arg: 1, scope: !173, file: !94, line: 11, type: !5)
!178 = !DILocation(line: 11, column: 12, scope: !173)
!179 = !DILocation(line: 13, column: 9, scope: !173)
!180 = !DILocation(line: 13, column: 5, scope: !173)
!181 = !DILocalVariable(name: "data", scope: !173, file: !94, line: 14, type: !13)
!182 = !DILocation(line: 14, column: 11, scope: !173)
!183 = !DILocation(line: 14, column: 22, scope: !173)
!184 = !DILocation(line: 14, column: 18, scope: !173)
!185 = !DILocation(line: 15, column: 10, scope: !173)
!186 = !DILocation(line: 15, column: 5, scope: !173)
!187 = !DILocation(line: 16, column: 1, scope: !173)
!188 = distinct !DISubprogram(name: "enq", scope: !91, file: !91, line: 94, type: !189, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !176)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !5, !84, !143}
!191 = !DILocalVariable(name: "tid", arg: 1, scope: !188, file: !91, line: 94, type: !5)
!192 = !DILocation(line: 94, column: 13, scope: !188)
!193 = !DILocalVariable(name: "k", arg: 2, scope: !188, file: !91, line: 94, type: !84)
!194 = !DILocation(line: 94, column: 28, scope: !188)
!195 = !DILocalVariable(name: "lbl", arg: 3, scope: !188, file: !91, line: 94, type: !143)
!196 = !DILocation(line: 94, column: 36, scope: !188)
!197 = !DILocation(line: 96, column: 15, scope: !188)
!198 = !DILocation(line: 96, column: 30, scope: !188)
!199 = !DILocation(line: 96, column: 33, scope: !188)
!200 = !DILocation(line: 96, column: 5, scope: !188)
!201 = !DILocation(line: 97, column: 1, scope: !188)
!202 = distinct !DISubprogram(name: "deq", scope: !91, file: !91, line: 100, type: !203, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !176)
!203 = !DISubroutineType(types: !204)
!204 = !{!205, !5}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "data_t", file: !44, line: 49, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "data_s", file: !44, line: 46, size: 128, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !207, file: !44, line: 47, baseType: !84, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "lbl", scope: !207, file: !44, line: 48, baseType: !143, size: 8, offset: 64)
!211 = !DILocalVariable(name: "tid", arg: 1, scope: !202, file: !91, line: 100, type: !5)
!212 = !DILocation(line: 100, column: 13, scope: !202)
!213 = !DILocation(line: 102, column: 22, scope: !202)
!214 = !DILocation(line: 102, column: 12, scope: !202)
!215 = !DILocation(line: 102, column: 5, scope: !202)
!216 = distinct !DISubprogram(name: "t2", scope: !94, file: !94, line: 24, type: !174, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !176)
!217 = !DILocalVariable(name: "tid", arg: 1, scope: !216, file: !94, line: 24, type: !5)
!218 = !DILocation(line: 24, column: 12, scope: !216)
!219 = !DILocation(line: 26, column: 16, scope: !216)
!220 = !DILocalVariable(name: "data", scope: !216, file: !94, line: 27, type: !13)
!221 = !DILocation(line: 27, column: 11, scope: !216)
!222 = !DILocation(line: 27, column: 22, scope: !216)
!223 = !DILocation(line: 27, column: 18, scope: !216)
!224 = !DILocation(line: 28, column: 10, scope: !216)
!225 = !DILocation(line: 28, column: 5, scope: !216)
!226 = !DILocation(line: 29, column: 1, scope: !216)
!227 = distinct !DISubprogram(name: "t3", scope: !94, file: !94, line: 35, type: !174, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !176)
!228 = !DILocalVariable(name: "tid", arg: 1, scope: !227, file: !94, line: 35, type: !5)
!229 = !DILocation(line: 35, column: 12, scope: !227)
!230 = !DILocation(line: 38, column: 15, scope: !231)
!231 = distinct !DILexicalBlock(scope: !227, file: !94, line: 38, column: 9)
!232 = !DILocation(line: 38, column: 9, scope: !231)
!233 = !DILocation(line: 38, column: 9, scope: !227)
!234 = !DILocation(line: 39, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !94, line: 39, column: 9)
!236 = distinct !DILexicalBlock(scope: !237, file: !94, line: 39, column: 9)
!237 = distinct !DILexicalBlock(scope: !231, file: !94, line: 38, column: 21)
!238 = !DILocation(line: 39, column: 9, scope: !236)
!239 = !DILocation(line: 40, column: 5, scope: !237)
!240 = !DILocation(line: 41, column: 21, scope: !241)
!241 = distinct !DILexicalBlock(scope: !231, file: !94, line: 40, column: 12)
!242 = !DILocation(line: 41, column: 9, scope: !241)
!243 = !DILocation(line: 43, column: 1, scope: !227)
!244 = distinct !DISubprogram(name: "empty", scope: !91, file: !91, line: 106, type: !245, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !176)
!245 = !DISubroutineType(types: !246)
!246 = !{!24, !5}
!247 = !DILocalVariable(name: "tid", arg: 1, scope: !244, file: !91, line: 106, type: !5)
!248 = !DILocation(line: 106, column: 15, scope: !244)
!249 = !DILocation(line: 108, column: 24, scope: !244)
!250 = !DILocation(line: 108, column: 12, scope: !244)
!251 = !DILocation(line: 108, column: 5, scope: !244)
!252 = distinct !DISubprogram(name: "queue_clean", scope: !44, file: !44, line: 248, type: !174, scopeLine: 249, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !176)
!253 = !DILocalVariable(name: "tid", arg: 1, scope: !252, file: !44, line: 248, type: !5)
!254 = !DILocation(line: 248, column: 21, scope: !252)
!255 = !DILocation(line: 250, column: 18, scope: !252)
!256 = !DILocation(line: 250, column: 5, scope: !252)
!257 = !DILocation(line: 251, column: 1, scope: !252)
!258 = distinct !DISubprogram(name: "verify", scope: !94, file: !94, line: 45, type: !259, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !176)
!259 = !DISubroutineType(types: !260)
!260 = !{null}
!261 = !DILocation(line: 47, column: 5, scope: !262)
!262 = distinct !DILexicalBlock(scope: !263, file: !94, line: 47, column: 5)
!263 = distinct !DILexicalBlock(scope: !258, file: !94, line: 47, column: 5)
!264 = !DILocation(line: 47, column: 5, scope: !263)
