; ModuleID = '/home/stefano/huawei/libvsync/datastruct/queue/unbounded/verify/unbounded_queue_verify.c'
source_filename = "/home/stefano/huawei/libvsync/datastruct/queue/unbounded/verify/unbounded_queue_verify.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.vatomic64_s = type { i64 }
%struct.vqueue_ub_s = type { %union.pthread_mutex_t, %union.pthread_mutex_t, %struct.vqueue_ub_node_s*, %struct.vqueue_ub_node_s*, %struct.vqueue_ub_node_s }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.vqueue_ub_node_s = type { i8*, %struct.vatomicptr_s }
%struct.vatomicptr_s = type { i8* }
%struct.locked_trace_s = type { %struct.trace_s, %union.pthread_mutex_t }
%struct.trace_s = type { %struct.trace_unit_s*, i64, i64, i8 }
%struct.trace_unit_s = type { i64, i64 }
%struct.data_s = type { i64, i8 }
%struct.run_info_t = type { i64, i64, i8, i8* (i8*)* }
%union.pthread_attr_t = type { i64, [48 x i8] }
%union.pthread_mutexattr_t = type { i32 }
%struct.smr_none_retire_info_t = type { %struct.smr_node_s*, void (%struct.smr_node_s*, i8*)*, i8* }
%struct.smr_node_s = type { %struct.smr_node_core_s, i32, void (%struct.smr_node_s*, i8*)*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_g_vmem_alloc_count", scope: !2, file: !79, line: 14, type: !80, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !76, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/stefano/huawei/libvsync/datastruct/queue/unbounded/verify/unbounded_queue_verify.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "0e469bf9879777a23b2ea686edfbbfe8")
!4 = !{!5, !10, !13, !14, !31, !43, !48}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "vsize_t", file: !6, line: 43, baseType: !7)
!6 = !DIFile(filename: "include/vsync/vtypes.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "80559d0ebc17bc1f9d7b60e2c36ee0f3")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 46, baseType: !9)
!8 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!9 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuintptr_t", file: !6, line: 37, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !12, line: 90, baseType: !9)
!12 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "run_info_t", file: !16, line: 38, baseType: !17)
!16 = !DIFile(filename: "utils/include/test/thread_launcher.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "b854c1934ab1739fab93f88f22662d53")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 33, size: 256, elements: !18)
!18 = !{!19, !22, !23, !26}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !16, line: 34, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !21, line: 27, baseType: !9)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!22 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !17, file: !16, line: 35, baseType: !5, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "assign_me_to_core", scope: !17, file: !16, line: 36, baseType: !24, size: 8, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "vbool_t", file: !6, line: 44, baseType: !25)
!25 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "run_fun", scope: !17, file: !16, line: 37, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_fun_t", file: !16, line: 30, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!13, !13}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "vqueue_ub_node_t", file: !33, line: 39, baseType: !34)
!33 = !DIFile(filename: "datastruct/queue/unbounded/include/vsync/queue/unbounded_queue_total.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "b4e848a3266a7fc151b6fc5ae8d41cb4")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vqueue_ub_node_s", file: !33, line: 36, size: 128, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !34, file: !33, line: 37, baseType: !13, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !33, line: 38, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "vatomicptr_t", file: !39, line: 44, baseType: !40)
!39 = !DIFile(filename: "atomics/include/vsync/atomic/internal/types.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "566b0c58af89e39a453b706e5dc4ad25")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vatomicptr_s", file: !39, line: 42, size: 64, align: 64, elements: !41)
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_v", scope: !40, file: !39, line: 43, baseType: !13, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "print_fun_t", file: !44, line: 227, baseType: !45)
!44 = !DIFile(filename: "datastruct/queue/unbounded/include/test/queue/ub/queue_interface.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "1ac49a72c99bae51c524b5cddaa9bf59")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !13}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "smr_none_retire_info_t", file: !50, line: 21, baseType: !51)
!50 = !DIFile(filename: "memory/smr/include/test/smr/ismr_none.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "82ae29b5d69fc210cc0afc11677b0a3d")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 17, size: 192, elements: !52)
!52 = !{!53, !74, !75}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !51, file: !50, line: 18, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "smr_node_t", file: !56, line: 25, baseType: !57)
!56 = !DIFile(filename: "memory/smr/include/vsync/smr/internal/smr_node.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "33b22eef5fa32f451294d19fc9760563")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "smr_node_s", file: !56, line: 19, size: 256, elements: !58)
!58 = !{!59, !65, !67, !73}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !57, file: !56, line: 20, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "smr_node_core_t", file: !56, line: 17, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "smr_node_core_s", file: !56, line: 15, size: 64, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !56, line: 16, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !57, file: !56, line: 21, baseType: !66, size: 32, offset: 64)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_fun", scope: !57, file: !56, line: 23, baseType: !68, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "smr_node_destroy_fun", file: !56, line: 13, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72, !13}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_fun_arg", scope: !57, file: !56, line: 24, baseType: !13, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !51, file: !50, line: 19, baseType: !68, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !51, file: !50, line: 20, baseType: !13, size: 64, offset: 128)
!76 = !{!0, !77, !89, !92, !95, !97, !99, !101, !154, !166}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "_g_vmem_free_count", scope: !2, file: !79, line: 15, type: !80, isLocal: false, isDefinition: true)
!79 = !DIFile(filename: "utils/include/test/vmem_stdlib.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "8ea894a152afbfd198826e45bdb67542")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "vatomic64_t", file: !39, line: 39, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vatomic64_s", file: !39, line: 37, size: 64, align: 64, elements: !82)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_v", scope: !81, file: !39, line: 38, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuint64_t", file: !6, line: 36, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !86, line: 27, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !88, line: 45, baseType: !9)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "g_len", scope: !2, file: !91, line: 29, type: !5, isLocal: false, isDefinition: true)
!91 = !DIFile(filename: "datastruct/queue/unbounded/verify/unbounded_queue_verify.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "0e469bf9879777a23b2ea686edfbbfe8")
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "msg", scope: !2, file: !94, line: 1, type: !66, isLocal: false, isDefinition: true)
!94 = !DIFile(filename: "datastruct/queue/unbounded/verify/test_case_1.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "3ed2ee8cdfebac763b1acfd331ac1620")
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "g_t1_deq", scope: !2, file: !94, line: 19, type: !84, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "g_deq_success", scope: !2, file: !94, line: 37, type: !24, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "g_t2_deq", scope: !2, file: !94, line: 38, type: !84, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "global_trace", scope: !2, file: !50, line: 15, type: !103, isLocal: false, isDefinition: true)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "locked_trace_t", file: !104, line: 11, baseType: !105)
!104 = !DIFile(filename: "utils/include/test/locked_trace.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "6b9b066c8ea09bc73550cef772f1c7ca")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "locked_trace_s", file: !104, line: 8, size: 576, elements: !106)
!106 = !{!107, !122}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "trace", scope: !105, file: !104, line: 9, baseType: !108, size: 256)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "trace_t", file: !109, line: 23, baseType: !110)
!109 = !DIFile(filename: "utils/include/test/trace_manager.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "ef0cfa2f64930baab6e03245b4188b52")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trace_s", file: !109, line: 18, size: 256, elements: !111)
!111 = !{!112, !119, !120, !121}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !110, file: !109, line: 19, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "trace_unit_t", file: !109, line: 16, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trace_unit_s", file: !109, line: 13, size: 128, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !115, file: !109, line: 14, baseType: !10, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !115, file: !109, line: 15, baseType: !5, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !110, file: !109, line: 20, baseType: !5, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !110, file: !109, line: 21, baseType: !5, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !110, file: !109, line: 22, baseType: !24, size: 8, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !105, file: !104, line: 10, baseType: !123, size: 320, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !21, line: 72, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !21, line: 67, size: 320, elements: !125)
!125 = !{!126, !147, !152}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !124, file: !21, line: 69, baseType: !127, size: 320)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !128, line: 22, size: 320, elements: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!129 = !{!130, !131, !133, !134, !135, !136, !138, !139}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !127, file: !128, line: 24, baseType: !66, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !127, file: !128, line: 25, baseType: !132, size: 32, offset: 32)
!132 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !127, file: !128, line: 26, baseType: !66, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !127, file: !128, line: 28, baseType: !132, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !127, file: !128, line: 32, baseType: !66, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !127, file: !128, line: 34, baseType: !137, size: 16, offset: 160)
!137 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !127, file: !128, line: 35, baseType: !137, size: 16, offset: 176)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !127, file: !128, line: 36, baseType: !140, size: 128, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !141, line: 55, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !141, line: 51, size: 128, elements: !143)
!143 = !{!144, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !142, file: !141, line: 53, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !142, file: !141, line: 54, baseType: !145, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !124, file: !21, line: 70, baseType: !148, size: 320)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 320, elements: !150)
!149 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!150 = !{!151}
!151 = !DISubrange(count: 40)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !124, file: !21, line: 71, baseType: !153, size: 64)
!153 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "g_queue", scope: !2, file: !91, line: 25, type: !156, isLocal: false, isDefinition: true)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "queue_t", file: !44, line: 41, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "vqueue_ub_t", file: !33, line: 47, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vqueue_ub_s", file: !33, line: 41, size: 896, elements: !159)
!159 = !{!160, !162, !163, !164, !165}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "enq_l", scope: !158, file: !33, line: 42, baseType: !161, size: 320)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "queue_lock_t", file: !33, line: 31, baseType: !123)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "deq_l", scope: !158, file: !33, line: 43, baseType: !161, size: 320, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !158, file: !33, line: 44, baseType: !31, size: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !158, file: !33, line: 45, baseType: !31, size: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !158, file: !33, line: 46, baseType: !32, size: 128, offset: 768)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "g_final_state", scope: !2, file: !91, line: 28, type: !168, isLocal: false, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 320, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 5)
!171 = !{i32 7, !"Dwarf Version", i32 5}
!172 = !{i32 2, !"Debug Info Version", i32 3}
!173 = !{i32 1, !"wchar_size", i32 4}
!174 = !{i32 7, !"PIC Level", i32 2}
!175 = !{i32 7, !"PIE Level", i32 2}
!176 = !{i32 7, !"uwtable", i32 1}
!177 = !{i32 7, !"frame-pointer", i32 2}
!178 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!179 = distinct !DISubprogram(name: "t1", scope: !94, file: !94, line: 21, type: !180, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !182)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !5}
!182 = !{}
!183 = !DILocalVariable(name: "tid", arg: 1, scope: !179, file: !94, line: 21, type: !5)
!184 = !DILocation(line: 21, column: 12, scope: !179)
!185 = !DILocation(line: 23, column: 9, scope: !179)
!186 = !DILocation(line: 23, column: 5, scope: !179)
!187 = !DILocation(line: 24, column: 9, scope: !179)
!188 = !DILocation(line: 25, column: 9, scope: !179)
!189 = !DILocation(line: 25, column: 5, scope: !179)
!190 = !DILocalVariable(name: "node", scope: !179, file: !94, line: 26, type: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "data_t", file: !44, line: 49, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "data_s", file: !44, line: 46, size: 128, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !193, file: !44, line: 47, baseType: !84, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "lbl", scope: !193, file: !44, line: 48, baseType: !149, size: 8, offset: 64)
!197 = !DILocation(line: 26, column: 13, scope: !179)
!198 = !DILocation(line: 26, column: 24, scope: !179)
!199 = !DILocation(line: 26, column: 20, scope: !179)
!200 = !DILocation(line: 27, column: 5, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !94, line: 27, column: 5)
!202 = distinct !DILexicalBlock(scope: !179, file: !94, line: 27, column: 5)
!203 = !DILocation(line: 27, column: 5, scope: !202)
!204 = !DILocation(line: 28, column: 5, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !94, line: 28, column: 5)
!206 = distinct !DILexicalBlock(scope: !179, file: !94, line: 28, column: 5)
!207 = !DILocation(line: 28, column: 5, scope: !206)
!208 = !DILocation(line: 29, column: 16, scope: !179)
!209 = !DILocation(line: 29, column: 22, scope: !179)
!210 = !DILocation(line: 29, column: 14, scope: !179)
!211 = !DILocation(line: 30, column: 10, scope: !179)
!212 = !DILocation(line: 30, column: 5, scope: !179)
!213 = !DILocation(line: 31, column: 1, scope: !179)
!214 = distinct !DISubprogram(name: "enq", scope: !91, file: !91, line: 94, type: !215, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !182)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !5, !84, !149}
!217 = !DILocalVariable(name: "tid", arg: 1, scope: !214, file: !91, line: 94, type: !5)
!218 = !DILocation(line: 94, column: 13, scope: !214)
!219 = !DILocalVariable(name: "k", arg: 2, scope: !214, file: !91, line: 94, type: !84)
!220 = !DILocation(line: 94, column: 28, scope: !214)
!221 = !DILocalVariable(name: "lbl", arg: 3, scope: !214, file: !91, line: 94, type: !149)
!222 = !DILocation(line: 94, column: 36, scope: !214)
!223 = !DILocation(line: 96, column: 15, scope: !214)
!224 = !DILocation(line: 96, column: 30, scope: !214)
!225 = !DILocation(line: 96, column: 33, scope: !214)
!226 = !DILocation(line: 96, column: 5, scope: !214)
!227 = !DILocation(line: 97, column: 1, scope: !214)
!228 = distinct !DISubprogram(name: "deq", scope: !91, file: !91, line: 100, type: !229, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !182)
!229 = !DISubroutineType(types: !230)
!230 = !{!191, !5}
!231 = !DILocalVariable(name: "tid", arg: 1, scope: !228, file: !91, line: 100, type: !5)
!232 = !DILocation(line: 100, column: 13, scope: !228)
!233 = !DILocation(line: 102, column: 22, scope: !228)
!234 = !DILocation(line: 102, column: 12, scope: !228)
!235 = !DILocation(line: 102, column: 5, scope: !228)
!236 = distinct !DISubprogram(name: "t2", scope: !94, file: !94, line: 40, type: !180, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !182)
!237 = !DILocalVariable(name: "tid", arg: 1, scope: !236, file: !94, line: 40, type: !5)
!238 = !DILocation(line: 40, column: 12, scope: !236)
!239 = !DILocalVariable(name: "node", scope: !236, file: !94, line: 42, type: !191)
!240 = !DILocation(line: 42, column: 13, scope: !236)
!241 = !DILocation(line: 42, column: 24, scope: !236)
!242 = !DILocation(line: 42, column: 20, scope: !236)
!243 = !DILocation(line: 43, column: 9, scope: !244)
!244 = distinct !DILexicalBlock(scope: !236, file: !94, line: 43, column: 9)
!245 = !DILocation(line: 43, column: 9, scope: !236)
!246 = !DILocation(line: 44, column: 9, scope: !247)
!247 = distinct !DILexicalBlock(scope: !248, file: !94, line: 44, column: 9)
!248 = distinct !DILexicalBlock(scope: !249, file: !94, line: 44, column: 9)
!249 = distinct !DILexicalBlock(scope: !244, file: !94, line: 43, column: 15)
!250 = !DILocation(line: 44, column: 9, scope: !248)
!251 = !DILocation(line: 45, column: 23, scope: !249)
!252 = !DILocation(line: 46, column: 25, scope: !249)
!253 = !DILocation(line: 46, column: 31, scope: !249)
!254 = !DILocation(line: 46, column: 23, scope: !249)
!255 = !DILocation(line: 48, column: 13, scope: !256)
