; ModuleID = 'benchmarks/miscellaneous/pthread.c'
source_filename = "benchmarks/miscellaneous/pthread.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, %union.anon }
%union.anon = type { %struct.__pthread_internal_slist }
%struct.__pthread_internal_slist = type { ptr }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.__atomic_wide_counter, %union.__atomic_wide_counter, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.__atomic_wide_counter = type { i64 }
%union.pthread_attr_t = type { i64, [32 x i8] }
%union.pthread_mutexattr_t = type { i32 }
%union.pthread_condattr_t = type { i32 }
%struct.timespec = type { i64, i64 }
%union.pthread_rwlockattr_t = type { i64 }
%union.pthread_rwlock_t = type { i64, [24 x i8] }

@__func__.thread_create = private unnamed_addr constant [14 x i8] c"thread_create\00", align 1, !dbg !0
@.str = private unnamed_addr constant [10 x i8] c"pthread.c\00", align 1, !dbg !8
@.str.1 = private unnamed_addr constant [12 x i8] c"status == 0\00", align 1, !dbg !13
@__func__.thread_join = private unnamed_addr constant [12 x i8] c"thread_join\00", align 1, !dbg !18
@__func__.mutex_init = private unnamed_addr constant [11 x i8] c"mutex_init\00", align 1, !dbg !21

!72 = !DIEnumerator(name: "PTHREAD_MUTEX_RECURSIVE", value: 1)
!73 = !DIEnumerator(name: "PTHREAD_MUTEX_ERRORCHECK", value: 2)
!74 = !DIEnumerator(name: "PTHREAD_MUTEX_DEFAULT", value: 0)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 691, baseType: !65, size: 32, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIEnumerator(name: "PTHREAD_PRIO_NONE", value: 0)
!78 = !DIEnumerator(name: "PTHREAD_PRIO_INHERIT", value: 1)
!79 = !DIEnumerator(name: "PTHREAD_PRIO_PROTECT", value: 2)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 714, baseType: !65, size: 32, elements: !81)
!81 = !{!82, !83}
!82 = !DIEnumerator(name: "PTHREAD_PROCESS_PRIVATE", value: 0)
!83 = !DIEnumerator(name: "PTHREAD_PROCESS_SHARED", value: 1)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 667, baseType: !65, size: 32, elements: !85)
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "PTHREAD_CREATE_JOINABLE", value: 0)
!87 = !DIEnumerator(name: "PTHREAD_CREATE_DETACHED", value: 1)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !{!0, !8, !13, !18, !21, !26, !28, !30, !35, !37, !42, !47, !50, !52, !54, !59, !92, !94, !99, !101, !103, !105, !107, !109, !111, !113, !118, !121, !126, !128, !133, !138, !140, !175, !209, !213}
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !49, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 144, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 18)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !20, isLocal: true, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !2, line: 278, type: !56, isLocal: true, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !3, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 297, type: !3, isLocal: true, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !3, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !20, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 372, type: !23, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !2, line: 375, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 224, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 28)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !40)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 420, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 19)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 423, type: !15, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 434, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 17)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !2, line: 436, type: !135, isLocal: true, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 432, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 54)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 440, type: !135, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "cond_mutex", scope: !61, file: !2, line: 191, type: !142, isLocal: false, isDefinition: true)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !64, line: 329, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 324, size: 256, elements: !144)
!144 = !{!145, !169, !173}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !143, file: !64, line: 326, baseType: !146, size: 256)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !64, line: 258, size: 256, elements: !147)
!147 = !{!148, !150, !151, !152, !153, !154}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !146, file: !64, line: 260, baseType: !149, size: 32)
!149 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !146, file: !64, line: 261, baseType: !65, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !146, file: !64, line: 262, baseType: !149, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !146, file: !64, line: 263, baseType: !149, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !146, file: !64, line: 264, baseType: !65, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !146, file: !64, line: 265, baseType: !155, size: 64, offset: 192)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !146, file: !64, line: 265, size: 64, elements: !156)
!156 = !{!157, !163}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__elision_data", scope: !155, file: !64, line: 271, baseType: !158, size: 32)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !155, file: !64, line: 267, size: 32, elements: !159)
!159 = !{!160, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__espins", scope: !158, file: !64, line: 269, baseType: !161, size: 16)
!161 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__eelision", scope: !158, file: !64, line: 270, baseType: !161, size: 16, offset: 16)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !155, file: !64, line: 272, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_slist_t", file: !64, line: 257, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_slist", file: !64, line: 254, size: 64, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !165, file: !64, line: 256, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !143, file: !64, line: 327, baseType: !170, size: 192)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 24)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !143, file: !64, line: 328, baseType: !174, size: 64)
!174 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "cond", scope: !61, file: !2, line: 192, type: !177, isLocal: false, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !64, line: 335, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 330, size: 384, elements: !179)
!179 = !{!180, !203, !207}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !178, file: !64, line: 332, baseType: !181, size: 384)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !64, line: 289, size: 384, elements: !182)
!182 = !{!183, !194, !195, !199, !200, !201, !202}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !181, file: !64, line: 291, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !64, line: 248, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 240, size: 64, elements: !186)
!186 = !{!187, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !185, file: !64, line: 242, baseType: !188, size: 64)
!188 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !185, file: !64, line: 247, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !185, file: !64, line: 243, size: 64, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !190, file: !64, line: 245, baseType: !65, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !190, file: !64, line: 246, baseType: !65, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !181, file: !64, line: 292, baseType: !184, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !181, file: !64, line: 293, baseType: !196, size: 64, offset: 128)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 64, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 2)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !181, file: !64, line: 294, baseType: !196, size: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !181, file: !64, line: 295, baseType: !65, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !181, file: !64, line: 296, baseType: !65, size: 32, offset: 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !181, file: !64, line: 297, baseType: !196, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !178, file: !64, line: 333, baseType: !204, size: 384)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 384, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 48)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !178, file: !64, line: 334, baseType: !208, size: 64)
!208 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "latest_thread", scope: !61, file: !2, line: 359, type: !211, isLocal: false, isDefinition: true)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !64, line: 305, baseType: !212)
!212 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "local_data", scope: !61, file: !2, line: 360, type: !215, isLocal: false, isDefinition: true)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !64, line: 316, baseType: !65)
!216 = !{i32 7, !"Dwarf Version", i32 5}
!217 = !{i32 2, !"Debug Info Version", i32 3}
!218 = !{i32 1, !"wchar_size", i32 4}
!219 = !{i32 8, !"PIC Level", i32 2}
!220 = !{i32 7, !"PIE Level", i32 2}
!221 = !{i32 7, !"uwtable", i32 2}
!222 = !{i32 7, !"frame-pointer", i32 2}
!223 = !{!"Homebrew clang version 19.1.7"}
!224 = distinct !DISubprogram(name: "thread_create", scope: !2, file: !2, line: 12, type: !225, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!225 = !DISubroutineType(types: !226)
!226 = !{!211, !227, !90}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!90, !90}
!230 = !{}
!231 = !DILocalVariable(name: "runner", arg: 1, scope: !224, file: !2, line: 12, type: !227)
!232 = !DILocation(line: 12, column: 32, scope: !224)
!233 = !DILocalVariable(name: "data", arg: 2, scope: !224, file: !2, line: 12, type: !90)
!234 = !DILocation(line: 12, column: 54, scope: !224)
!235 = !DILocalVariable(name: "id", scope: !224, file: !2, line: 14, type: !211)
!236 = !DILocation(line: 14, column: 15, scope: !224)
!237 = !DILocalVariable(name: "attr", scope: !224, file: !2, line: 15, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !64, line: 323, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pthread_attr_t", file: !64, line: 318, size: 320, elements: !240)
!240 = !{!241, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !239, file: !64, line: 320, baseType: !242, size: 288)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 288, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 36)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !239, file: !64, line: 321, baseType: !174, size: 64)
!246 = !DILocation(line: 15, column: 20, scope: !224)
!247 = !DILocation(line: 16, column: 5, scope: !224)
!248 = !DILocalVariable(name: "status", scope: !224, file: !2, line: 17, type: !149)
!249 = !DILocation(line: 17, column: 9, scope: !224)
!250 = !DILocation(line: 17, column: 45, scope: !224)
!251 = !DILocation(line: 17, column: 53, scope: !224)
!252 = !DILocation(line: 17, column: 18, scope: !224)
!253 = !DILocation(line: 18, column: 5, scope: !224)
!254 = !DILocation(line: 19, column: 5, scope: !224)
!255 = !DILocation(line: 20, column: 12, scope: !224)
!256 = !DILocation(line: 20, column: 5, scope: !224)
!257 = distinct !DISubprogram(name: "thread_join", scope: !2, file: !2, line: 23, type: !258, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!258 = !DISubroutineType(types: !259)
!259 = !{!90, !211}
!260 = !DILocalVariable(name: "id", arg: 1, scope: !257, file: !2, line: 23, type: !211)
!261 = !DILocation(line: 23, column: 29, scope: !257)
!262 = !DILocalVariable(name: "result", scope: !257, file: !2, line: 25, type: !90)
!263 = !DILocation(line: 25, column: 11, scope: !257)
!264 = !DILocalVariable(name: "status", scope: !257, file: !2, line: 26, type: !149)
!265 = !DILocation(line: 26, column: 9, scope: !257)
!266 = !DILocation(line: 26, column: 31, scope: !257)
!267 = !DILocation(line: 26, column: 18, scope: !257)
!268 = !DILocation(line: 27, column: 5, scope: !257)
!269 = !DILocation(line: 28, column: 12, scope: !257)
!270 = !DILocation(line: 28, column: 5, scope: !257)
!271 = distinct !DISubprogram(name: "mutex_init", scope: !2, file: !2, line: 41, type: !272, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !274, !149, !149, !149}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!275 = !DILocalVariable(name: "lock", arg: 1, scope: !271, file: !2, line: 41, type: !274)
!276 = !DILocation(line: 41, column: 34, scope: !271)
!277 = !DILocalVariable(name: "type", arg: 2, scope: !271, file: !2, line: 41, type: !149)
!278 = !DILocation(line: 41, column: 44, scope: !271)
!279 = !DILocalVariable(name: "protocol", arg: 3, scope: !271, file: !2, line: 41, type: !149)
!280 = !DILocation(line: 41, column: 54, scope: !271)
!281 = !DILocalVariable(name: "prioceiling", arg: 4, scope: !271, file: !2, line: 41, type: !149)
!282 = !DILocation(line: 41, column: 68, scope: !271)
!283 = !DILocalVariable(name: "status", scope: !271, file: !2, line: 43, type: !149)
!284 = !DILocation(line: 43, column: 9, scope: !271)
!285 = !DILocalVariable(name: "value", scope: !271, file: !2, line: 44, type: !149)
!286 = !DILocation(line: 44, column: 9, scope: !271)
!287 = !DILocalVariable(name: "attributes", scope: !271, file: !2, line: 45, type: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutexattr_t", file: !64, line: 310, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 306, size: 32, elements: !290)
!290 = !{!291, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !289, file: !64, line: 308, baseType: !292, size: 32)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 4)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !289, file: !64, line: 309, baseType: !149, size: 32)
!296 = !DILocation(line: 45, column: 25, scope: !271)
!297 = !DILocation(line: 46, column: 14, scope: !271)
!298 = !DILocation(line: 46, column: 12, scope: !271)
!299 = !DILocation(line: 47, column: 5, scope: !271)
!300 = !DILocation(line: 49, column: 53, scope: !271)
!301 = !DILocation(line: 49, column: 14, scope: !271)
!302 = !DILocation(line: 49, column: 12, scope: !271)
!303 = !DILocation(line: 50, column: 5, scope: !271)
!304 = !DILocation(line: 51, column: 14, scope: !271)
!305 = !DILocation(line: 51, column: 12, scope: !271)
!306 = !DILocation(line: 52, column: 5, scope: !271)
!307 = !DILocation(line: 54, column: 57, scope: !271)
!308 = !DILocation(line: 54, column: 14, scope: !271)
!309 = !DILocation(line: 54, column: 12, scope: !271)
!310 = !DILocation(line: 55, column: 5, scope: !271)
!311 = !DILocation(line: 56, column: 14, scope: !271)
!312 = !DILocation(line: 56, column: 12, scope: !271)
!313 = !DILocation(line: 57, column: 5, scope: !271)
!314 = !DILocation(line: 59, column: 60, scope: !271)
!315 = !DILocation(line: 59, column: 14, scope: !271)
!316 = !DILocation(line: 59, column: 12, scope: !271)
!317 = !DILocation(line: 60, column: 5, scope: !271)
!318 = !DILocation(line: 61, column: 14, scope: !271)
!319 = !DILocation(line: 61, column: 12, scope: !271)
!320 = !DILocation(line: 62, column: 5, scope: !271)
!321 = !DILocation(line: 64, column: 33, scope: !271)
!322 = !DILocation(line: 64, column: 14, scope: !271)
!323 = !DILocation(line: 64, column: 12, scope: !271)
!324 = !DILocation(line: 65, column: 5, scope: !271)
!325 = !DILocation(line: 66, column: 14, scope: !271)
!326 = !DILocation(line: 66, column: 12, scope: !271)
!327 = !DILocation(line: 67, column: 5, scope: !271)
!328 = !DILocation(line: 68, column: 1, scope: !271)
!329 = distinct !DISubprogram(name: "mutex_destroy", scope: !2, file: !2, line: 70, type: !330, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !274}
!332 = !DILocalVariable(name: "lock", arg: 1, scope: !329, file: !2, line: 70, type: !274)
!333 = !DILocation(line: 70, column: 37, scope: !329)
!334 = !DILocalVariable(name: "status", scope: !329, file: !2, line: 72, type: !149)
!335 = !DILocation(line: 72, column: 9, scope: !329)
!336 = !DILocation(line: 72, column: 40, scope: !329)
!337 = !DILocation(line: 72, column: 18, scope: !329)
!338 = !DILocation(line: 73, column: 5, scope: !329)
!339 = !DILocation(line: 74, column: 1, scope: !329)
!340 = distinct !DISubprogram(name: "mutex_lock", scope: !2, file: !2, line: 76, type: !330, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!341 = !DILocalVariable(name: "lock", arg: 1, scope: !340, file: !2, line: 76, type: !274)
!342 = !DILocation(line: 76, column: 34, scope: !340)
!343 = !DILocalVariable(name: "status", scope: !340, file: !2, line: 78, type: !149)
!344 = !DILocation(line: 78, column: 9, scope: !340)
!345 = !DILocation(line: 78, column: 37, scope: !340)
!346 = !DILocation(line: 78, column: 18, scope: !340)
!347 = !DILocation(line: 79, column: 5, scope: !340)
!348 = !DILocation(line: 80, column: 1, scope: !340)
!349 = distinct !DISubprogram(name: "mutex_trylock", scope: !2, file: !2, line: 82, type: !350, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!350 = !DISubroutineType(types: !351)
!351 = !{!352, !274}
!352 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!353 = !DILocalVariable(name: "lock", arg: 1, scope: !349, file: !2, line: 82, type: !274)
!354 = !DILocation(line: 82, column: 37, scope: !349)
!355 = !DILocalVariable(name: "status", scope: !349, file: !2, line: 84, type: !149)
!356 = !DILocation(line: 84, column: 9, scope: !349)
!357 = !DILocation(line: 84, column: 40, scope: !349)
!358 = !DILocation(line: 84, column: 18, scope: !349)
!359 = !DILocation(line: 86, column: 12, scope: !349)
!360 = !DILocation(line: 86, column: 19, scope: !349)
!361 = !DILocation(line: 86, column: 5, scope: !349)
!362 = distinct !DISubprogram(name: "mutex_unlock", scope: !2, file: !2, line: 89, type: !330, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!363 = !DILocalVariable(name: "lock", arg: 1, scope: !362, file: !2, line: 89, type: !274)
!364 = !DILocation(line: 89, column: 36, scope: !362)
!365 = !DILocalVariable(name: "status", scope: !362, file: !2, line: 91, type: !149)
!366 = !DILocation(line: 91, column: 9, scope: !362)
!367 = !DILocation(line: 91, column: 39, scope: !362)
!368 = !DILocation(line: 91, column: 18, scope: !362)
!369 = !DILocation(line: 92, column: 5, scope: !362)
!370 = !DILocation(line: 93, column: 1, scope: !362)
!371 = distinct !DISubprogram(name: "mutex_test", scope: !2, file: !2, line: 95, type: !372, scopeLine: 96, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!372 = !DISubroutineType(types: !373)
!373 = !{null}
!374 = !DILocalVariable(name: "mutex0", scope: !371, file: !2, line: 97, type: !142)
!375 = !DILocation(line: 97, column: 21, scope: !371)
!376 = !DILocalVariable(name: "mutex1", scope: !371, file: !2, line: 98, type: !142)
!377 = !DILocation(line: 98, column: 21, scope: !371)
!378 = !DILocation(line: 100, column: 5, scope: !371)
!379 = !DILocation(line: 101, column: 5, scope: !371)
!380 = !DILocation(line: 104, column: 9, scope: !381)
!381 = distinct !DILexicalBlock(scope: !371, file: !2, line: 103, column: 5)
!382 = !DILocalVariable(name: "success", scope: !381, file: !2, line: 105, type: !352)
!383 = !DILocation(line: 105, column: 14, scope: !381)
!384 = !DILocation(line: 105, column: 24, scope: !381)
!385 = !DILocation(line: 106, column: 9, scope: !381)
!386 = !DILocation(line: 107, column: 9, scope: !381)
!387 = !DILocation(line: 111, column: 9, scope: !388)
!388 = distinct !DILexicalBlock(scope: !371, file: !2, line: 110, column: 5)
!389 = !DILocalVariable(name: "success", scope: !390, file: !2, line: 114, type: !352)
!390 = distinct !DILexicalBlock(scope: !388, file: !2, line: 113, column: 9)
!391 = !DILocation(line: 114, column: 18, scope: !390)
!392 = !DILocation(line: 114, column: 28, scope: !390)
!393 = !DILocation(line: 115, column: 13, scope: !390)
!394 = !DILocation(line: 116, column: 13, scope: !390)
!395 = !DILocalVariable(name: "success", scope: !396, file: !2, line: 120, type: !352)
!396 = distinct !DILexicalBlock(scope: !388, file: !2, line: 119, column: 9)
!397 = !DILocation(line: 120, column: 18, scope: !396)
!398 = !DILocation(line: 120, column: 28, scope: !396)
!399 = !DILocation(line: 121, column: 13, scope: !396)
!400 = !DILocation(line: 122, column: 13, scope: !396)
!401 = !DILocation(line: 132, column: 9, scope: !388)
!402 = !DILocation(line: 135, column: 5, scope: !371)
!403 = !DILocation(line: 136, column: 5, scope: !371)
!404 = !DILocation(line: 137, column: 1, scope: !371)
!405 = distinct !DISubprogram(name: "cond_init", scope: !2, file: !2, line: 141, type: !406, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!409 = !DILocalVariable(name: "cond", arg: 1, scope: !405, file: !2, line: 141, type: !408)
!410 = !DILocation(line: 141, column: 32, scope: !405)
!411 = !DILocalVariable(name: "status", scope: !405, file: !2, line: 143, type: !149)
!412 = !DILocation(line: 143, column: 9, scope: !405)
!413 = !DILocalVariable(name: "attr", scope: !405, file: !2, line: 144, type: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_condattr_t", file: !64, line: 315, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 311, size: 32, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !415, file: !64, line: 313, baseType: !292, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !415, file: !64, line: 314, baseType: !149, size: 32)
!419 = !DILocation(line: 144, column: 24, scope: !405)
!420 = !DILocation(line: 146, column: 14, scope: !405)
!421 = !DILocation(line: 146, column: 12, scope: !405)
!422 = !DILocation(line: 147, column: 5, scope: !405)
!423 = !DILocation(line: 149, column: 32, scope: !405)
!424 = !DILocation(line: 149, column: 14, scope: !405)
!425 = !DILocation(line: 149, column: 12, scope: !405)
!426 = !DILocation(line: 150, column: 5, scope: !405)
!427 = !DILocation(line: 152, column: 14, scope: !405)
!428 = !DILocation(line: 152, column: 12, scope: !405)
!429 = !DILocation(line: 153, column: 5, scope: !405)
!430 = !DILocation(line: 154, column: 1, scope: !405)
!431 = distinct !DISubprogram(name: "cond_destroy", scope: !2, file: !2, line: 156, type: !406, scopeLine: 157, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!432 = !DILocalVariable(name: "cond", arg: 1, scope: !431, file: !2, line: 156, type: !408)
!433 = !DILocation(line: 156, column: 35, scope: !431)
!434 = !DILocalVariable(name: "status", scope: !431, file: !2, line: 158, type: !149)
!435 = !DILocation(line: 158, column: 9, scope: !431)
!436 = !DILocation(line: 158, column: 39, scope: !431)
!437 = !DILocation(line: 158, column: 18, scope: !431)
!438 = !DILocation(line: 159, column: 5, scope: !431)
!439 = !DILocation(line: 160, column: 1, scope: !431)
!440 = distinct !DISubprogram(name: "cond_signal", scope: !2, file: !2, line: 162, type: !406, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!441 = !DILocalVariable(name: "cond", arg: 1, scope: !440, file: !2, line: 162, type: !408)
!442 = !DILocation(line: 162, column: 34, scope: !440)
!443 = !DILocalVariable(name: "status", scope: !440, file: !2, line: 164, type: !149)
!444 = !DILocation(line: 164, column: 9, scope: !440)
!445 = !DILocation(line: 164, column: 38, scope: !440)
!446 = !DILocation(line: 164, column: 18, scope: !440)
!447 = !DILocation(line: 165, column: 5, scope: !440)
!448 = !DILocation(line: 166, column: 1, scope: !440)
!449 = distinct !DISubprogram(name: "cond_broadcast", scope: !2, file: !2, line: 168, type: !406, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!450 = !DILocalVariable(name: "cond", arg: 1, scope: !449, file: !2, line: 168, type: !408)
!451 = !DILocation(line: 168, column: 37, scope: !449)
!452 = !DILocalVariable(name: "status", scope: !449, file: !2, line: 170, type: !149)
!453 = !DILocation(line: 170, column: 9, scope: !449)
!454 = !DILocation(line: 170, column: 41, scope: !449)
!455 = !DILocation(line: 170, column: 18, scope: !449)
!456 = !DILocation(line: 171, column: 5, scope: !449)
!457 = !DILocation(line: 172, column: 1, scope: !449)
!458 = distinct !DISubprogram(name: "cond_wait", scope: !2, file: !2, line: 174, type: !459, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !408, !274}
!461 = !DILocalVariable(name: "cond", arg: 1, scope: !458, file: !2, line: 174, type: !408)
!462 = !DILocation(line: 174, column: 32, scope: !458)
!463 = !DILocalVariable(name: "lock", arg: 2, scope: !458, file: !2, line: 174, type: !274)
!464 = !DILocation(line: 174, column: 55, scope: !458)
!465 = !DILocalVariable(name: "status", scope: !458, file: !2, line: 176, type: !149)
!466 = !DILocation(line: 176, column: 9, scope: !458)
!467 = !DILocation(line: 176, column: 36, scope: !458)
!468 = !DILocation(line: 176, column: 42, scope: !458)
!469 = !DILocation(line: 176, column: 18, scope: !458)
!470 = !DILocation(line: 178, column: 1, scope: !458)
!471 = distinct !DISubprogram(name: "cond_timedwait", scope: !2, file: !2, line: 180, type: !472, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !408, !274, !208}
!474 = !DILocalVariable(name: "cond", arg: 1, scope: !471, file: !2, line: 180, type: !408)
!475 = !DILocation(line: 180, column: 37, scope: !471)
!476 = !DILocalVariable(name: "lock", arg: 2, scope: !471, file: !2, line: 180, type: !274)
!477 = !DILocation(line: 180, column: 60, scope: !471)
!478 = !DILocalVariable(name: "millis", arg: 3, scope: !471, file: !2, line: 180, type: !208)
!479 = !DILocation(line: 180, column: 76, scope: !471)
!480 = !DILocalVariable(name: "ts", scope: !471, file: !2, line: 183, type: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !64, line: 212, size: 128, elements: !482)
!482 = !{!483, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !481, file: !64, line: 214, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !64, line: 108, baseType: !174)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !481, file: !64, line: 215, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !64, line: 125, baseType: !174)
!487 = !DILocation(line: 183, column: 21, scope: !471)
!488 = !DILocation(line: 187, column: 11, scope: !471)
!489 = !DILocalVariable(name: "status", scope: !471, file: !2, line: 188, type: !149)
!490 = !DILocation(line: 188, column: 9, scope: !471)
!491 = !DILocation(line: 188, column: 41, scope: !471)
!492 = !DILocation(line: 188, column: 47, scope: !471)
!493 = !DILocation(line: 188, column: 18, scope: !471)
!494 = !DILocation(line: 189, column: 1, scope: !471)
!495 = distinct !DISubprogram(name: "cond_worker", scope: !2, file: !2, line: 195, type: !228, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!496 = !DILocalVariable(name: "message", arg: 1, scope: !495, file: !2, line: 195, type: !90)
!497 = !DILocation(line: 195, column: 25, scope: !495)
!498 = !DILocalVariable(name: "idle", scope: !495, file: !2, line: 197, type: !352)
!499 = !DILocation(line: 197, column: 10, scope: !495)
!500 = !DILocation(line: 199, column: 9, scope: !501)
!501 = distinct !DILexicalBlock(scope: !495, file: !2, line: 198, column: 5)
!502 = !DILocation(line: 200, column: 9, scope: !501)
!503 = !DILocation(line: 201, column: 9, scope: !501)
!504 = !DILocation(line: 202, column: 9, scope: !501)
!505 = !DILocation(line: 203, column: 16, scope: !501)
!506 = !DILocation(line: 203, column: 22, scope: !501)
!507 = !DILocation(line: 203, column: 14, scope: !501)
!508 = !DILocation(line: 204, column: 9, scope: !501)
!509 = !DILocation(line: 206, column: 9, scope: !510)
!510 = distinct !DILexicalBlock(scope: !495, file: !2, line: 206, column: 9)
!511 = !DILocation(line: 206, column: 9, scope: !495)
!512 = !DILocation(line: 207, column: 25, scope: !510)
!513 = !DILocation(line: 207, column: 34, scope: !510)
!514 = !DILocation(line: 207, column: 9, scope: !510)
!515 = !DILocation(line: 208, column: 10, scope: !495)
!516 = !DILocation(line: 210, column: 9, scope: !517)
!517 = distinct !DILexicalBlock(scope: !495, file: !2, line: 209, column: 5)
!518 = !DILocation(line: 211, column: 9, scope: !517)
!519 = !DILocation(line: 212, column: 9, scope: !517)
!520 = !DILocation(line: 213, column: 9, scope: !517)
!521 = !DILocation(line: 214, column: 16, scope: !517)
!522 = !DILocation(line: 214, column: 22, scope: !517)
!523 = !DILocation(line: 214, column: 14, scope: !517)
!524 = !DILocation(line: 215, column: 9, scope: !517)
!525 = !DILocation(line: 217, column: 9, scope: !526)
!526 = distinct !DILexicalBlock(scope: !495, file: !2, line: 217, column: 9)
!527 = !DILocation(line: 217, column: 9, scope: !495)
!528 = !DILocation(line: 218, column: 25, scope: !526)
!529 = !DILocation(line: 218, column: 34, scope: !526)
!530 = !DILocation(line: 218, column: 9, scope: !526)
!531 = !DILocation(line: 219, column: 12, scope: !495)
!532 = !DILocation(line: 219, column: 5, scope: !495)
!533 = !DILocation(line: 220, column: 1, scope: !495)
!534 = distinct !DISubprogram(name: "cond_test", scope: !2, file: !2, line: 222, type: !372, scopeLine: 223, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!535 = !DILocalVariable(name: "message", scope: !534, file: !2, line: 224, type: !90)
!536 = !DILocation(line: 224, column: 11, scope: !534)
!537 = !DILocation(line: 225, column: 5, scope: !534)
!538 = !DILocation(line: 226, column: 5, scope: !534)
!539 = !DILocalVariable(name: "worker", scope: !534, file: !2, line: 228, type: !211)
!540 = !DILocation(line: 228, column: 15, scope: !534)
!541 = !DILocation(line: 228, column: 51, scope: !534)
!542 = !DILocation(line: 228, column: 24, scope: !534)
!543 = !DILocation(line: 231, column: 9, scope: !544)
!544 = distinct !DILexicalBlock(scope: !534, file: !2, line: 230, column: 5)
!545 = !DILocation(line: 232, column: 9, scope: !544)
!546 = !DILocation(line: 233, column: 9, scope: !544)
!547 = !DILocation(line: 234, column: 9, scope: !544)
!548 = !DILocation(line: 238, column: 9, scope: !549)
!549 = distinct !DILexicalBlock(scope: !534, file: !2, line: 237, column: 5)
!550 = !DILocation(line: 239, column: 9, scope: !549)
!551 = !DILocation(line: 240, column: 9, scope: !549)
!552 = !DILocation(line: 241, column: 9, scope: !549)
!553 = !DILocalVariable(name: "result", scope: !534, file: !2, line: 244, type: !90)
!554 = !DILocation(line: 244, column: 11, scope: !534)
!555 = !DILocation(line: 244, column: 32, scope: !534)
!556 = !DILocation(line: 244, column: 20, scope: !534)
!557 = !DILocation(line: 245, column: 5, scope: !534)
!558 = !DILocation(line: 247, column: 5, scope: !534)
!559 = !DILocation(line: 248, column: 5, scope: !534)
!560 = !DILocation(line: 249, column: 1, scope: !534)
!561 = distinct !DISubprogram(name: "rwlock_init", scope: !2, file: !2, line: 256, type: !562, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !564, !149}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !64, line: 341, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 336, size: 256, elements: !567)
!567 = !{!568, !584, !588}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !566, file: !64, line: 338, baseType: !569, size: 256)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_rwlock_arch_t", file: !64, line: 275, size: 256, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !579, !580, !582, !583}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__readers", scope: !569, file: !64, line: 277, baseType: !65, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__writers", scope: !569, file: !64, line: 278, baseType: !65, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__wrphase_futex", scope: !569, file: !64, line: 279, baseType: !65, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__writers_futex", scope: !569, file: !64, line: 280, baseType: !65, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !569, file: !64, line: 281, baseType: !65, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !569, file: !64, line: 282, baseType: !65, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !569, file: !64, line: 283, baseType: !578, size: 8, offset: 192)
!578 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !569, file: !64, line: 284, baseType: !578, size: 8, offset: 200)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !569, file: !64, line: 285, baseType: !581, size: 8, offset: 208)
!581 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !569, file: !64, line: 286, baseType: !578, size: 8, offset: 216)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__cur_writer", scope: !569, file: !64, line: 287, baseType: !149, size: 32, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !566, file: !64, line: 339, baseType: !585, size: 256)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 256, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !566, file: !64, line: 340, baseType: !174, size: 64)
!589 = !DILocalVariable(name: "lock", arg: 1, scope: !561, file: !2, line: 256, type: !564)
!590 = !DILocation(line: 256, column: 36, scope: !561)
!591 = !DILocalVariable(name: "shared", arg: 2, scope: !561, file: !2, line: 256, type: !149)
!592 = !DILocation(line: 256, column: 46, scope: !561)
!593 = !DILocalVariable(name: "status", scope: !561, file: !2, line: 258, type: !149)
!594 = !DILocation(line: 258, column: 9, scope: !561)
!595 = !DILocalVariable(name: "value", scope: !561, file: !2, line: 259, type: !149)
!596 = !DILocation(line: 259, column: 9, scope: !561)
!597 = !DILocalVariable(name: "attributes", scope: !561, file: !2, line: 260, type: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlockattr_t", file: !64, line: 346, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 342, size: 64, elements: !600)
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !599, file: !64, line: 344, baseType: !44, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !599, file: !64, line: 345, baseType: !174, size: 64)
!603 = !DILocation(line: 260, column: 26, scope: !561)
!604 = !DILocation(line: 261, column: 14, scope: !561)
!605 = !DILocation(line: 261, column: 12, scope: !561)
!606 = !DILocation(line: 262, column: 5, scope: !561)
!607 = !DILocation(line: 264, column: 57, scope: !561)
!608 = !DILocation(line: 264, column: 14, scope: !561)
!609 = !DILocation(line: 264, column: 12, scope: !561)
!610 = !DILocation(line: 265, column: 5, scope: !561)
!611 = !DILocation(line: 266, column: 14, scope: !561)
!612 = !DILocation(line: 266, column: 12, scope: !561)
!613 = !DILocation(line: 267, column: 5, scope: !561)
!614 = !DILocation(line: 269, column: 34, scope: !561)
!615 = !DILocation(line: 269, column: 14, scope: !561)
!616 = !DILocation(line: 269, column: 12, scope: !561)
!617 = !DILocation(line: 270, column: 5, scope: !561)
!618 = !DILocation(line: 271, column: 14, scope: !561)
!619 = !DILocation(line: 271, column: 12, scope: !561)
!620 = !DILocation(line: 272, column: 5, scope: !561)
!621 = !DILocation(line: 273, column: 1, scope: !561)
!622 = distinct !DISubprogram(name: "rwlock_destroy", scope: !2, file: !2, line: 275, type: !623, scopeLine: 276, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !564}
!625 = !DILocalVariable(name: "lock", arg: 1, scope: !622, file: !2, line: 275, type: !564)
!626 = !DILocation(line: 275, column: 39, scope: !622)
!627 = !DILocalVariable(name: "status", scope: !622, file: !2, line: 277, type: !149)
!628 = !DILocation(line: 277, column: 9, scope: !622)
!629 = !DILocation(line: 277, column: 41, scope: !622)
!630 = !DILocation(line: 277, column: 18, scope: !622)
!631 = !DILocation(line: 278, column: 5, scope: !622)
!632 = !DILocation(line: 279, column: 1, scope: !622)
!633 = distinct !DISubprogram(name: "rwlock_wrlock", scope: !2, file: !2, line: 281, type: !623, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !230)
!634 = !DILocalVariable(name: "lock", arg: 1, scope: !633, file: !2, line: 281, type: !564)
!635 = !DILocation(line: 281, column: 38, scope: !633)
!636 = !DILocalVariable(name: "status", scope: !633, file: !2, line: 283, type: !149)
!637 = !DILocation(line: 283, column: 9, scope: !633)
!638 = !DILocation(line: 283, column: 40, scope: !633)
