; ModuleID = 'benchmarks/miscellaneous/pthread.c'
source_filename = "benchmarks/miscellaneous/pthread.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, %union.anon }
%union.anon = type { %struct.__pthread_internal_slist }
%struct.__pthread_internal_slist = type { ptr }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.__atomic_wide_counter, %union.__atomic_wide_counter, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.__atomic_wide_counter = type { i64 }
%union.pthread_attr_t = type { i64, [32 x i8] }
%union.pthread_mutexattr_t = type { i32 }
%union.pthread_condattr_t = type { i32 }
%struct.timespec = type { i64, i64 }
%union.pthread_rwlockattr_t = type { i64 }
%union.pthread_rwlock_t = type { i64, [24 x i8] }

@__func__.thread_create = private unnamed_addr constant [14 x i8] c"thread_create\00", align 1, !dbg !0
@.str = private unnamed_addr constant [10 x i8] c"pthread.c\00", align 1, !dbg !8
@.str.1 = private unnamed_addr constant [12 x i8] c"status == 0\00", align 1, !dbg !13
@__func__.thread_join = private unnamed_addr constant [12 x i8] c"thread_join\00", align 1, !dbg !18
@__func__.mutex_init = private unnamed_addr constant [11 x i8] c"mutex_init\00", align 1, !dbg !21

!77 = !DIEnumerator(name: "PTHREAD_PRIO_NONE", value: 0)
!78 = !DIEnumerator(name: "PTHREAD_PRIO_INHERIT", value: 1)
!79 = !DIEnumerator(name: "PTHREAD_PRIO_PROTECT", value: 2)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 714, baseType: !65, size: 32, elements: !81)
!81 = !{!82, !83}
!82 = !DIEnumerator(name: "PTHREAD_PROCESS_PRIVATE", value: 0)
!83 = !DIEnumerator(name: "PTHREAD_PROCESS_SHARED", value: 1)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 667, baseType: !65, size: 32, elements: !85)
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "PTHREAD_CREATE_JOINABLE", value: 0)
!87 = !DIEnumerator(name: "PTHREAD_CREATE_DETACHED", value: 1)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !{!0, !8, !13, !18, !21, !26, !28, !30, !35, !37, !42, !47, !50, !52, !54, !59, !92, !94, !99, !101, !103, !105, !107, !109, !111, !113, !118, !121, !126, !131, !133, !138, !143, !145, !180, !214, !218}
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !49, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 144, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 18)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !20, isLocal: true, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !2, line: 278, type: !56, isLocal: true, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !3, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 297, type: !3, isLocal: true, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !3, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !20, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 372, type: !23, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !2, line: 375, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 224, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 28)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !40)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 296, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 37)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 420, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 19)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !2, line: 423, type: !15, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !2, line: 434, type: !135, isLocal: true, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 17)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 436, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 432, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 54)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !2, line: 440, type: !140, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "cond_mutex", scope: !61, file: !2, line: 191, type: !147, isLocal: false, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !64, line: 329, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 324, size: 256, elements: !149)
!149 = !{!150, !174, !178}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !148, file: !64, line: 326, baseType: !151, size: 256)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !64, line: 258, size: 256, elements: !152)
!152 = !{!153, !155, !156, !157, !158, !159}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !151, file: !64, line: 260, baseType: !154, size: 32)
!154 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !151, file: !64, line: 261, baseType: !65, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !151, file: !64, line: 262, baseType: !154, size: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !151, file: !64, line: 263, baseType: !154, size: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !151, file: !64, line: 264, baseType: !65, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !64, line: 265, baseType: !160, size: 64, offset: 192)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !64, line: 265, size: 64, elements: !161)
!161 = !{!162, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__elision_data", scope: !160, file: !64, line: 271, baseType: !163, size: 32)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !160, file: !64, line: 267, size: 32, elements: !164)
!164 = !{!165, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__espins", scope: !163, file: !64, line: 269, baseType: !166, size: 16)
!166 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__eelision", scope: !163, file: !64, line: 270, baseType: !166, size: 16, offset: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !160, file: !64, line: 272, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_slist_t", file: !64, line: 257, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_slist", file: !64, line: 254, size: 64, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !170, file: !64, line: 256, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !148, file: !64, line: 327, baseType: !175, size: 192)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 24)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !148, file: !64, line: 328, baseType: !179, size: 64)
!179 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "cond", scope: !61, file: !2, line: 192, type: !182, isLocal: false, isDefinition: true)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !64, line: 335, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 330, size: 384, elements: !184)
!184 = !{!185, !208, !212}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !183, file: !64, line: 332, baseType: !186, size: 384)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !64, line: 289, size: 384, elements: !187)
!187 = !{!188, !199, !200, !204, !205, !206, !207}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !186, file: !64, line: 291, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !64, line: 248, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 240, size: 64, elements: !191)
!191 = !{!192, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !190, file: !64, line: 242, baseType: !193, size: 64)
!193 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !190, file: !64, line: 247, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !190, file: !64, line: 243, size: 64, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !195, file: !64, line: 245, baseType: !65, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !195, file: !64, line: 246, baseType: !65, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !186, file: !64, line: 292, baseType: !189, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !186, file: !64, line: 293, baseType: !201, size: 64, offset: 128)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 64, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 2)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !186, file: !64, line: 294, baseType: !201, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !186, file: !64, line: 295, baseType: !65, size: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !186, file: !64, line: 296, baseType: !65, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !186, file: !64, line: 297, baseType: !201, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !183, file: !64, line: 333, baseType: !209, size: 384)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 384, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 48)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !183, file: !64, line: 334, baseType: !213, size: 64)
!213 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "latest_thread", scope: !61, file: !2, line: 359, type: !216, isLocal: false, isDefinition: true)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !64, line: 305, baseType: !217)
!217 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "local_data", scope: !61, file: !2, line: 360, type: !220, isLocal: false, isDefinition: true)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !64, line: 316, baseType: !65)
!221 = !{i32 7, !"Dwarf Version", i32 5}
!222 = !{i32 2, !"Debug Info Version", i32 3}
!223 = !{i32 1, !"wchar_size", i32 4}
!224 = !{i32 8, !"PIC Level", i32 2}
!225 = !{i32 7, !"PIE Level", i32 2}
!226 = !{i32 7, !"uwtable", i32 2}
!227 = !{i32 7, !"frame-pointer", i32 2}
!228 = !{!"Homebrew clang version 19.1.7"}
!229 = distinct !DISubprogram(name: "thread_create", scope: !2, file: !2, line: 12, type: !230, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!230 = !DISubroutineType(types: !231)
!231 = !{!216, !232, !90}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!90, !90}
!235 = !{}
!236 = !DILocalVariable(name: "runner", arg: 1, scope: !229, file: !2, line: 12, type: !232)
!237 = !DILocation(line: 12, column: 32, scope: !229)
!238 = !DILocalVariable(name: "data", arg: 2, scope: !229, file: !2, line: 12, type: !90)
!239 = !DILocation(line: 12, column: 54, scope: !229)
!240 = !DILocalVariable(name: "id", scope: !229, file: !2, line: 14, type: !216)
!241 = !DILocation(line: 14, column: 15, scope: !229)
!242 = !DILocalVariable(name: "attr", scope: !229, file: !2, line: 15, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !64, line: 323, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pthread_attr_t", file: !64, line: 318, size: 320, elements: !245)
!245 = !{!246, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !244, file: !64, line: 320, baseType: !247, size: 288)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 288, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 36)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !244, file: !64, line: 321, baseType: !179, size: 64)
!251 = !DILocation(line: 15, column: 20, scope: !229)
!252 = !DILocation(line: 16, column: 5, scope: !229)
!253 = !DILocalVariable(name: "status", scope: !229, file: !2, line: 17, type: !154)
!254 = !DILocation(line: 17, column: 9, scope: !229)
!255 = !DILocation(line: 17, column: 45, scope: !229)
!256 = !DILocation(line: 17, column: 53, scope: !229)
!257 = !DILocation(line: 17, column: 18, scope: !229)
!258 = !DILocation(line: 18, column: 5, scope: !229)
!259 = !DILocation(line: 19, column: 5, scope: !229)
!260 = !DILocation(line: 20, column: 12, scope: !229)
!261 = !DILocation(line: 20, column: 5, scope: !229)
!262 = distinct !DISubprogram(name: "thread_join", scope: !2, file: !2, line: 23, type: !263, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!263 = !DISubroutineType(types: !264)
!264 = !{!90, !216}
!265 = !DILocalVariable(name: "id", arg: 1, scope: !262, file: !2, line: 23, type: !216)
!266 = !DILocation(line: 23, column: 29, scope: !262)
!267 = !DILocalVariable(name: "result", scope: !262, file: !2, line: 25, type: !90)
!268 = !DILocation(line: 25, column: 11, scope: !262)
!269 = !DILocalVariable(name: "status", scope: !262, file: !2, line: 26, type: !154)
!270 = !DILocation(line: 26, column: 9, scope: !262)
!271 = !DILocation(line: 26, column: 31, scope: !262)
!272 = !DILocation(line: 26, column: 18, scope: !262)
!273 = !DILocation(line: 27, column: 5, scope: !262)
!274 = !DILocation(line: 28, column: 12, scope: !262)
!275 = !DILocation(line: 28, column: 5, scope: !262)
!276 = distinct !DISubprogram(name: "mutex_init", scope: !2, file: !2, line: 41, type: !277, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279, !154, !154, !154}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!280 = !DILocalVariable(name: "lock", arg: 1, scope: !276, file: !2, line: 41, type: !279)
!281 = !DILocation(line: 41, column: 34, scope: !276)
!282 = !DILocalVariable(name: "type", arg: 2, scope: !276, file: !2, line: 41, type: !154)
!283 = !DILocation(line: 41, column: 44, scope: !276)
!284 = !DILocalVariable(name: "protocol", arg: 3, scope: !276, file: !2, line: 41, type: !154)
!285 = !DILocation(line: 41, column: 54, scope: !276)
!286 = !DILocalVariable(name: "prioceiling", arg: 4, scope: !276, file: !2, line: 41, type: !154)
!287 = !DILocation(line: 41, column: 68, scope: !276)
!288 = !DILocalVariable(name: "status", scope: !276, file: !2, line: 43, type: !154)
!289 = !DILocation(line: 43, column: 9, scope: !276)
!290 = !DILocalVariable(name: "value", scope: !276, file: !2, line: 44, type: !154)
!291 = !DILocation(line: 44, column: 9, scope: !276)
!292 = !DILocalVariable(name: "attributes", scope: !276, file: !2, line: 45, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutexattr_t", file: !64, line: 310, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 306, size: 32, elements: !295)
!295 = !{!296, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !294, file: !64, line: 308, baseType: !297, size: 32)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 4)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !294, file: !64, line: 309, baseType: !154, size: 32)
!301 = !DILocation(line: 45, column: 25, scope: !276)
!302 = !DILocation(line: 46, column: 14, scope: !276)
!303 = !DILocation(line: 46, column: 12, scope: !276)
!304 = !DILocation(line: 47, column: 5, scope: !276)
!305 = !DILocation(line: 49, column: 53, scope: !276)
!306 = !DILocation(line: 49, column: 14, scope: !276)
!307 = !DILocation(line: 49, column: 12, scope: !276)
!308 = !DILocation(line: 50, column: 5, scope: !276)
!309 = !DILocation(line: 51, column: 14, scope: !276)
!310 = !DILocation(line: 51, column: 12, scope: !276)
!311 = !DILocation(line: 52, column: 5, scope: !276)
!312 = !DILocation(line: 54, column: 57, scope: !276)
!313 = !DILocation(line: 54, column: 14, scope: !276)
!314 = !DILocation(line: 54, column: 12, scope: !276)
!315 = !DILocation(line: 55, column: 5, scope: !276)
!316 = !DILocation(line: 56, column: 14, scope: !276)
!317 = !DILocation(line: 56, column: 12, scope: !276)
!318 = !DILocation(line: 57, column: 5, scope: !276)
!319 = !DILocation(line: 59, column: 60, scope: !276)
!320 = !DILocation(line: 59, column: 14, scope: !276)
!321 = !DILocation(line: 59, column: 12, scope: !276)
!322 = !DILocation(line: 60, column: 5, scope: !276)
!323 = !DILocation(line: 61, column: 14, scope: !276)
!324 = !DILocation(line: 61, column: 12, scope: !276)
!325 = !DILocation(line: 62, column: 5, scope: !276)
!326 = !DILocation(line: 64, column: 33, scope: !276)
!327 = !DILocation(line: 64, column: 14, scope: !276)
!328 = !DILocation(line: 64, column: 12, scope: !276)
!329 = !DILocation(line: 65, column: 5, scope: !276)
!330 = !DILocation(line: 66, column: 14, scope: !276)
!331 = !DILocation(line: 66, column: 12, scope: !276)
!332 = !DILocation(line: 67, column: 5, scope: !276)
!333 = !DILocation(line: 68, column: 1, scope: !276)
!334 = distinct !DISubprogram(name: "mutex_destroy", scope: !2, file: !2, line: 70, type: !335, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !279}
!337 = !DILocalVariable(name: "lock", arg: 1, scope: !334, file: !2, line: 70, type: !279)
!338 = !DILocation(line: 70, column: 37, scope: !334)
!339 = !DILocalVariable(name: "status", scope: !334, file: !2, line: 72, type: !154)
!340 = !DILocation(line: 72, column: 9, scope: !334)
!341 = !DILocation(line: 72, column: 40, scope: !334)
!342 = !DILocation(line: 72, column: 18, scope: !334)
!343 = !DILocation(line: 73, column: 5, scope: !334)
!344 = !DILocation(line: 74, column: 1, scope: !334)
!345 = distinct !DISubprogram(name: "mutex_lock", scope: !2, file: !2, line: 76, type: !335, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!346 = !DILocalVariable(name: "lock", arg: 1, scope: !345, file: !2, line: 76, type: !279)
!347 = !DILocation(line: 76, column: 34, scope: !345)
!348 = !DILocalVariable(name: "status", scope: !345, file: !2, line: 78, type: !154)
!349 = !DILocation(line: 78, column: 9, scope: !345)
!350 = !DILocation(line: 78, column: 37, scope: !345)
!351 = !DILocation(line: 78, column: 18, scope: !345)
!352 = !DILocation(line: 79, column: 5, scope: !345)
!353 = !DILocation(line: 80, column: 1, scope: !345)
!354 = distinct !DISubprogram(name: "mutex_trylock", scope: !2, file: !2, line: 82, type: !355, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!355 = !DISubroutineType(types: !356)
!356 = !{!357, !279}
!357 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!358 = !DILocalVariable(name: "lock", arg: 1, scope: !354, file: !2, line: 82, type: !279)
!359 = !DILocation(line: 82, column: 37, scope: !354)
!360 = !DILocalVariable(name: "status", scope: !354, file: !2, line: 84, type: !154)
!361 = !DILocation(line: 84, column: 9, scope: !354)
!362 = !DILocation(line: 84, column: 40, scope: !354)
!363 = !DILocation(line: 84, column: 18, scope: !354)
!364 = !DILocation(line: 86, column: 12, scope: !354)
!365 = !DILocation(line: 86, column: 19, scope: !354)
!366 = !DILocation(line: 86, column: 5, scope: !354)
!367 = distinct !DISubprogram(name: "mutex_unlock", scope: !2, file: !2, line: 89, type: !335, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!368 = !DILocalVariable(name: "lock", arg: 1, scope: !367, file: !2, line: 89, type: !279)
!369 = !DILocation(line: 89, column: 36, scope: !367)
!370 = !DILocalVariable(name: "status", scope: !367, file: !2, line: 91, type: !154)
!371 = !DILocation(line: 91, column: 9, scope: !367)
!372 = !DILocation(line: 91, column: 39, scope: !367)
!373 = !DILocation(line: 91, column: 18, scope: !367)
!374 = !DILocation(line: 92, column: 5, scope: !367)
!375 = !DILocation(line: 93, column: 1, scope: !367)
!376 = distinct !DISubprogram(name: "mutex_test", scope: !2, file: !2, line: 95, type: !377, scopeLine: 96, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!377 = !DISubroutineType(types: !378)
!378 = !{null}
!379 = !DILocalVariable(name: "mutex0", scope: !376, file: !2, line: 97, type: !147)
!380 = !DILocation(line: 97, column: 21, scope: !376)
!381 = !DILocalVariable(name: "mutex1", scope: !376, file: !2, line: 98, type: !147)
!382 = !DILocation(line: 98, column: 21, scope: !376)
!383 = !DILocation(line: 100, column: 5, scope: !376)
!384 = !DILocation(line: 101, column: 5, scope: !376)
!385 = !DILocation(line: 104, column: 9, scope: !386)
!386 = distinct !DILexicalBlock(scope: !376, file: !2, line: 103, column: 5)
!387 = !DILocalVariable(name: "success", scope: !386, file: !2, line: 105, type: !357)
!388 = !DILocation(line: 105, column: 14, scope: !386)
!389 = !DILocation(line: 105, column: 24, scope: !386)
!390 = !DILocation(line: 106, column: 9, scope: !386)
!391 = !DILocation(line: 107, column: 9, scope: !386)
!392 = !DILocation(line: 111, column: 9, scope: !393)
!393 = distinct !DILexicalBlock(scope: !376, file: !2, line: 110, column: 5)
!394 = !DILocalVariable(name: "success", scope: !395, file: !2, line: 114, type: !357)
!395 = distinct !DILexicalBlock(scope: !393, file: !2, line: 113, column: 9)
!396 = !DILocation(line: 114, column: 18, scope: !395)
!397 = !DILocation(line: 114, column: 28, scope: !395)
!398 = !DILocation(line: 115, column: 13, scope: !395)
!399 = !DILocation(line: 116, column: 13, scope: !395)
!400 = !DILocalVariable(name: "success", scope: !401, file: !2, line: 120, type: !357)
!401 = distinct !DILexicalBlock(scope: !393, file: !2, line: 119, column: 9)
!402 = !DILocation(line: 120, column: 18, scope: !401)
!403 = !DILocation(line: 120, column: 28, scope: !401)
!404 = !DILocation(line: 121, column: 13, scope: !401)
!405 = !DILocation(line: 122, column: 13, scope: !401)
!406 = !DILocation(line: 132, column: 9, scope: !393)
!407 = !DILocation(line: 135, column: 5, scope: !376)
!408 = !DILocation(line: 136, column: 5, scope: !376)
!409 = !DILocation(line: 137, column: 1, scope: !376)
!410 = distinct !DISubprogram(name: "cond_init", scope: !2, file: !2, line: 141, type: !411, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!414 = !DILocalVariable(name: "cond", arg: 1, scope: !410, file: !2, line: 141, type: !413)
!415 = !DILocation(line: 141, column: 32, scope: !410)
!416 = !DILocalVariable(name: "status", scope: !410, file: !2, line: 143, type: !154)
!417 = !DILocation(line: 143, column: 9, scope: !410)
!418 = !DILocalVariable(name: "attr", scope: !410, file: !2, line: 144, type: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_condattr_t", file: !64, line: 315, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 311, size: 32, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !420, file: !64, line: 313, baseType: !297, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !420, file: !64, line: 314, baseType: !154, size: 32)
!424 = !DILocation(line: 144, column: 24, scope: !410)
!425 = !DILocation(line: 146, column: 14, scope: !410)
!426 = !DILocation(line: 146, column: 12, scope: !410)
!427 = !DILocation(line: 147, column: 5, scope: !410)
!428 = !DILocation(line: 149, column: 32, scope: !410)
!429 = !DILocation(line: 149, column: 14, scope: !410)
!430 = !DILocation(line: 149, column: 12, scope: !410)
!431 = !DILocation(line: 150, column: 5, scope: !410)
!432 = !DILocation(line: 152, column: 14, scope: !410)
!433 = !DILocation(line: 152, column: 12, scope: !410)
!434 = !DILocation(line: 153, column: 5, scope: !410)
!435 = !DILocation(line: 154, column: 1, scope: !410)
!436 = distinct !DISubprogram(name: "cond_destroy", scope: !2, file: !2, line: 156, type: !411, scopeLine: 157, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!437 = !DILocalVariable(name: "cond", arg: 1, scope: !436, file: !2, line: 156, type: !413)
!438 = !DILocation(line: 156, column: 35, scope: !436)
!439 = !DILocalVariable(name: "status", scope: !436, file: !2, line: 158, type: !154)
!440 = !DILocation(line: 158, column: 9, scope: !436)
!441 = !DILocation(line: 158, column: 39, scope: !436)
!442 = !DILocation(line: 158, column: 18, scope: !436)
!443 = !DILocation(line: 159, column: 5, scope: !436)
!444 = !DILocation(line: 160, column: 1, scope: !436)
!445 = distinct !DISubprogram(name: "cond_signal", scope: !2, file: !2, line: 162, type: !411, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!446 = !DILocalVariable(name: "cond", arg: 1, scope: !445, file: !2, line: 162, type: !413)
!447 = !DILocation(line: 162, column: 34, scope: !445)
!448 = !DILocalVariable(name: "status", scope: !445, file: !2, line: 164, type: !154)
!449 = !DILocation(line: 164, column: 9, scope: !445)
!450 = !DILocation(line: 164, column: 38, scope: !445)
!451 = !DILocation(line: 164, column: 18, scope: !445)
!452 = !DILocation(line: 165, column: 5, scope: !445)
!453 = !DILocation(line: 166, column: 1, scope: !445)
!454 = distinct !DISubprogram(name: "cond_broadcast", scope: !2, file: !2, line: 168, type: !411, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!455 = !DILocalVariable(name: "cond", arg: 1, scope: !454, file: !2, line: 168, type: !413)
!456 = !DILocation(line: 168, column: 37, scope: !454)
!457 = !DILocalVariable(name: "status", scope: !454, file: !2, line: 170, type: !154)
!458 = !DILocation(line: 170, column: 9, scope: !454)
!459 = !DILocation(line: 170, column: 41, scope: !454)
!460 = !DILocation(line: 170, column: 18, scope: !454)
!461 = !DILocation(line: 171, column: 5, scope: !454)
!462 = !DILocation(line: 172, column: 1, scope: !454)
!463 = distinct !DISubprogram(name: "cond_wait", scope: !2, file: !2, line: 174, type: !464, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !413, !279}
!466 = !DILocalVariable(name: "cond", arg: 1, scope: !463, file: !2, line: 174, type: !413)
!467 = !DILocation(line: 174, column: 32, scope: !463)
!468 = !DILocalVariable(name: "lock", arg: 2, scope: !463, file: !2, line: 174, type: !279)
!469 = !DILocation(line: 174, column: 55, scope: !463)
!470 = !DILocalVariable(name: "status", scope: !463, file: !2, line: 176, type: !154)
!471 = !DILocation(line: 176, column: 9, scope: !463)
!472 = !DILocation(line: 176, column: 36, scope: !463)
!473 = !DILocation(line: 176, column: 42, scope: !463)
!474 = !DILocation(line: 176, column: 18, scope: !463)
!475 = !DILocation(line: 178, column: 1, scope: !463)
!476 = distinct !DISubprogram(name: "cond_timedwait", scope: !2, file: !2, line: 180, type: !477, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !413, !279, !213}
!479 = !DILocalVariable(name: "cond", arg: 1, scope: !476, file: !2, line: 180, type: !413)
!480 = !DILocation(line: 180, column: 37, scope: !476)
!481 = !DILocalVariable(name: "lock", arg: 2, scope: !476, file: !2, line: 180, type: !279)
!482 = !DILocation(line: 180, column: 60, scope: !476)
!483 = !DILocalVariable(name: "millis", arg: 3, scope: !476, file: !2, line: 180, type: !213)
!484 = !DILocation(line: 180, column: 76, scope: !476)
!485 = !DILocalVariable(name: "ts", scope: !476, file: !2, line: 183, type: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !64, line: 212, size: 128, elements: !487)
!487 = !{!488, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !486, file: !64, line: 214, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !64, line: 108, baseType: !179)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !486, file: !64, line: 215, baseType: !491, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !64, line: 125, baseType: !179)
!492 = !DILocation(line: 183, column: 21, scope: !476)
!493 = !DILocation(line: 187, column: 11, scope: !476)
!494 = !DILocalVariable(name: "status", scope: !476, file: !2, line: 188, type: !154)
!495 = !DILocation(line: 188, column: 9, scope: !476)
!496 = !DILocation(line: 188, column: 41, scope: !476)
!497 = !DILocation(line: 188, column: 47, scope: !476)
!498 = !DILocation(line: 188, column: 18, scope: !476)
!499 = !DILocation(line: 189, column: 1, scope: !476)
!500 = distinct !DISubprogram(name: "cond_worker", scope: !2, file: !2, line: 195, type: !233, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!501 = !DILocalVariable(name: "message", arg: 1, scope: !500, file: !2, line: 195, type: !90)
!502 = !DILocation(line: 195, column: 25, scope: !500)
!503 = !DILocalVariable(name: "idle", scope: !500, file: !2, line: 197, type: !357)
!504 = !DILocation(line: 197, column: 10, scope: !500)
!505 = !DILocation(line: 199, column: 9, scope: !506)
!506 = distinct !DILexicalBlock(scope: !500, file: !2, line: 198, column: 5)
!507 = !DILocation(line: 200, column: 9, scope: !506)
!508 = !DILocation(line: 201, column: 9, scope: !506)
!509 = !DILocation(line: 202, column: 9, scope: !506)
!510 = !DILocation(line: 203, column: 16, scope: !506)
!511 = !DILocation(line: 203, column: 22, scope: !506)
!512 = !DILocation(line: 203, column: 14, scope: !506)
!513 = !DILocation(line: 204, column: 9, scope: !506)
!514 = !DILocation(line: 206, column: 9, scope: !515)
!515 = distinct !DILexicalBlock(scope: !500, file: !2, line: 206, column: 9)
!516 = !DILocation(line: 206, column: 9, scope: !500)
!517 = !DILocation(line: 207, column: 25, scope: !515)
!518 = !DILocation(line: 207, column: 34, scope: !515)
!519 = !DILocation(line: 207, column: 9, scope: !515)
!520 = !DILocation(line: 208, column: 10, scope: !500)
!521 = !DILocation(line: 210, column: 9, scope: !522)
!522 = distinct !DILexicalBlock(scope: !500, file: !2, line: 209, column: 5)
!523 = !DILocation(line: 211, column: 9, scope: !522)
!524 = !DILocation(line: 212, column: 9, scope: !522)
!525 = !DILocation(line: 213, column: 9, scope: !522)
!526 = !DILocation(line: 214, column: 16, scope: !522)
!527 = !DILocation(line: 214, column: 22, scope: !522)
!528 = !DILocation(line: 214, column: 14, scope: !522)
!529 = !DILocation(line: 215, column: 9, scope: !522)
!530 = !DILocation(line: 217, column: 9, scope: !531)
!531 = distinct !DILexicalBlock(scope: !500, file: !2, line: 217, column: 9)
!532 = !DILocation(line: 217, column: 9, scope: !500)
!533 = !DILocation(line: 218, column: 25, scope: !531)
!534 = !DILocation(line: 218, column: 34, scope: !531)
!535 = !DILocation(line: 218, column: 9, scope: !531)
!536 = !DILocation(line: 219, column: 12, scope: !500)
!537 = !DILocation(line: 219, column: 5, scope: !500)
!538 = !DILocation(line: 220, column: 1, scope: !500)
!539 = distinct !DISubprogram(name: "cond_test", scope: !2, file: !2, line: 222, type: !377, scopeLine: 223, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!540 = !DILocalVariable(name: "message", scope: !539, file: !2, line: 224, type: !90)
!541 = !DILocation(line: 224, column: 11, scope: !539)
!542 = !DILocation(line: 225, column: 5, scope: !539)
!543 = !DILocation(line: 226, column: 5, scope: !539)
!544 = !DILocalVariable(name: "worker", scope: !539, file: !2, line: 228, type: !216)
!545 = !DILocation(line: 228, column: 15, scope: !539)
!546 = !DILocation(line: 228, column: 51, scope: !539)
!547 = !DILocation(line: 228, column: 24, scope: !539)
!548 = !DILocation(line: 231, column: 9, scope: !549)
!549 = distinct !DILexicalBlock(scope: !539, file: !2, line: 230, column: 5)
!550 = !DILocation(line: 232, column: 9, scope: !549)
!551 = !DILocation(line: 233, column: 9, scope: !549)
!552 = !DILocation(line: 234, column: 9, scope: !549)
!553 = !DILocation(line: 238, column: 9, scope: !554)
!554 = distinct !DILexicalBlock(scope: !539, file: !2, line: 237, column: 5)
!555 = !DILocation(line: 239, column: 9, scope: !554)
!556 = !DILocation(line: 240, column: 9, scope: !554)
!557 = !DILocation(line: 241, column: 9, scope: !554)
!558 = !DILocalVariable(name: "result", scope: !539, file: !2, line: 244, type: !90)
!559 = !DILocation(line: 244, column: 11, scope: !539)
!560 = !DILocation(line: 244, column: 32, scope: !539)
!561 = !DILocation(line: 244, column: 20, scope: !539)
!562 = !DILocation(line: 245, column: 5, scope: !539)
!563 = !DILocation(line: 247, column: 5, scope: !539)
!564 = !DILocation(line: 248, column: 5, scope: !539)
!565 = !DILocation(line: 249, column: 1, scope: !539)
!566 = distinct !DISubprogram(name: "rwlock_init", scope: !2, file: !2, line: 256, type: !567, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !569, !154}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !64, line: 341, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 336, size: 256, elements: !572)
!572 = !{!573, !589, !593}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !571, file: !64, line: 338, baseType: !574, size: 256)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_rwlock_arch_t", file: !64, line: 275, size: 256, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !584, !585, !587, !588}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__readers", scope: !574, file: !64, line: 277, baseType: !65, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__writers", scope: !574, file: !64, line: 278, baseType: !65, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__wrphase_futex", scope: !574, file: !64, line: 279, baseType: !65, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__writers_futex", scope: !574, file: !64, line: 280, baseType: !65, size: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !574, file: !64, line: 281, baseType: !65, size: 32, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !574, file: !64, line: 282, baseType: !65, size: 32, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !574, file: !64, line: 283, baseType: !583, size: 8, offset: 192)
!583 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !574, file: !64, line: 284, baseType: !583, size: 8, offset: 200)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !574, file: !64, line: 285, baseType: !586, size: 8, offset: 208)
!586 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !574, file: !64, line: 286, baseType: !583, size: 8, offset: 216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__cur_writer", scope: !574, file: !64, line: 287, baseType: !154, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !571, file: !64, line: 339, baseType: !590, size: 256)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 256, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !571, file: !64, line: 340, baseType: !179, size: 64)
!594 = !DILocalVariable(name: "lock", arg: 1, scope: !566, file: !2, line: 256, type: !569)
!595 = !DILocation(line: 256, column: 36, scope: !566)
!596 = !DILocalVariable(name: "shared", arg: 2, scope: !566, file: !2, line: 256, type: !154)
!597 = !DILocation(line: 256, column: 46, scope: !566)
!598 = !DILocalVariable(name: "status", scope: !566, file: !2, line: 258, type: !154)
!599 = !DILocation(line: 258, column: 9, scope: !566)
!600 = !DILocalVariable(name: "value", scope: !566, file: !2, line: 259, type: !154)
!601 = !DILocation(line: 259, column: 9, scope: !566)
!602 = !DILocalVariable(name: "attributes", scope: !566, file: !2, line: 260, type: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlockattr_t", file: !64, line: 346, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 342, size: 64, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !604, file: !64, line: 344, baseType: !44, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !604, file: !64, line: 345, baseType: !179, size: 64)
!608 = !DILocation(line: 260, column: 26, scope: !566)
!609 = !DILocation(line: 261, column: 14, scope: !566)
!610 = !DILocation(line: 261, column: 12, scope: !566)
!611 = !DILocation(line: 262, column: 5, scope: !566)
!612 = !DILocation(line: 264, column: 57, scope: !566)
!613 = !DILocation(line: 264, column: 14, scope: !566)
!614 = !DILocation(line: 264, column: 12, scope: !566)
!615 = !DILocation(line: 265, column: 5, scope: !566)
!616 = !DILocation(line: 266, column: 14, scope: !566)
!617 = !DILocation(line: 266, column: 12, scope: !566)
!618 = !DILocation(line: 267, column: 5, scope: !566)
!619 = !DILocation(line: 269, column: 34, scope: !566)
!620 = !DILocation(line: 269, column: 14, scope: !566)
!621 = !DILocation(line: 269, column: 12, scope: !566)
!622 = !DILocation(line: 270, column: 5, scope: !566)
!623 = !DILocation(line: 271, column: 14, scope: !566)
!624 = !DILocation(line: 271, column: 12, scope: !566)
!625 = !DILocation(line: 272, column: 5, scope: !566)
!626 = !DILocation(line: 273, column: 1, scope: !566)
!627 = distinct !DISubprogram(name: "rwlock_destroy", scope: !2, file: !2, line: 275, type: !628, scopeLine: 276, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !569}
!630 = !DILocalVariable(name: "lock", arg: 1, scope: !627, file: !2, line: 275, type: !569)
!631 = !DILocation(line: 275, column: 39, scope: !627)
!632 = !DILocalVariable(name: "status", scope: !627, file: !2, line: 277, type: !154)
!633 = !DILocation(line: 277, column: 9, scope: !627)
!634 = !DILocation(line: 277, column: 41, scope: !627)
!635 = !DILocation(line: 277, column: 18, scope: !627)
!636 = !DILocation(line: 278, column: 5, scope: !627)
!637 = !DILocation(line: 279, column: 1, scope: !627)
!638 = distinct !DISubprogram(name: "rwlock_wrlock", scope: !2, file: !2, line: 281, type: !628, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !235)
!639 = !DILocalVariable(name: "lock", arg: 1, scope: !638, file: !2, line: 281, type: !569)
!640 = !DILocation(line: 281, column: 38, scope: !638)
!641 = !DILocalVariable(name: "status", scope: !638, file: !2, line: 283, type: !154)
!642 = !DILocation(line: 283, column: 9, scope: !638)
!643 = !DILocation(line: 283, column: 40, scope: !638)
