; ModuleID = '/home/drc/git/Dat3M/output/bounded_mpmc_check_empty.ll'
source_filename = "/home/drc/git/libvsync/test/queue/bounded_mpmc_check_empty.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.bounded_mpmc_s = type { %struct.vatomic32_s, %struct.vatomic32_s, %struct.vatomic32_s, %struct.vatomic32_s, i8**, i32 }
%struct.vatomic32_s = type { i32 }
%struct.xbo_s = type { i32, i32, i32, i32 }
%union.pthread_attr_t = type { i64, [48 x i8] }

@g_val = dso_local global [4 x i64] zeroinitializer, align 16, !dbg !0
@g_queue = dso_local global %struct.bounded_mpmc_s zeroinitializer, align 8, !dbg !36
@g_cs_x = dso_local global %struct.vatomic32_s zeroinitializer, align 4, !dbg !57
@.str = private unnamed_addr constant [14 x i8] c"idx < (2 * 2)\00", align 1
@.str.1 = private unnamed_addr constant [61 x i8] c"/home/drc/git/libvsync/test/queue/bounded_mpmc_check_empty.c\00", align 1
@__PRETTY_FUNCTION__.reader = private unnamed_addr constant [21 x i8] c"void *reader(void *)\00", align 1
@g_ret = dso_local global [4 x i64] zeroinitializer, align 16, !dbg !54
@.str.2 = private unnamed_addr constant [16 x i8] c"g_ret[idx] != 0\00", align 1
@g_buf = dso_local global [4 x i8*] zeroinitializer, align 16, !dbg !30
@.str.3 = private unnamed_addr constant [17 x i8] c"found == (2 * 2)\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_val", scope: !2, file: !32, line: 49, type: !56, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !29, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/drc/git/libvsync/test/queue/bounded_mpmc_check_empty.c", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "ed4542782c13f0479c0d03705375d1ad")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 8, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/vsync/queue/internal/bounded_ret.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "c46e1376bff92f38e6ff9a1c56080188")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "QUEUE_BOUNDED_OK", value: 0)
!10 = !DIEnumerator(name: "QUEUE_BOUNDED_FULL", value: 1)
!11 = !DIEnumerator(name: "QUEUE_BOUNDED_EMPTY", value: 2)
!12 = !DIEnumerator(name: "QUEUE_BOUNDED_AGAIN", value: 3)
!13 = !{!14, !19, !20, !24}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuintptr_t", file: !15, line: 36, baseType: !16)
!15 = !DIFile(filename: "./include/vsync/vtypes.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "6ac6784bf37e03e28013e7eed706797e")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !17, line: 90, baseType: !18)
!17 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!18 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "vsize_t", file: !15, line: 42, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !23, line: 46, baseType: !18)
!23 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuint32_t", file: !15, line: 34, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !26, line: 26, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !28, line: 42, baseType: !7)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!29 = !{!30, !36, !0, !54, !57}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "g_buf", scope: !2, file: !32, line: 46, type: !33, isLocal: false, isDefinition: true)
!32 = !DIFile(filename: "test/queue/bounded_mpmc_check_empty.c", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "ed4542782c13f0479c0d03705375d1ad")
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 256, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 4)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "g_queue", scope: !2, file: !32, line: 47, type: !38, isLocal: false, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "bounded_mpmc_t", file: !39, line: 39, baseType: !40)
!39 = !DIFile(filename: "./include/vsync/queue/bounded_mpmc.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "ae97e0b4a2e991e85ba75388249cbc94")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bounded_mpmc_s", file: !39, line: 30, size: 256, elements: !41)
!41 = !{!42, !48, !49, !50, !51, !53}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "phead", scope: !40, file: !39, line: 31, baseType: !43, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "vatomic32_t", file: !44, line: 62, baseType: !45)
!44 = !DIFile(filename: "./include/vsync/atomic/core.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "1cc0657a82f0605ef67642f178a77e1c")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vatomic32_s", file: !44, line: 60, size: 32, align: 32, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_v", scope: !45, file: !44, line: 61, baseType: !24, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptail", scope: !40, file: !39, line: 32, baseType: !43, size: 32, align: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "chead", scope: !40, file: !39, line: 34, baseType: !43, size: 32, align: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ctail", scope: !40, file: !39, line: 35, baseType: !43, size: 32, align: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !40, file: !39, line: 37, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !40, file: !39, line: 38, baseType: !24, size: 32, offset: 192)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "g_ret", scope: !2, file: !32, line: 50, type: !56, isLocal: false, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !34)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "g_cs_x", scope: !2, file: !32, line: 51, type: !43, isLocal: false, isDefinition: true)
!59 = !{i32 7, !"Dwarf Version", i32 5}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 4}
!62 = !{i32 7, !"PIC Level", i32 2}
!63 = !{i32 7, !"PIE Level", i32 2}
!64 = !{i32 7, !"uwtable", i32 1}
!65 = !{i32 7, !"frame-pointer", i32 2}
!66 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!67 = distinct !DISubprogram(name: "sched_yield", scope: !32, file: !32, line: 23, type: !68, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !71)
!68 = !DISubroutineType(types: !69)
!69 = !{!70}
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !{}
!72 = !DILocation(line: 25, column: 2, scope: !67)
!73 = distinct !DISubprogram(name: "writer", scope: !32, file: !32, line: 54, type: !74, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !71)
!74 = !DISubroutineType(types: !75)
!75 = !{!19, !19}
!76 = !DILocalVariable(name: "arg", arg: 1, scope: !73, file: !32, line: 54, type: !19)
!77 = !DILocation(line: 0, scope: !73)
!78 = !DILocation(line: 56, column: 19, scope: !73)
!79 = !DILocalVariable(name: "tid", scope: !73, file: !32, line: 56, type: !14)
!80 = !DILocalVariable(name: "xbo", scope: !73, file: !32, line: 58, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "xbo_t", file: !82, line: 48, baseType: !83)
!82 = !DIFile(filename: "./include/vsync/utils/xbo.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "f587429cfeb993858d7ede0d279131f0")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xbo_s", file: !82, line: 44, size: 128, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !83, file: !82, line: 45, baseType: !24, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !83, file: !82, line: 45, baseType: !24, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !83, file: !82, line: 46, baseType: !24, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !83, file: !82, line: 47, baseType: !24, size: 32, offset: 96)
!89 = !DILocation(line: 58, column: 8, scope: !73)
!90 = !DILocation(line: 59, column: 2, scope: !73)
!91 = !DILocalVariable(name: "i", scope: !92, file: !32, line: 61, type: !21)
!92 = distinct !DILexicalBlock(scope: !73, file: !32, line: 61, column: 2)
!93 = !DILocation(line: 0, scope: !92)
!94 = !DILocation(line: 62, column: 21, scope: !95)
!95 = distinct !DILexicalBlock(scope: !96, file: !32, line: 61, column: 39)
!96 = distinct !DILexicalBlock(scope: !92, file: !32, line: 61, column: 2)
!97 = !DILocalVariable(name: "idx", scope: !95, file: !32, line: 62, type: !21)
!98 = !DILocation(line: 0, scope: !95)
!99 = !DILocation(line: 63, column: 20, scope: !95)
!100 = !DILocation(line: 63, column: 37, scope: !95)
!101 = !DILocation(line: 63, column: 3, scope: !95)
!102 = !DILocation(line: 63, column: 14, scope: !95)
!103 = !DILocation(line: 64, column: 3, scope: !95)
!104 = !DILocation(line: 64, column: 37, scope: !95)
!105 = !DILocation(line: 64, column: 10, scope: !95)
!106 = !DILocation(line: 64, column: 50, scope: !95)
!107 = !DILocation(line: 66, column: 4, scope: !108)
!108 = distinct !DILexicalBlock(scope: !95, file: !32, line: 64, column: 71)
!109 = distinct !{!109, !103, !110, !111}
!110 = !DILocation(line: 67, column: 3, scope: !95)
!111 = !{!"llvm.loop.mustprogress"}
!112 = !DILocation(line: 68, column: 3, scope: !95)
!113 = !DILocation(line: 62, column: 30, scope: !95)
!114 = !DILocation(line: 70, column: 2, scope: !73)
!115 = distinct !DISubprogram(name: "xbo_init", scope: !82, file: !82, line: 64, type: !116, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !118, !24, !24, !24}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!119 = !DILocalVariable(name: "xbo", arg: 1, scope: !115, file: !82, line: 64, type: !118)
!120 = !DILocation(line: 0, scope: !115)
!121 = !DILocalVariable(name: "min", arg: 2, scope: !115, file: !82, line: 64, type: !24)
!122 = !DILocalVariable(name: "max", arg: 3, scope: !115, file: !82, line: 64, type: !24)
!123 = !DILocalVariable(name: "factor", arg: 4, scope: !115, file: !82, line: 64, type: !24)
!124 = !DILocation(line: 71, column: 1, scope: !115)
!125 = distinct !DISubprogram(name: "bounded_mpmc_enq", scope: !39, file: !39, line: 73, type: !126, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !129, !19}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "bounded_ret_t", file: !6, line: 13, baseType: !5)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!130 = !DILocalVariable(name: "q", arg: 1, scope: !125, file: !39, line: 73, type: !129)
!131 = !DILocation(line: 0, scope: !125)
!132 = !DILocalVariable(name: "v", arg: 2, scope: !125, file: !39, line: 73, type: !19)
!133 = !DILocation(line: 78, column: 32, scope: !125)
!134 = !DILocation(line: 78, column: 9, scope: !125)
!135 = !DILocalVariable(name: "curr", scope: !125, file: !39, line: 75, type: !24)
!136 = !DILocation(line: 79, column: 36, scope: !137)
!137 = distinct !DILexicalBlock(scope: !125, file: !39, line: 79, column: 6)
!138 = !DILocation(line: 79, column: 13, scope: !137)
!139 = !DILocation(line: 79, column: 11, scope: !137)
!140 = !DILocation(line: 79, column: 49, scope: !137)
!141 = !DILocation(line: 79, column: 43, scope: !137)
!142 = !DILocation(line: 79, column: 6, scope: !125)
!143 = !DILocation(line: 82, column: 14, scope: !125)
!144 = !DILocalVariable(name: "next", scope: !125, file: !39, line: 75, type: !24)
!145 = !DILocation(line: 83, column: 6, scope: !146)
!146 = distinct !DILexicalBlock(scope: !125, file: !39, line: 83, column: 6)
!147 = !DILocation(line: 83, column: 51, scope: !146)
