; ModuleID = '/home/drc/git/Dat3M/output/bounded_mpmc_check_full.ll'
source_filename = "/home/drc/git/libvsync/test/queue/bounded_mpmc_check_full.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.bounded_mpmc_s = type { %struct.vatomic32_s, %struct.vatomic32_s, %struct.vatomic32_s, %struct.vatomic32_s, i8**, i32 }
%struct.vatomic32_s = type { i32 }
%struct.xbo_s = type { i32, i32, i32, i32 }
%struct.run_info_t = type { i64, i64, i8, i8* (i8*)* }
%union.pthread_attr_t = type { i64, [48 x i8] }

@g_val = dso_local global [4 x i64] zeroinitializer, align 16, !dbg !0
@g_queue = dso_local global %struct.bounded_mpmc_s zeroinitializer, align 8, !dbg !53
@g_buf = dso_local global [4 x i8*] zeroinitializer, align 16, !dbg !47
@.str = private unnamed_addr constant [24 x i8] c"ret == QUEUE_BOUNDED_OK\00", align 1
@.str.1 = private unnamed_addr constant [60 x i8] c"/home/drc/git/libvsync/test/queue/bounded_mpmc_check_full.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1
@.str.2 = private unnamed_addr constant [22 x i8] c"(dequeued % 10U) == 1\00", align 1
@.str.3 = private unnamed_addr constant [26 x i8] c"dequeued <= (2 * 10U + 1)\00", align 1
@.str.4 = private unnamed_addr constant [26 x i8] c"ret == QUEUE_BOUNDED_FULL\00", align 1
@.str.5 = private unnamed_addr constant [15 x i8] c"buffer is NULL\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_val", scope: !2, file: !49, line: 40, type: !71, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !46, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/drc/git/libvsync/test/queue/bounded_mpmc_check_full.c", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "3d7240dfa1c4978843ec3696fbbd43c8")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 8, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/vsync/queue/internal/bounded_ret.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "c46e1376bff92f38e6ff9a1c56080188")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "QUEUE_BOUNDED_OK", value: 0)
!10 = !DIEnumerator(name: "QUEUE_BOUNDED_FULL", value: 1)
!11 = !DIEnumerator(name: "QUEUE_BOUNDED_EMPTY", value: 2)
!12 = !DIEnumerator(name: "QUEUE_BOUNDED_AGAIN", value: 3)
!13 = !{!14, !19, !22, !23, !24, !29}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "vsize_t", file: !15, line: 42, baseType: !16)
!15 = !DIFile(filename: "./include/vsync/vtypes.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "6ac6784bf37e03e28013e7eed706797e")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 46, baseType: !18)
!17 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!18 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuintptr_t", file: !15, line: 36, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !21, line: 90, baseType: !18)
!21 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuint32_t", file: !15, line: 34, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !26, line: 26, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !28, line: 42, baseType: !7)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "run_info_t", file: !31, line: 42, baseType: !32)
!31 = !DIFile(filename: "./include/test/thread_launcher.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "30ea34619353fe641f60bde6259a2c36")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 37, size: 256, elements: !33)
!33 = !{!34, !37, !38, !41}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !32, file: !31, line: 38, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !36, line: 27, baseType: !18)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !32, file: !31, line: 39, baseType: !14, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "assign_me_to_core", scope: !32, file: !31, line: 40, baseType: !39, size: 8, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "vbool_t", file: !15, line: 43, baseType: !40)
!40 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "run_fun", scope: !32, file: !31, line: 41, baseType: !42, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_fun_t", file: !31, line: 34, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!22, !22}
!46 = !{!47, !53, !0}
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "g_buf", scope: !2, file: !49, line: 38, type: !50, isLocal: false, isDefinition: true)
!49 = !DIFile(filename: "test/queue/bounded_mpmc_check_full.c", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "3d7240dfa1c4978843ec3696fbbd43c8")
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 256, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 4)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "g_queue", scope: !2, file: !49, line: 39, type: !55, isLocal: false, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "bounded_mpmc_t", file: !56, line: 39, baseType: !57)
!56 = !DIFile(filename: "./include/vsync/queue/bounded_mpmc.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "ae97e0b4a2e991e85ba75388249cbc94")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bounded_mpmc_s", file: !56, line: 30, size: 256, elements: !58)
!58 = !{!59, !65, !66, !67, !68, !70}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "phead", scope: !57, file: !56, line: 31, baseType: !60, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "vatomic32_t", file: !61, line: 62, baseType: !62)
!61 = !DIFile(filename: "./include/vsync/atomic/core.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "1cc0657a82f0605ef67642f178a77e1c")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vatomic32_s", file: !61, line: 60, size: 32, align: 32, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_v", scope: !62, file: !61, line: 61, baseType: !24, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ptail", scope: !57, file: !56, line: 32, baseType: !60, size: 32, align: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "chead", scope: !57, file: !56, line: 34, baseType: !60, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ctail", scope: !57, file: !56, line: 35, baseType: !60, size: 32, align: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !57, file: !56, line: 37, baseType: !69, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !57, file: !56, line: 38, baseType: !24, size: 32, offset: 192)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !51)
!72 = !{i32 7, !"Dwarf Version", i32 5}
!73 = !{i32 2, !"Debug Info Version", i32 3}
!74 = !{i32 1, !"wchar_size", i32 4}
!75 = !{i32 7, !"PIC Level", i32 2}
!76 = !{i32 7, !"PIE Level", i32 2}
!77 = !{i32 7, !"uwtable", i32 1}
!78 = !{i32 7, !"frame-pointer", i32 2}
!79 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!80 = distinct !DISubprogram(name: "sched_yield", scope: !49, file: !49, line: 22, type: !81, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !84)
!81 = !DISubroutineType(types: !82)
!82 = !{!83}
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !{}
!85 = !DILocation(line: 24, column: 2, scope: !80)
!86 = distinct !DISubprogram(name: "writer", scope: !49, file: !49, line: 43, type: !44, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !84)
!87 = !DILocalVariable(name: "arg", arg: 1, scope: !86, file: !49, line: 43, type: !22)
!88 = !DILocation(line: 0, scope: !86)
!89 = !DILocation(line: 45, column: 25, scope: !86)
!90 = !DILocalVariable(name: "tid", scope: !86, file: !49, line: 45, type: !14)
!91 = !DILocalVariable(name: "xbo", scope: !86, file: !49, line: 47, type: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "xbo_t", file: !93, line: 48, baseType: !94)
!93 = !DIFile(filename: "./include/vsync/utils/xbo.h", directory: "/home/drc/git/libvsync", checksumkind: CSK_MD5, checksum: "f587429cfeb993858d7ede0d279131f0")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xbo_s", file: !93, line: 44, size: 128, elements: !95)
!95 = !{!96, !97, !98, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !94, file: !93, line: 45, baseType: !24, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !94, file: !93, line: 45, baseType: !24, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !94, file: !93, line: 46, baseType: !24, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !94, file: !93, line: 47, baseType: !24, size: 32, offset: 96)
!100 = !DILocation(line: 47, column: 8, scope: !86)
!101 = !DILocation(line: 48, column: 2, scope: !86)
!102 = !DILocalVariable(name: "i", scope: !103, file: !49, line: 50, type: !14)
!103 = distinct !DILexicalBlock(scope: !86, file: !49, line: 50, column: 2)
!104 = !DILocation(line: 0, scope: !103)
!105 = !DILocation(line: 51, column: 21, scope: !106)
!106 = distinct !DILexicalBlock(scope: !107, file: !49, line: 50, column: 39)
!107 = distinct !DILexicalBlock(scope: !103, file: !49, line: 50, column: 2)
!108 = !DILocalVariable(name: "idx", scope: !106, file: !49, line: 51, type: !14)
!109 = !DILocation(line: 0, scope: !106)
!110 = !DILocation(line: 52, column: 20, scope: !106)
!111 = !DILocation(line: 52, column: 51, scope: !106)
!112 = !DILocation(line: 52, column: 3, scope: !106)
!113 = !DILocation(line: 52, column: 14, scope: !106)
!114 = !DILocation(line: 53, column: 3, scope: !106)
!115 = !DILocation(line: 53, column: 37, scope: !106)
!116 = !DILocation(line: 53, column: 10, scope: !106)
!117 = !DILocation(line: 53, column: 50, scope: !106)
!118 = !DILocation(line: 54, column: 4, scope: !119)
!119 = distinct !DILexicalBlock(scope: !106, file: !49, line: 53, column: 71)
!120 = distinct !{!120, !114, !121, !122}
!121 = !DILocation(line: 55, column: 3, scope: !106)
!122 = !{!"llvm.loop.mustprogress"}
!123 = !DILocation(line: 56, column: 3, scope: !106)
!124 = !DILocation(line: 51, column: 30, scope: !106)
!125 = !DILocation(line: 58, column: 2, scope: !86)
!126 = distinct !DISubprogram(name: "xbo_init", scope: !93, file: !93, line: 64, type: !127, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !84)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !129, !24, !24, !24}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!130 = !DILocalVariable(name: "xbo", arg: 1, scope: !126, file: !93, line: 64, type: !129)
!131 = !DILocation(line: 0, scope: !126)
!132 = !DILocalVariable(name: "min", arg: 2, scope: !126, file: !93, line: 64, type: !24)
!133 = !DILocalVariable(name: "max", arg: 3, scope: !126, file: !93, line: 64, type: !24)
!134 = !DILocalVariable(name: "factor", arg: 4, scope: !126, file: !93, line: 64, type: !24)
!135 = !DILocation(line: 71, column: 1, scope: !126)
!136 = distinct !DISubprogram(name: "bounded_mpmc_enq", scope: !56, file: !56, line: 73, type: !137, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !84)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !140, !22}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "bounded_ret_t", file: !6, line: 13, baseType: !5)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!141 = !DILocalVariable(name: "q", arg: 1, scope: !136, file: !56, line: 73, type: !140)
!142 = !DILocation(line: 0, scope: !136)
!143 = !DILocalVariable(name: "v", arg: 2, scope: !136, file: !56, line: 73, type: !22)
!144 = !DILocation(line: 78, column: 32, scope: !136)
!145 = !DILocation(line: 78, column: 9, scope: !136)
!146 = !DILocalVariable(name: "curr", scope: !136, file: !56, line: 75, type: !24)
!147 = !DILocation(line: 79, column: 36, scope: !148)
!148 = distinct !DILexicalBlock(scope: !136, file: !56, line: 79, column: 6)
!149 = !DILocation(line: 79, column: 13, scope: !148)
!150 = !DILocation(line: 79, column: 11, scope: !148)
!151 = !DILocation(line: 79, column: 49, scope: !148)
!152 = !DILocation(line: 79, column: 43, scope: !148)
!153 = !DILocation(line: 79, column: 6, scope: !136)
!154 = !DILocation(line: 82, column: 14, scope: !136)
!155 = !DILocalVariable(name: "next", scope: !136, file: !56, line: 75, type: !24)
!156 = !DILocation(line: 83, column: 6, scope: !157)
!157 = distinct !DILexicalBlock(scope: !136, file: !56, line: 83, column: 6)
!158 = !DILocation(line: 83, column: 51, scope: !157)
