; ModuleID = '/home/ponce/git/Dat3M/output/qrcu-2.ll'
source_filename = "/home/ponce/git/Dat3M/../sv-benchmarks/c/pthread-atomic/qrcu-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_mutexattr_t = type { i32 }
%union.pthread_attr_t = type { i64, [48 x i8] }

@.str = private unnamed_addr constant [2 x i8] c"0\00", align 1
@.str.1 = private unnamed_addr constant [65 x i8] c"/home/ponce/git/Dat3M/../sv-benchmarks/c/pthread-atomic/qrcu-2.c\00", align 1
@__PRETTY_FUNCTION__.reach_error = private unnamed_addr constant [19 x i8] c"void reach_error()\00", align 1
@idx = dso_local global i32 0, align 4, !dbg !0
@ctr1 = dso_local global i32 1, align 4, !dbg !5
@ctr2 = dso_local global i32 0, align 4, !dbg !9
@readerprogress1 = dso_local global i32 0, align 4, !dbg !11
@readerprogress2 = dso_local global i32 0, align 4, !dbg !13
@mutex = dso_local global %union.pthread_mutex_t zeroinitializer, align 8, !dbg !15

; Function Attrs: noinline nounwind uwtable
define dso_local void @assume_abort_if_not(i32 noundef %0) #0 !dbg !57 {

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "idx", scope: !2, file: !7, line: 22, type: !8, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/ponce/git/Dat3M/../sv-benchmarks/c/pthread-atomic/qrcu-2.c", directory: "/home/ponce/git/Dat3M", checksumkind: CSK_MD5, checksum: "70ab70a8007f12717f2d9b2b1c3c8095")
!4 = !{!0, !5, !9, !11, !13, !15}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "ctr1", scope: !2, file: !7, line: 25, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "../sv-benchmarks/c/pthread-atomic/qrcu-2.c", directory: "/home/ponce/git/Dat3M", checksumkind: CSK_MD5, checksum: "70ab70a8007f12717f2d9b2b1c3c8095")
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "ctr2", scope: !2, file: !7, line: 25, type: !8, isLocal: false, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "readerprogress1", scope: !2, file: !7, line: 26, type: !8, isLocal: false, isDefinition: true)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "readerprogress2", scope: !2, file: !7, line: 26, type: !8, isLocal: false, isDefinition: true)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "mutex", scope: !2, file: !7, line: 30, type: !17, isLocal: false, isDefinition: true)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !18, line: 72, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "2d764266ce95ab26d4a4767c2ec78176")
!19 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !18, line: 67, size: 320, elements: !20)
!20 = !{!21, !42, !47}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !19, file: !18, line: 69, baseType: !22, size: 320)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !23, line: 22, size: 320, elements: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "3a896f588055d599ccb9e3fe6eaee3e3")
!24 = !{!25, !26, !28, !29, !30, !31, !33, !34}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !22, file: !23, line: 24, baseType: !8, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !22, file: !23, line: 25, baseType: !27, size: 32, offset: 32)
!27 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !22, file: !23, line: 26, baseType: !8, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !22, file: !23, line: 28, baseType: !27, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !22, file: !23, line: 32, baseType: !8, size: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !22, file: !23, line: 34, baseType: !32, size: 16, offset: 160)
!32 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !22, file: !23, line: 35, baseType: !32, size: 16, offset: 176)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !22, file: !23, line: 36, baseType: !35, size: 128, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !36, line: 53, baseType: !37)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "4b8899127613e00869e96fcefd314d61")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !36, line: 49, size: 128, elements: !38)
!38 = !{!39, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !37, file: !36, line: 51, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !37, file: !36, line: 52, baseType: !40, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !19, file: !18, line: 70, baseType: !43, size: 320)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 320, elements: !45)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !{!46}
!46 = !DISubrange(count: 40)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !19, file: !18, line: 71, baseType: !48, size: 64)
!48 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!49 = !{i32 7, !"Dwarf Version", i32 5}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = !{i32 7, !"PIC Level", i32 2}
!53 = !{i32 7, !"PIE Level", i32 2}
!54 = !{i32 7, !"uwtable", i32 1}
!55 = !{i32 7, !"frame-pointer", i32 2}
!56 = !{!"Ubuntu clang version 14.0.6"}
!57 = distinct !DISubprogram(name: "assume_abort_if_not", scope: !7, file: !7, line: 2, type: !58, scopeLine: 2, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !8}
!60 = !{}
!61 = !DILocalVariable(name: "cond", arg: 1, scope: !57, file: !7, line: 2, type: !8)
!62 = !DILocation(line: 0, scope: !57)
!63 = !DILocation(line: 3, column: 7, scope: !64)
!64 = distinct !DILexicalBlock(scope: !57, file: !7, line: 3, column: 6)
!65 = !DILocation(line: 3, column: 6, scope: !57)
!66 = !DILocation(line: 3, column: 14, scope: !67)
!67 = distinct !DILexicalBlock(scope: !64, file: !7, line: 3, column: 13)
!68 = !DILocation(line: 4, column: 1, scope: !57)
!69 = distinct !DISubprogram(name: "reach_error", scope: !7, file: !7, line: 7, type: !70, scopeLine: 7, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!70 = !DISubroutineType(types: !71)
!71 = !{null}
!72 = !DILocation(line: 7, column: 22, scope: !73)
!73 = distinct !DILexicalBlock(scope: !74, file: !7, line: 7, column: 22)
!74 = distinct !DILexicalBlock(scope: !69, file: !7, line: 7, column: 22)
!75 = distinct !DISubprogram(name: "__VERIFIER_atomic_use1", scope: !7, file: !7, line: 42, type: !58, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!76 = !DILocalVariable(name: "myidx", arg: 1, scope: !75, file: !7, line: 42, type: !8)
!77 = !DILocation(line: 0, scope: !75)
!78 = !DILocation(line: 43, column: 29, scope: !75)
!79 = !DILocation(line: 43, column: 34, scope: !75)
!80 = !DILocation(line: 43, column: 37, scope: !75)
!81 = !DILocation(line: 43, column: 41, scope: !75)
!82 = !DILocation(line: 43, column: 3, scope: !75)
!83 = !DILocation(line: 44, column: 7, scope: !75)
!84 = !DILocation(line: 45, column: 1, scope: !75)
!85 = distinct !DISubprogram(name: "__VERIFIER_atomic_use2", scope: !7, file: !7, line: 47, type: !58, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!86 = !DILocalVariable(name: "myidx", arg: 1, scope: !85, file: !7, line: 47, type: !8)
!87 = !DILocation(line: 0, scope: !85)
!88 = !DILocation(line: 48, column: 29, scope: !85)
!89 = !DILocation(line: 48, column: 34, scope: !85)
!90 = !DILocation(line: 48, column: 37, scope: !85)
!91 = !DILocation(line: 48, column: 41, scope: !85)
!92 = !DILocation(line: 48, column: 3, scope: !85)
!93 = !DILocation(line: 49, column: 7, scope: !85)
!94 = !DILocation(line: 50, column: 1, scope: !85)
!95 = distinct !DISubprogram(name: "__VERIFIER_atomic_use_done", scope: !7, file: !7, line: 52, type: !58, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!96 = !DILocalVariable(name: "myidx", arg: 1, scope: !95, file: !7, line: 52, type: !8)
!97 = !DILocation(line: 0, scope: !95)
!98 = !DILocation(line: 53, column: 13, scope: !99)
!99 = distinct !DILexicalBlock(scope: !95, file: !7, line: 53, column: 7)
!100 = !DILocation(line: 53, column: 7, scope: !95)
