; ModuleID = '/home/stefano/huawei/libvsync/datastruct/queue/bounded/test/bounded_mpmc_check_full.c'
source_filename = "/home/stefano/huawei/libvsync/datastruct/queue/bounded/test/bounded_mpmc_check_full.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.bounded_mpmc_s = type { %struct.vatomic32_s, %struct.vatomic32_s, %struct.vatomic32_s, %struct.vatomic32_s, i8**, i32 }
%struct.vatomic32_s = type { i32 }
%struct.xbo_s = type { i32, i32, i32, i32 }
%struct.run_info_t = type { i64, i64, i8, i8* (i8*)* }
%union.pthread_attr_t = type { i64, [48 x i8] }

@g_val = dso_local global [4 x i64] zeroinitializer, align 16, !dbg !0
@g_queue = dso_local global %struct.bounded_mpmc_s zeroinitializer, align 8, !dbg !48
@g_buf = dso_local global [4 x i8*] zeroinitializer, align 16, !dbg !42
@.str = private unnamed_addr constant [24 x i8] c"ret == QUEUE_BOUNDED_OK\00", align 1
@.str.1 = private unnamed_addr constant [86 x i8] c"/home/stefano/huawei/libvsync/datastruct/queue/bounded/test/bounded_mpmc_check_full.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1
@.str.2 = private unnamed_addr constant [22 x i8] c"(dequeued % 10U) == 1\00", align 1
@.str.3 = private unnamed_addr constant [26 x i8] c"dequeued <= (2 * 10U + 1)\00", align 1
@.str.4 = private unnamed_addr constant [26 x i8] c"ret == QUEUE_BOUNDED_FULL\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_val", scope: !2, file: !44, line: 36, type: !71, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !41, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/stefano/huawei/libvsync/datastruct/queue/bounded/test/bounded_mpmc_check_full.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "d08907d3dceff21e12ae5655a1278430")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 8, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "datastruct/queue/bounded/include/vsync/queue/internal/bounded_ret.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "391da9ed4071ef46b42c0029bc1a53be")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "QUEUE_BOUNDED_OK", value: 0)
!10 = !DIEnumerator(name: "QUEUE_BOUNDED_FULL", value: 1)
!11 = !DIEnumerator(name: "QUEUE_BOUNDED_EMPTY", value: 2)
!12 = !DIEnumerator(name: "QUEUE_BOUNDED_AGAIN", value: 3)
!13 = !{!14, !19, !22, !23, !24}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "vsize_t", file: !15, line: 43, baseType: !16)
!15 = !DIFile(filename: "include/vsync/vtypes.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "80559d0ebc17bc1f9d7b60e2c36ee0f3")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 46, baseType: !18)
!17 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!18 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuintptr_t", file: !15, line: 37, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !21, line: 90, baseType: !18)
!21 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "run_info_t", file: !26, line: 38, baseType: !27)
!26 = !DIFile(filename: "utils/include/test/thread_launcher.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "b854c1934ab1739fab93f88f22662d53")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 33, size: 256, elements: !28)
!28 = !{!29, !32, !33, !36}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !27, file: !26, line: 34, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !31, line: 27, baseType: !18)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!32 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !27, file: !26, line: 35, baseType: !14, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "assign_me_to_core", scope: !27, file: !26, line: 36, baseType: !34, size: 8, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "vbool_t", file: !15, line: 44, baseType: !35)
!35 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "run_fun", scope: !27, file: !26, line: 37, baseType: !37, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_fun_t", file: !26, line: 30, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!22, !22}
!41 = !{!42, !48, !0}
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "g_buf", scope: !2, file: !44, line: 34, type: !45, isLocal: false, isDefinition: true)
!44 = !DIFile(filename: "datastruct/queue/bounded/test/bounded_mpmc_check_full.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "d08907d3dceff21e12ae5655a1278430")
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 256, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 4)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "g_queue", scope: !2, file: !44, line: 35, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "bounded_mpmc_t", file: !51, line: 40, baseType: !52)
!51 = !DIFile(filename: "datastruct/queue/bounded/include/vsync/queue/bounded_mpmc.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "10225dc7f7d17a81603a9ca0b9243ec5")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bounded_mpmc_s", file: !51, line: 31, size: 256, elements: !53)
!53 = !{!54, !65, !66, !67, !68, !70}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "phead", scope: !52, file: !51, line: 32, baseType: !55, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "vatomic32_t", file: !56, line: 34, baseType: !57)
!56 = !DIFile(filename: "atomics/include/vsync/atomic/internal/types.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "566b0c58af89e39a453b706e5dc4ad25")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vatomic32_s", file: !56, line: 32, size: 32, align: 32, elements: !58)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_v", scope: !57, file: !56, line: 33, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuint32_t", file: !15, line: 35, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !62, line: 26, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 42, baseType: !7)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ptail", scope: !52, file: !51, line: 33, baseType: !55, size: 32, align: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "chead", scope: !52, file: !51, line: 35, baseType: !55, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ctail", scope: !52, file: !51, line: 36, baseType: !55, size: 32, align: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !52, file: !51, line: 38, baseType: !69, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !52, file: !51, line: 39, baseType: !60, size: 32, offset: 192)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !46)
!72 = !{i32 7, !"Dwarf Version", i32 5}
!73 = !{i32 2, !"Debug Info Version", i32 3}
!74 = !{i32 1, !"wchar_size", i32 4}
!75 = !{i32 7, !"PIC Level", i32 2}
!76 = !{i32 7, !"PIE Level", i32 2}
!77 = !{i32 7, !"uwtable", i32 1}
!78 = !{i32 7, !"frame-pointer", i32 2}
!79 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!80 = distinct !DISubprogram(name: "sched_yield", scope: !44, file: !44, line: 18, type: !81, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !84)
!81 = !DISubroutineType(types: !82)
!82 = !{!83}
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !{}
!85 = !DILocation(line: 20, column: 5, scope: !80)
!86 = distinct !DISubprogram(name: "writer", scope: !44, file: !44, line: 39, type: !39, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !84)
!87 = !DILocalVariable(name: "arg", arg: 1, scope: !86, file: !44, line: 39, type: !22)
!88 = !DILocation(line: 39, column: 14, scope: !86)
!89 = !DILocalVariable(name: "tid", scope: !86, file: !44, line: 41, type: !14)
!90 = !DILocation(line: 41, column: 13, scope: !86)
!91 = !DILocation(line: 41, column: 40, scope: !86)
!92 = !DILocation(line: 41, column: 28, scope: !86)
!93 = !DILocalVariable(name: "xbo", scope: !86, file: !44, line: 43, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "xbo_t", file: !95, line: 49, baseType: !96)
!95 = !DIFile(filename: "utils/include/vsync/utils/xbo.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "01e2840bcd40115be17bb38f1f2baae6")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xbo_s", file: !95, line: 45, size: 128, elements: !97)
!97 = !{!98, !99, !100, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !96, file: !95, line: 46, baseType: !60, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !96, file: !95, line: 46, baseType: !60, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !96, file: !95, line: 47, baseType: !60, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !96, file: !95, line: 48, baseType: !60, size: 32, offset: 96)
!102 = !DILocation(line: 43, column: 11, scope: !86)
!103 = !DILocation(line: 44, column: 5, scope: !86)
!104 = !DILocalVariable(name: "i", scope: !105, file: !44, line: 46, type: !14)
!105 = distinct !DILexicalBlock(scope: !86, file: !44, line: 46, column: 5)
!106 = !DILocation(line: 46, column: 18, scope: !105)
!107 = !DILocation(line: 46, column: 10, scope: !105)
!108 = !DILocation(line: 46, column: 25, scope: !109)
!109 = distinct !DILexicalBlock(scope: !105, file: !44, line: 46, column: 5)
!110 = !DILocation(line: 46, column: 27, scope: !109)
!111 = !DILocation(line: 46, column: 5, scope: !105)
!112 = !DILocalVariable(name: "idx", scope: !113, file: !44, line: 47, type: !14)
!113 = distinct !DILexicalBlock(scope: !109, file: !44, line: 46, column: 42)
!114 = !DILocation(line: 47, column: 17, scope: !113)
!115 = !DILocation(line: 47, column: 23, scope: !113)
!116 = !DILocation(line: 47, column: 27, scope: !113)
!117 = !DILocation(line: 47, column: 38, scope: !113)
!118 = !DILocation(line: 47, column: 36, scope: !113)
!119 = !DILocation(line: 48, column: 23, scope: !113)
!120 = !DILocation(line: 48, column: 27, scope: !113)
!121 = !DILocation(line: 48, column: 56, scope: !113)
!122 = !DILocation(line: 48, column: 54, scope: !113)
!123 = !DILocation(line: 48, column: 58, scope: !113)
!124 = !DILocation(line: 48, column: 15, scope: !113)
!125 = !DILocation(line: 48, column: 9, scope: !113)
!126 = !DILocation(line: 48, column: 21, scope: !113)
!127 = !DILocation(line: 49, column: 9, scope: !113)
!128 = !DILocation(line: 49, column: 50, scope: !113)
!129 = !DILocation(line: 49, column: 44, scope: !113)
!130 = !DILocation(line: 49, column: 43, scope: !113)
!131 = !DILocation(line: 49, column: 16, scope: !113)
!132 = !DILocation(line: 49, column: 56, scope: !113)
!133 = !DILocation(line: 50, column: 13, scope: !134)
!134 = distinct !DILexicalBlock(scope: !113, file: !44, line: 49, column: 77)
!135 = distinct !{!135, !127, !136, !137}
!136 = !DILocation(line: 51, column: 9, scope: !113)
!137 = !{!"llvm.loop.mustprogress"}
!138 = !DILocation(line: 52, column: 9, scope: !113)
!139 = !DILocation(line: 53, column: 5, scope: !113)
!140 = !DILocation(line: 46, column: 38, scope: !109)
!141 = !DILocation(line: 46, column: 5, scope: !109)
!142 = distinct !{!142, !111, !143, !137}
!143 = !DILocation(line: 53, column: 5, scope: !105)
!144 = !DILocation(line: 54, column: 5, scope: !86)
!145 = distinct !DISubprogram(name: "xbo_init", scope: !95, file: !95, line: 65, type: !146, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !84)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148, !60, !60, !60}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!149 = !DILocalVariable(name: "xbo", arg: 1, scope: !145, file: !95, line: 65, type: !148)
!150 = !DILocation(line: 65, column: 17, scope: !145)
!151 = !DILocalVariable(name: "min", arg: 2, scope: !145, file: !95, line: 65, type: !60)
!152 = !DILocation(line: 65, column: 32, scope: !145)
!153 = !DILocalVariable(name: "max", arg: 3, scope: !145, file: !95, line: 65, type: !60)
!154 = !DILocation(line: 65, column: 47, scope: !145)
!155 = !DILocalVariable(name: "factor", arg: 4, scope: !145, file: !95, line: 65, type: !60)
!156 = !DILocation(line: 65, column: 62, scope: !145)
!157 = !DILocation(line: 72, column: 1, scope: !145)
!158 = distinct !DISubprogram(name: "bounded_mpmc_enq", scope: !51, file: !51, line: 75, type: !159, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !84)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !162, !22}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "bounded_ret_t", file: !6, line: 13, baseType: !5)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
