; ModuleID = '/home/stefano/huawei/libvsync/datastruct/queue/bounded/test/bounded_mpmc_check_empty.c'
source_filename = "/home/stefano/huawei/libvsync/datastruct/queue/bounded/test/bounded_mpmc_check_empty.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.bounded_mpmc_s = type { %struct.vatomic32_s, %struct.vatomic32_s, %struct.vatomic32_s, %struct.vatomic32_s, i8**, i32 }
%struct.vatomic32_s = type { i32 }
%struct.xbo_s = type { i32, i32, i32, i32 }
%union.pthread_attr_t = type { i64, [48 x i8] }

@g_val = dso_local global [4 x i64] zeroinitializer, align 16, !dbg !0
@g_queue = dso_local global %struct.bounded_mpmc_s zeroinitializer, align 8, !dbg !31
@g_cs_x = dso_local global %struct.vatomic32_s zeroinitializer, align 4, !dbg !57
@.str = private unnamed_addr constant [14 x i8] c"idx < (2 * 2)\00", align 1
@.str.1 = private unnamed_addr constant [87 x i8] c"/home/stefano/huawei/libvsync/datastruct/queue/bounded/test/bounded_mpmc_check_empty.c\00", align 1
@__PRETTY_FUNCTION__.reader = private unnamed_addr constant [21 x i8] c"void *reader(void *)\00", align 1
@g_ret = dso_local global [4 x i64] zeroinitializer, align 16, !dbg !54
@.str.2 = private unnamed_addr constant [16 x i8] c"g_ret[idx] != 0\00", align 1
@g_buf = dso_local global [4 x i8*] zeroinitializer, align 16, !dbg !25
@.str.3 = private unnamed_addr constant [17 x i8] c"found == (2 * 2)\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_val", scope: !2, file: !27, line: 45, type: !56, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/stefano/huawei/libvsync/datastruct/queue/bounded/test/bounded_mpmc_check_empty.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "d9f8f034263e79e4d90c246f822e35b1")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 8, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "datastruct/queue/bounded/include/vsync/queue/internal/bounded_ret.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "391da9ed4071ef46b42c0029bc1a53be")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "QUEUE_BOUNDED_OK", value: 0)
!10 = !DIEnumerator(name: "QUEUE_BOUNDED_FULL", value: 1)
!11 = !DIEnumerator(name: "QUEUE_BOUNDED_EMPTY", value: 2)
!12 = !DIEnumerator(name: "QUEUE_BOUNDED_AGAIN", value: 3)
!13 = !{!14, !19, !20}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuintptr_t", file: !15, line: 37, baseType: !16)
!15 = !DIFile(filename: "include/vsync/vtypes.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "80559d0ebc17bc1f9d7b60e2c36ee0f3")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !17, line: 90, baseType: !18)
!17 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!18 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "vsize_t", file: !15, line: 43, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !23, line: 46, baseType: !18)
!23 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!24 = !{!25, !31, !0, !54, !57}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "g_buf", scope: !2, file: !27, line: 42, type: !28, isLocal: false, isDefinition: true)
!27 = !DIFile(filename: "datastruct/queue/bounded/test/bounded_mpmc_check_empty.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "d9f8f034263e79e4d90c246f822e35b1")
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 256, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 4)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "g_queue", scope: !2, file: !27, line: 43, type: !33, isLocal: false, isDefinition: true)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "bounded_mpmc_t", file: !34, line: 40, baseType: !35)
!34 = !DIFile(filename: "datastruct/queue/bounded/include/vsync/queue/bounded_mpmc.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "10225dc7f7d17a81603a9ca0b9243ec5")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bounded_mpmc_s", file: !34, line: 31, size: 256, elements: !36)
!36 = !{!37, !48, !49, !50, !51, !53}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "phead", scope: !35, file: !34, line: 32, baseType: !38, size: 32, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "vatomic32_t", file: !39, line: 34, baseType: !40)
!39 = !DIFile(filename: "atomics/include/vsync/atomic/internal/types.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "566b0c58af89e39a453b706e5dc4ad25")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vatomic32_s", file: !39, line: 32, size: 32, align: 32, elements: !41)
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_v", scope: !40, file: !39, line: 33, baseType: !43, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuint32_t", file: !15, line: 35, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !45, line: 26, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !47, line: 42, baseType: !7)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptail", scope: !35, file: !34, line: 33, baseType: !38, size: 32, align: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "chead", scope: !35, file: !34, line: 35, baseType: !38, size: 32, align: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ctail", scope: !35, file: !34, line: 36, baseType: !38, size: 32, align: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !35, file: !34, line: 38, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !34, line: 39, baseType: !43, size: 32, offset: 192)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "g_ret", scope: !2, file: !27, line: 46, type: !56, isLocal: false, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !29)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "g_cs_x", scope: !2, file: !27, line: 47, type: !38, isLocal: false, isDefinition: true)
!59 = !{i32 7, !"Dwarf Version", i32 5}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 4}
!62 = !{i32 7, !"PIC Level", i32 2}
!63 = !{i32 7, !"PIE Level", i32 2}
!64 = !{i32 7, !"uwtable", i32 1}
!65 = !{i32 7, !"frame-pointer", i32 2}
!66 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!67 = distinct !DISubprogram(name: "sched_yield", scope: !27, file: !27, line: 19, type: !68, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !71)
!68 = !DISubroutineType(types: !69)
!69 = !{!70}
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !{}
!72 = !DILocation(line: 21, column: 5, scope: !67)
!73 = distinct !DISubprogram(name: "writer", scope: !27, file: !27, line: 50, type: !74, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !71)
!74 = !DISubroutineType(types: !75)
!75 = !{!19, !19}
!76 = !DILocalVariable(name: "arg", arg: 1, scope: !73, file: !27, line: 50, type: !19)
!77 = !DILocation(line: 50, column: 14, scope: !73)
!78 = !DILocalVariable(name: "tid", scope: !73, file: !27, line: 52, type: !14)
!79 = !DILocation(line: 52, column: 16, scope: !73)
!80 = !DILocation(line: 52, column: 34, scope: !73)
!81 = !DILocation(line: 52, column: 22, scope: !73)
!82 = !DILocalVariable(name: "xbo", scope: !73, file: !27, line: 54, type: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "xbo_t", file: !84, line: 49, baseType: !85)
!84 = !DIFile(filename: "utils/include/vsync/utils/xbo.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "01e2840bcd40115be17bb38f1f2baae6")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xbo_s", file: !84, line: 45, size: 128, elements: !86)
!86 = !{!87, !88, !89, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !85, file: !84, line: 46, baseType: !43, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !85, file: !84, line: 46, baseType: !43, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !85, file: !84, line: 47, baseType: !43, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !85, file: !84, line: 48, baseType: !43, size: 32, offset: 96)
!91 = !DILocation(line: 54, column: 11, scope: !73)
!92 = !DILocation(line: 55, column: 5, scope: !73)
!93 = !DILocalVariable(name: "i", scope: !94, file: !27, line: 57, type: !21)
!94 = distinct !DILexicalBlock(scope: !73, file: !27, line: 57, column: 5)
!95 = !DILocation(line: 57, column: 18, scope: !94)
!96 = !DILocation(line: 57, column: 10, scope: !94)
!97 = !DILocation(line: 57, column: 25, scope: !98)
!98 = distinct !DILexicalBlock(scope: !94, file: !27, line: 57, column: 5)
!99 = !DILocation(line: 57, column: 27, scope: !98)
!100 = !DILocation(line: 57, column: 5, scope: !94)
!101 = !DILocalVariable(name: "idx", scope: !102, file: !27, line: 58, type: !21)
!102 = distinct !DILexicalBlock(scope: !98, file: !27, line: 57, column: 42)
!103 = !DILocation(line: 58, column: 17, scope: !102)
!104 = !DILocation(line: 58, column: 23, scope: !102)
!105 = !DILocation(line: 58, column: 27, scope: !102)
!106 = !DILocation(line: 58, column: 38, scope: !102)
!107 = !DILocation(line: 58, column: 36, scope: !102)
!108 = !DILocation(line: 59, column: 23, scope: !102)
!109 = !DILocation(line: 59, column: 27, scope: !102)
!110 = !DILocation(line: 59, column: 42, scope: !102)
!111 = !DILocation(line: 59, column: 40, scope: !102)
!112 = !DILocation(line: 59, column: 44, scope: !102)
!113 = !DILocation(line: 59, column: 15, scope: !102)
!114 = !DILocation(line: 59, column: 9, scope: !102)
!115 = !DILocation(line: 59, column: 21, scope: !102)
!116 = !DILocation(line: 60, column: 9, scope: !102)
!117 = !DILocation(line: 60, column: 50, scope: !102)
!118 = !DILocation(line: 60, column: 44, scope: !102)
!119 = !DILocation(line: 60, column: 43, scope: !102)
!120 = !DILocation(line: 60, column: 16, scope: !102)
!121 = !DILocation(line: 60, column: 56, scope: !102)
!122 = !DILocation(line: 62, column: 13, scope: !123)
!123 = distinct !DILexicalBlock(scope: !102, file: !27, line: 60, column: 77)
!124 = distinct !{!124, !116, !125, !126}
!125 = !DILocation(line: 63, column: 9, scope: !102)
!126 = !{!"llvm.loop.mustprogress"}
!127 = !DILocation(line: 64, column: 9, scope: !102)
!128 = !DILocation(line: 65, column: 5, scope: !102)
!129 = !DILocation(line: 57, column: 38, scope: !98)
!130 = !DILocation(line: 57, column: 5, scope: !98)
!131 = distinct !{!131, !100, !132, !126}
!132 = !DILocation(line: 65, column: 5, scope: !94)
!133 = !DILocation(line: 66, column: 5, scope: !73)
!134 = distinct !DISubprogram(name: "xbo_init", scope: !84, file: !84, line: 65, type: !135, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !137, !43, !43, !43}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!138 = !DILocalVariable(name: "xbo", arg: 1, scope: !134, file: !84, line: 65, type: !137)
!139 = !DILocation(line: 65, column: 17, scope: !134)
!140 = !DILocalVariable(name: "min", arg: 2, scope: !134, file: !84, line: 65, type: !43)
!141 = !DILocation(line: 65, column: 32, scope: !134)
!142 = !DILocalVariable(name: "max", arg: 3, scope: !134, file: !84, line: 65, type: !43)
!143 = !DILocation(line: 65, column: 47, scope: !134)
!144 = !DILocalVariable(name: "factor", arg: 4, scope: !134, file: !84, line: 65, type: !43)
!145 = !DILocation(line: 65, column: 62, scope: !134)
!146 = !DILocation(line: 72, column: 1, scope: !134)
!147 = distinct !DISubprogram(name: "bounded_mpmc_enq", scope: !34, file: !34, line: 75, type: !148, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !151, !19}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "bounded_ret_t", file: !6, line: 13, baseType: !5)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
