; ModuleID = 'ebr_test.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx14.0.0"

%struct.ck_epoch = type { i32, i32, %struct.ck_stack }
%struct.ck_stack = type { %struct.ck_stack_entry*, i8* }
%struct.ck_stack_entry = type { %struct.ck_stack_entry* }
%struct.ck_epoch_record = type { %struct.ck_stack_entry, %struct.ck_epoch*, i32, i32, i32, %struct.anon, i32, i32, i32, i8*, [4 x %struct.ck_stack] }
%struct.anon = type { [2 x %struct.ck_epoch_ref] }
%struct.ck_epoch_ref = type { i32, i32 }
%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
%struct._opaque_pthread_attr_t = type { i64, [56 x i8] }
%struct.ck_epoch_section = type { i32 }
%struct.ck_epoch_entry = type { void (%struct.ck_epoch_entry*)*, %struct.ck_stack_entry }

@stack_epoch = internal global %struct.ck_epoch zeroinitializer, align 8, !dbg !0
@records = global [4 x %struct.ck_epoch_record] zeroinitializer, align 8, !dbg !69
@__func__.thread = private unnamed_addr constant [7 x i8] c"thread\00", align 1
@.str = private unnamed_addr constant [14 x i8] c"client-code.c\00", align 1
@.str.1 = private unnamed_addr constant [32 x i8] c"global_epoch - local_epoch <= 1\00", align 1

; Function Attrs: noinline nounwind ssp uwtable
define i32 @main(i32 noundef %0, i8** noundef %1) #0 !dbg !147 {

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stack_epoch", scope: !2, file: !3, line: 10, type: !72, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Homebrew clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !68, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!3 = !DIFile(filename: "client-code.c", directory: "/Users/thomashaas/IdeaProjects/Dat3M/benchmarks/demo/ck_epoch")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "memory_order", file: !6, line: 56, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@14/14.0.6/lib/clang/14.0.6/include/stdatomic.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "memory_order_relaxed", value: 0)
!10 = !DIEnumerator(name: "memory_order_consume", value: 1)
!11 = !DIEnumerator(name: "memory_order_acquire", value: 2)
!12 = !DIEnumerator(name: "memory_order_release", value: 3)
!13 = !DIEnumerator(name: "memory_order_acq_rel", value: 4)
!14 = !DIEnumerator(name: "memory_order_seq_cst", value: 5)
!15 = !{!16, !17}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_record_t", file: !19, line: 101, baseType: !20)
!19 = !DIFile(filename: "./ck_epoch.h", directory: "/Users/thomashaas/IdeaProjects/Dat3M/benchmarks/demo/ck_epoch")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_record", file: !19, line: 86, size: 1024, elements: !21)
!21 = !{!22, !30, !45, !46, !47, !48, !59, !60, !61, !62, !64}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "record_next", scope: !20, file: !19, line: 87, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_stack_entry_t", file: !24, line: 41, baseType: !25)
!24 = !DIFile(filename: "./ck_stack.h", directory: "/Users/thomashaas/IdeaProjects/Dat3M/benchmarks/demo/ck_epoch")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_stack_entry", file: !24, line: 37, size: 64, elements: !26)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !24, line: 38, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !20, file: !19, line: 88, baseType: !31, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch", file: !19, line: 103, size: 192, elements: !33)
!33 = !{!34, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !32, file: !19, line: 104, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !7)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "n_free", scope: !32, file: !19, line: 105, baseType: !35, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !32, file: !19, line: 106, baseType: !38, size: 128, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_stack_t", file: !24, line: 47, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_stack", file: !24, line: 43, size: 128, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !39, file: !24, line: 44, baseType: !28, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "generation", scope: !39, file: !24, line: 45, baseType: !43, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !20, file: !19, line: 89, baseType: !35, size: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !20, file: !19, line: 90, baseType: !35, size: 32, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !20, file: !19, line: 91, baseType: !35, size: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !20, file: !19, line: 94, baseType: !49, size: 128, offset: 224)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !20, file: !19, line: 92, size: 128, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !49, file: !19, line: 93, baseType: !52, size: 128)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !57)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_ref", file: !19, line: 80, size: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !53, file: !19, line: 81, baseType: !7, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !53, file: !19, line: 82, baseType: !7, size: 32, offset: 32)
!57 = !{!58}
!58 = !DISubrange(count: 2)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "n_pending", scope: !20, file: !19, line: 95, baseType: !35, size: 32, offset: 352)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "n_peak", scope: !20, file: !19, line: 96, baseType: !35, size: 32, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "n_dispatch", scope: !20, file: !19, line: 97, baseType: !35, size: 32, offset: 416)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !20, file: !19, line: 98, baseType: !63, size: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !16)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !20, file: !19, line: 99, baseType: !65, size: 512, offset: 512)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 512, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 4)
!68 = !{!0, !69}
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "records", scope: !2, file: !3, line: 33, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 4096, elements: !66)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_t", file: !19, line: 108, baseType: !32)
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "Homebrew clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !75, retainedTypes: !80, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!74 = !DIFile(filename: "ck_epoch.c", directory: "/Users/thomashaas/IdeaProjects/Dat3M/benchmarks/demo/ck_epoch")
!75 = !{!5, !76}
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 140, baseType: !7, size: 32, elements: !77)
!77 = !{!78, !79}
!78 = !DIEnumerator(name: "CK_EPOCH_STATE_USED", value: 0)
!79 = !DIEnumerator(name: "CK_EPOCH_STATE_FREE", value: 1)
!80 = !{!81, !16, !82, !43, !122, !125}
!81 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_record", file: !19, line: 86, size: 1024, elements: !84)
!84 = !{!85, !92, !104, !105, !106, !107, !116, !117, !118, !119, !120}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "record_next", scope: !83, file: !19, line: 87, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_stack_entry_t", file: !24, line: 41, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_stack_entry", file: !24, line: 37, size: 64, elements: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !24, line: 38, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !83, file: !19, line: 88, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch", file: !19, line: 103, size: 192, elements: !95)
!95 = !{!96, !97, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !94, file: !19, line: 104, baseType: !35, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "n_free", scope: !94, file: !19, line: 105, baseType: !35, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !94, file: !19, line: 106, baseType: !99, size: 128, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_stack_t", file: !24, line: 47, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_stack", file: !24, line: 43, size: 128, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !100, file: !24, line: 44, baseType: !90, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "generation", scope: !100, file: !24, line: 45, baseType: !43, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !83, file: !19, line: 89, baseType: !35, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !83, file: !19, line: 90, baseType: !35, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !83, file: !19, line: 91, baseType: !35, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !83, file: !19, line: 94, baseType: !108, size: 128, offset: 224)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !83, file: !19, line: 92, size: 128, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !108, file: !19, line: 93, baseType: !111, size: 128)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, elements: !57)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_ref", file: !19, line: 80, size: 64, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !112, file: !19, line: 81, baseType: !7, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !112, file: !19, line: 82, baseType: !7, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "n_pending", scope: !83, file: !19, line: 95, baseType: !35, size: 32, offset: 352)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "n_peak", scope: !83, file: !19, line: 96, baseType: !35, size: 32, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "n_dispatch", scope: !83, file: !19, line: 97, baseType: !35, size: 32, offset: 416)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !83, file: !19, line: 98, baseType: !63, size: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !83, file: !19, line: 99, baseType: !121, size: 512, offset: 512)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 512, elements: !66)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 46, baseType: !124)
!123 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@14/14.0.6/lib/clang/14.0.6/include/stddef.h", directory: "")
!124 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_entry", file: !19, line: 60, size: 128, elements: !127)
!127 = !{!128, !135}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !126, file: !19, line: 61, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_cb_t", file: !19, line: 54, baseType: !131)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_entry_t", file: !19, line: 53, baseType: !126)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "stack_entry", scope: !126, file: !19, line: 62, baseType: !86, size: 64, offset: 64)
!136 = !{!"Homebrew clang version 14.0.6"}
!137 = !{i32 7, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{i32 1, !"wchar_size", i32 4}
!140 = !{i32 1, !"branch-target-enforcement", i32 0}
!141 = !{i32 1, !"sign-return-address", i32 0}
!142 = !{i32 1, !"sign-return-address-all", i32 0}
!143 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!144 = !{i32 7, !"PIC Level", i32 2}
!145 = !{i32 7, !"uwtable", i32 1}
!146 = !{i32 7, !"frame-pointer", i32 1}
!147 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 35, type: !148, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !151)
!148 = !DISubroutineType(types: !149)
!149 = !{!81, !81, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!151 = !{}
!152 = !DILocalVariable(name: "argc", arg: 1, scope: !147, file: !3, line: 35, type: !81)
!153 = !DILocation(line: 0, scope: !147)
!154 = !DILocalVariable(name: "argv", arg: 2, scope: !147, file: !3, line: 35, type: !150)
!155 = !DILocalVariable(name: "threads", scope: !147, file: !3, line: 37, type: !156)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 256, elements: !66)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !158, line: 31, baseType: !159)
!158 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_pthread/_pthread_t.h", directory: "")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_t", file: !160, line: 118, baseType: !161)
!160 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_pthread/_pthread_types.h", directory: "")
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_t", file: !160, line: 103, size: 65536, elements: !163)
!163 = !{!164, !166, !176}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !162, file: !160, line: 104, baseType: !165, size: 64)
!165 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup_stack", scope: !162, file: !160, line: 105, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_pthread_handler_rec", file: !160, line: 57, size: 192, elements: !169)
!169 = !{!170, !174, !175}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__routine", scope: !168, file: !160, line: 58, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !16}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__arg", scope: !168, file: !160, line: 59, baseType: !16, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !168, file: !160, line: 60, baseType: !167, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !162, file: !160, line: 106, baseType: !177, size: 65408, offset: 128)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 65408, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 8176)
!180 = !DILocation(line: 37, column: 12, scope: !147)
!181 = !DILocation(line: 39, column: 2, scope: !147)
!182 = !DILocation(line: 41, column: 2, scope: !147)
!183 = !DILocalVariable(name: "i", scope: !184, file: !3, line: 42, type: !81)
!184 = distinct !DILexicalBlock(scope: !147, file: !3, line: 42, column: 2)
!185 = !DILocation(line: 0, scope: !184)
!186 = !DILocation(line: 43, column: 3, scope: !187)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 42, column: 37)
!188 = distinct !DILexicalBlock(scope: !184, file: !3, line: 42, column: 2)
!189 = !DILocation(line: 44, column: 19, scope: !187)
!190 = !DILocation(line: 44, column: 3, scope: !187)
!191 = !DILocation(line: 47, column: 2, scope: !147)
!192 = distinct !DISubprogram(name: "thread", scope: !3, file: !3, line: 12, type: !193, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !151)
!193 = !DISubroutineType(types: !194)
!194 = !{!16, !16}
!195 = !DILocalVariable(name: "arg", arg: 1, scope: !192, file: !3, line: 12, type: !16)
!196 = !DILocation(line: 0, scope: !192)
!197 = !DILocation(line: 14, column: 30, scope: !192)
!198 = !DILocalVariable(name: "record", scope: !192, file: !3, line: 14, type: !17)
!199 = !DILocation(line: 19, column: 2, scope: !192)
!200 = !DILocation(line: 20, column: 21, scope: !192)
!201 = !DILocalVariable(name: "global_epoch", scope: !192, file: !3, line: 20, type: !81)
!202 = !DILocation(line: 21, column: 20, scope: !192)
!203 = !DILocalVariable(name: "local_epoch", scope: !192, file: !3, line: 21, type: !81)
!204 = !DILocation(line: 22, column: 2, scope: !192)
!205 = !DILocation(line: 25, column: 2, scope: !192)
!206 = !DILocation(line: 27, column: 2, scope: !192)
!207 = !DILocation(line: 29, column: 2, scope: !192)
!208 = distinct !DISubprogram(name: "ck_epoch_begin", scope: !19, file: !19, line: 127, type: !209, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !151)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !17, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_section_t", file: !19, line: 72, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_section", file: !19, line: 69, size: 32, elements: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !213, file: !19, line: 70, baseType: !7, size: 32)
!216 = !DILocalVariable(name: "record", arg: 1, scope: !208, file: !19, line: 127, type: !17)
!217 = !DILocation(line: 0, scope: !208)
!218 = !DILocalVariable(name: "section", arg: 2, scope: !208, file: !19, line: 127, type: !211)
!219 = !DILocation(line: 129, column: 35, scope: !208)
!220 = !DILocalVariable(name: "epoch", scope: !208, file: !19, line: 129, type: !31)
!221 = !DILocation(line: 135, column: 6, scope: !222)
!222 = distinct !DILexicalBlock(scope: !208, file: !19, line: 135, column: 6)
!223 = !DILocation(line: 135, column: 39, scope: !222)
!224 = !DILocation(line: 135, column: 6, scope: !208)
!225 = !DILocation(line: 147, column: 3, scope: !226)
!226 = distinct !DILexicalBlock(scope: !222, file: !19, line: 135, column: 45)
!227 = !DILocation(line: 148, column: 3, scope: !226)
!228 = !DILocation(line: 158, column: 13, scope: !226)
!229 = !DILocalVariable(name: "g_epoch", scope: !226, file: !19, line: 136, type: !7)
!230 = !DILocation(line: 0, scope: !226)
!231 = !DILocation(line: 159, column: 3, scope: !226)
!232 = !DILocation(line: 160, column: 2, scope: !226)
!233 = !DILocation(line: 161, column: 3, scope: !234)
