; ModuleID = 'ebr_test.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ck_epoch = type { i32, i32, %struct.ck_stack }
%struct.ck_stack = type { %struct.ck_stack_entry*, i8* }
%struct.ck_stack_entry = type { %struct.ck_stack_entry* }
%struct.ck_epoch_record = type { %struct.ck_stack_entry, %struct.ck_epoch*, i32, i32, i32, %struct.anon, i32, i32, i32, i8*, [4 x %struct.ck_stack] }
%struct.anon = type { [2 x %struct.ck_epoch_ref] }
%struct.ck_epoch_ref = type { i32, i32 }
%union.pthread_attr_t = type { i64, [48 x i8] }
%struct.ck_epoch_section = type { i32 }
%struct.ck_epoch_entry = type { void (%struct.ck_epoch_entry*)*, %struct.ck_stack_entry }

@stack_epoch = internal global %struct.ck_epoch zeroinitializer, align 8, !dbg !0
@records = dso_local global [4 x %struct.ck_epoch_record] zeroinitializer, align 16, !dbg !69
@.str = private unnamed_addr constant [41 x i8] c"!(local_epoch == 1 && global_epoch == 3)\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"client-code.c\00", align 1
@__PRETTY_FUNCTION__.thread = private unnamed_addr constant [21 x i8] c"void *thread(void *)\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @main(i32 %0, i8** %1) #0 !dbg !140 {
  %3 = alloca [4 x i64], align 16
  call void @llvm.dbg.value(metadata i32 %0, metadata !145, metadata !DIExpression()), !dbg !146

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stack_epoch", scope: !2, file: !3, line: 48, type: !72, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.0-3ubuntu1~20.04.5", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !68, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "client-code.c", directory: "/home/ponce/git/SMR-verification/verification/ck/ck_epoch")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "memory_order", file: !6, line: 47, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.0/include/stdatomic.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "memory_order_relaxed", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "memory_order_consume", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "memory_order_acquire", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "memory_order_release", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "memory_order_acq_rel", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "memory_order_seq_cst", value: 5, isUnsigned: true)
!15 = !{!16, !17}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_record_t", file: !19, line: 101, baseType: !20)
!19 = !DIFile(filename: "./ck_epoch.h", directory: "/home/ponce/git/SMR-verification/verification/ck/ck_epoch")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_record", file: !19, line: 86, size: 1024, elements: !21)
!21 = !{!22, !30, !45, !46, !47, !48, !59, !60, !61, !62, !64}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "record_next", scope: !20, file: !19, line: 87, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_stack_entry_t", file: !24, line: 41, baseType: !25)
!24 = !DIFile(filename: "./ck_stack.h", directory: "/home/ponce/git/SMR-verification/verification/ck/ck_epoch")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_stack_entry", file: !24, line: 37, size: 64, elements: !26)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !24, line: 38, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !20, file: !19, line: 88, baseType: !31, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch", file: !19, line: 103, size: 192, elements: !33)
!33 = !{!34, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !32, file: !19, line: 104, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !7)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "n_free", scope: !32, file: !19, line: 105, baseType: !35, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !32, file: !19, line: 106, baseType: !38, size: 128, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_stack_t", file: !24, line: 47, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_stack", file: !24, line: 43, size: 128, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !39, file: !24, line: 44, baseType: !28, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "generation", scope: !39, file: !24, line: 45, baseType: !43, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !20, file: !19, line: 89, baseType: !35, size: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !20, file: !19, line: 90, baseType: !35, size: 32, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !20, file: !19, line: 91, baseType: !35, size: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !20, file: !19, line: 94, baseType: !49, size: 128, offset: 224)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !20, file: !19, line: 92, size: 128, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !49, file: !19, line: 93, baseType: !52, size: 128)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !57)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_ref", file: !19, line: 80, size: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !53, file: !19, line: 81, baseType: !7, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !53, file: !19, line: 82, baseType: !7, size: 32, offset: 32)
!57 = !{!58}
!58 = !DISubrange(count: 2)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "n_pending", scope: !20, file: !19, line: 95, baseType: !35, size: 32, offset: 352)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "n_peak", scope: !20, file: !19, line: 96, baseType: !35, size: 32, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "n_dispatch", scope: !20, file: !19, line: 97, baseType: !35, size: 32, offset: 416)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !20, file: !19, line: 98, baseType: !63, size: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !16)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !20, file: !19, line: 99, baseType: !65, size: 512, offset: 512)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 512, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 4)
!68 = !{!0, !69}
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "records", scope: !2, file: !3, line: 71, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 4096, elements: !66)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_t", file: !19, line: 108, baseType: !32)
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "Ubuntu clang version 12.0.0-3ubuntu1~20.04.5", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !75, retainedTypes: !80, splitDebugInlining: false, nameTableKind: None)
!74 = !DIFile(filename: "ck_epoch.c", directory: "/home/ponce/git/SMR-verification/verification/ck/ck_epoch")
!75 = !{!5, !76}
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 140, baseType: !7, size: 32, elements: !77)
!77 = !{!78, !79}
!78 = !DIEnumerator(name: "CK_EPOCH_STATE_USED", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "CK_EPOCH_STATE_FREE", value: 1, isUnsigned: true)
!80 = !{!81, !16, !82, !43, !122, !125}
!81 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_record", file: !19, line: 86, size: 1024, elements: !84)
!84 = !{!85, !92, !104, !105, !106, !107, !116, !117, !118, !119, !120}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "record_next", scope: !83, file: !19, line: 87, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_stack_entry_t", file: !24, line: 41, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_stack_entry", file: !24, line: 37, size: 64, elements: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !24, line: 38, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_atomic_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !83, file: !19, line: 88, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch", file: !19, line: 103, size: 192, elements: !95)
!95 = !{!96, !97, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !94, file: !19, line: 104, baseType: !35, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "n_free", scope: !94, file: !19, line: 105, baseType: !35, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !94, file: !19, line: 106, baseType: !99, size: 128, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_stack_t", file: !24, line: 47, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_stack", file: !24, line: 43, size: 128, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !100, file: !24, line: 44, baseType: !90, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "generation", scope: !100, file: !24, line: 45, baseType: !43, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !83, file: !19, line: 89, baseType: !35, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !83, file: !19, line: 90, baseType: !35, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !83, file: !19, line: 91, baseType: !35, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !83, file: !19, line: 94, baseType: !108, size: 128, offset: 224)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !83, file: !19, line: 92, size: 128, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !108, file: !19, line: 93, baseType: !111, size: 128)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, elements: !57)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_ref", file: !19, line: 80, size: 64, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !112, file: !19, line: 81, baseType: !7, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !112, file: !19, line: 82, baseType: !7, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "n_pending", scope: !83, file: !19, line: 95, baseType: !35, size: 32, offset: 352)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "n_peak", scope: !83, file: !19, line: 96, baseType: !35, size: 32, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "n_dispatch", scope: !83, file: !19, line: 97, baseType: !35, size: 32, offset: 416)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !83, file: !19, line: 98, baseType: !63, size: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !83, file: !19, line: 99, baseType: !121, size: 512, offset: 512)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 512, elements: !66)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 46, baseType: !124)
!123 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.0/include/stddef.h", directory: "")
!124 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_entry", file: !19, line: 60, size: 128, elements: !127)
!127 = !{!128, !135}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !126, file: !19, line: 61, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_cb_t", file: !19, line: 54, baseType: !131)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_entry_t", file: !19, line: 53, baseType: !126)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "stack_entry", scope: !126, file: !19, line: 62, baseType: !86, size: 64, offset: 64)
!136 = !{!"Ubuntu clang version 12.0.0-3ubuntu1~20.04.5"}
!137 = !{i32 7, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{i32 1, !"wchar_size", i32 4}
!140 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 73, type: !141, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !144)
!141 = !DISubroutineType(types: !142)
!142 = !{!81, !81, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!144 = !{}
!145 = !DILocalVariable(name: "argc", arg: 1, scope: !140, file: !3, line: 73, type: !81)
!146 = !DILocation(line: 0, scope: !140)
!147 = !DILocalVariable(name: "argv", arg: 2, scope: !140, file: !3, line: 73, type: !143)
!148 = !DILocalVariable(name: "threads", scope: !140, file: !3, line: 75, type: !149)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !66)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !151, line: 27, baseType: !124)
!151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!152 = !DILocation(line: 75, column: 12, scope: !140)
!153 = !DILocation(line: 77, column: 2, scope: !140)
!154 = !DILocation(line: 79, column: 2, scope: !140)
!155 = !DILocalVariable(name: "i", scope: !156, file: !3, line: 80, type: !81)
!156 = distinct !DILexicalBlock(scope: !140, file: !3, line: 80, column: 2)
!157 = !DILocation(line: 0, scope: !156)
!158 = !DILocation(line: 81, column: 3, scope: !159)
!159 = distinct !DILexicalBlock(scope: !160, file: !3, line: 80, column: 37)
!160 = distinct !DILexicalBlock(scope: !156, file: !3, line: 80, column: 2)
!161 = !DILocation(line: 82, column: 19, scope: !159)
!162 = !DILocation(line: 82, column: 3, scope: !159)
!163 = !DILocation(line: 85, column: 2, scope: !140)
!164 = !DILocalVariable(name: "i", scope: !165, file: !3, line: 86, type: !81)
!165 = distinct !DILexicalBlock(scope: !140, file: !3, line: 86, column: 2)
!166 = !DILocation(line: 0, scope: !165)
!167 = !DILocation(line: 87, column: 16, scope: !168)
!168 = distinct !DILexicalBlock(scope: !165, file: !3, line: 86, column: 2)
!169 = !DILocation(line: 87, column: 3, scope: !168)
!170 = !DILocation(line: 89, column: 2, scope: !140)
!171 = distinct !DISubprogram(name: "thread", scope: !3, file: !3, line: 50, type: !172, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !144)
!172 = !DISubroutineType(types: !173)
!173 = !{!16, !16}
!174 = !DILocalVariable(name: "arg", arg: 1, scope: !171, file: !3, line: 50, type: !16)
!175 = !DILocation(line: 0, scope: !171)
!176 = !DILocation(line: 52, column: 30, scope: !171)
!177 = !DILocalVariable(name: "record", scope: !171, file: !3, line: 52, type: !17)
!178 = !DILocation(line: 57, column: 2, scope: !171)
!179 = !DILocation(line: 58, column: 21, scope: !171)
!180 = !DILocalVariable(name: "global_epoch", scope: !171, file: !3, line: 58, type: !81)
!181 = !DILocation(line: 59, column: 20, scope: !171)
!182 = !DILocalVariable(name: "local_epoch", scope: !171, file: !3, line: 59, type: !81)
!183 = !DILocation(line: 60, column: 2, scope: !171)
!184 = !DILocation(line: 63, column: 2, scope: !185)
!185 = distinct !DILexicalBlock(scope: !186, file: !3, line: 63, column: 2)
!186 = distinct !DILexicalBlock(scope: !171, file: !3, line: 63, column: 2)
!187 = !DILocation(line: 65, column: 2, scope: !171)
!188 = !DILocation(line: 67, column: 2, scope: !171)
!189 = distinct !DISubprogram(name: "ck_epoch_begin", scope: !19, file: !19, line: 127, type: !190, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !144)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !17, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
