; ModuleID = 'tests/anderson.c'
source_filename = "tests/anderson.c"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.ck_spinlock_anderson = type { ptr, i32, i32, i32, [44 x i8], i32 }
%struct.ck_spinlock_anderson_thread = type { i32, i32 }

@x = global i32 0, align 4, !dbg !0
@y = global i32 0, align 4, !dbg !18
@lock = global %struct.ck_spinlock_anderson zeroinitializer, align 8, !dbg !38
@slots = global ptr null, align 8, !dbg !53
@__func__.main = private unnamed_addr constant [5 x i8] c"main\00", align 1, !dbg !21
@.str = private unnamed_addr constant [11 x i8] c"anderson.c\00", align 1, !dbg !28
@.str.1 = private unnamed_addr constant [31 x i8] c"x == NTHREADS && y == NTHREADS\00", align 1, !dbg !33

; Function Attrs: noinline nounwind optnone ssp uwtable(sync)
define ptr @run(ptr noundef %0) #0 !dbg !63 {
  %2 = alloca ptr, align 8
  %3 = alloca ptr, align 8
  store ptr %0, ptr %2, align 8
  call void @ck_spinlock_anderson_lock(ptr noundef @lock, ptr noundef %3), !dbg !71
  %4 = load i32, ptr @x, align 4, !dbg !72
  %5 = add nsw i32 %4, 1, !dbg !72
  store i32 %5, ptr @x, align 4, !dbg !72
  %6 = load i32, ptr @y, align 4, !dbg !73
  %7 = add nsw i32 %6, 1, !dbg !73
  store i32 %7, ptr @y, align 4, !dbg !73
  %8 = load ptr, ptr %3, align 8, !dbg !74
  call void @ck_spinlock_anderson_unlock(ptr noundef @lock, ptr noundef %8), !dbg !75
  ret ptr null, !dbg !76
}


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "x", scope: !2, file: !3, line: 10, type: !20, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Homebrew clang version 19.1.7", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !17, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!3 = !DIFile(filename: "tests/anderson.c", directory: "/Users/stefanodalmas/Desktop/huawei/ck", checksumkind: CSK_MD5, checksum: "3e8b6a5b525882d6b2763da0001a63b2")
!4 = !{!5, !6, !14, !16}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_spinlock_anderson_thread_t", file: !8, line: 45, baseType: !9)
!8 = !DIFile(filename: "include/spinlock/anderson.h", directory: "/Users/stefanodalmas/Desktop/huawei/ck", checksumkind: CSK_MD5, checksum: "6be228a7ecae2c5a8091cfc6ea102208")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_spinlock_anderson_thread", file: !8, line: 41, size: 64, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !9, file: !8, line: 42, baseType: !12, size: 32)
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !9, file: !8, line: 43, baseType: !12, size: 32, offset: 32)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!17 = !{!0, !18, !21, !28, !33, !38, !53}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "y", scope: !2, file: !3, line: 10, type: !20, isLocal: false, isDefinition: true)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(scope: null, file: !3, line: 55, type: !23, isLocal: true, isDefinition: true)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 40, elements: !26)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !{!27}
!27 = !DISubrange(count: 5)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !3, line: 55, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 88, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 11)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(scope: null, file: !3, line: 55, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 248, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 31)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "lock", scope: !2, file: !3, line: 11, type: !40, isLocal: false, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_spinlock_anderson_t", file: !8, line: 55, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_spinlock_anderson", file: !8, line: 47, size: 576, elements: !42)
!42 = !{!43, !45, !46, !47, !48, !52}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !41, file: !8, line: 48, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !41, file: !8, line: 49, baseType: !12, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !41, file: !8, line: 50, baseType: !12, size: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !41, file: !8, line: 51, baseType: !12, size: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !41, file: !8, line: 52, baseType: !49, size: 352, offset: 160)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 352, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 44)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !41, file: !8, line: 53, baseType: !12, size: 32, offset: 512)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "slots", scope: !2, file: !3, line: 12, type: !6, isLocal: false, isDefinition: true)
!55 = !{i32 2, !"SDK Version", [2 x i32] [i32 15, i32 0]}
!56 = !{i32 7, !"Dwarf Version", i32 5}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{i32 8, !"PIC Level", i32 2}
!60 = !{i32 7, !"uwtable", i32 1}
!61 = !{i32 7, !"frame-pointer", i32 1}
!62 = !{!"Homebrew clang version 19.1.7"}
!63 = distinct !DISubprogram(name: "run", scope: !3, file: !3, line: 14, type: !64, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{!5, !5}
!66 = !{}
!67 = !DILocalVariable(name: "arg", arg: 1, scope: !63, file: !3, line: 14, type: !5)
!68 = !DILocation(line: 14, column: 17, scope: !63)
!69 = !DILocalVariable(name: "my_slot", scope: !63, file: !3, line: 16, type: !6)
!70 = !DILocation(line: 16, column: 36, scope: !63)
!71 = !DILocation(line: 17, column: 5, scope: !63)
!72 = !DILocation(line: 19, column: 6, scope: !63)
!73 = !DILocation(line: 20, column: 6, scope: !63)
!74 = !DILocation(line: 22, column: 40, scope: !63)
!75 = !DILocation(line: 22, column: 5, scope: !63)
!76 = !DILocation(line: 23, column: 5, scope: !63)
!77 = distinct !DISubprogram(name: "ck_spinlock_anderson_lock", scope: !8, file: !8, line: 103, type: !78, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !66)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !80, !81}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!82 = !DILocalVariable(name: "lock", arg: 1, scope: !77, file: !8, line: 103, type: !80)
!83 = !DILocation(line: 103, column: 56, scope: !77)
!84 = !DILocalVariable(name: "slot", arg: 2, scope: !77, file: !8, line: 104, type: !81)
!85 = !DILocation(line: 104, column: 42, scope: !77)
!86 = !DILocalVariable(name: "position", scope: !77, file: !8, line: 106, type: !12)
!87 = !DILocation(line: 106, column: 15, scope: !77)
!88 = !DILocalVariable(name: "next", scope: !77, file: !8, line: 106, type: !12)
!89 = !DILocation(line: 106, column: 25, scope: !77)
!90 = !DILocalVariable(name: "count", scope: !77, file: !8, line: 107, type: !12)
!91 = !DILocation(line: 107, column: 15, scope: !77)
!92 = !DILocation(line: 107, column: 23, scope: !77)
!93 = !DILocation(line: 107, column: 29, scope: !77)
!94 = !DILocation(line: 114, column: 6, scope: !95)
!95 = distinct !DILexicalBlock(scope: !77, file: !8, line: 114, column: 6)
!96 = !DILocation(line: 114, column: 12, scope: !95)
!97 = !DILocation(line: 114, column: 17, scope: !95)
!98 = !DILocation(line: 114, column: 6, scope: !77)
!99 = !DILocation(line: 115, column: 14, scope: !100)
!100 = distinct !DILexicalBlock(scope: !95, file: !8, line: 114, column: 23)
!101 = !DILocation(line: 115, column: 12, scope: !100)
!102 = !DILocation(line: 117, column: 3, scope: !100)
!103 = !DILocation(line: 118, column: 8, scope: !104)
!104 = distinct !DILexicalBlock(scope: !105, file: !8, line: 118, column: 8)
!105 = distinct !DILexicalBlock(scope: !100, file: !8, line: 117, column: 6)
!106 = !DILocation(line: 118, column: 17, scope: !104)
!107 = !DILocation(line: 118, column: 8, scope: !105)
!108 = !DILocation(line: 119, column: 12, scope: !104)
!109 = !DILocation(line: 119, column: 18, scope: !104)
!110 = !DILocation(line: 119, column: 10, scope: !104)
!111 = !DILocation(line: 119, column: 5, scope: !104)
!112 = !DILocation(line: 121, column: 12, scope: !104)
!113 = !DILocation(line: 121, column: 21, scope: !104)
!114 = !DILocation(line: 121, column: 10, scope: !104)
!115 = !DILocation(line: 122, column: 3, scope: !105)
!116 = !DILocation(line: 122, column: 34, scope: !100)
!117 = !DILocation(line: 122, column: 40, scope: !100)
!118 = !DILocation(line: 122, column: 46, scope: !100)
!119 = !DILocation(line: 123, column: 12, scope: !100)
!120 = !DILocation(line: 122, column: 12, scope: !100)
!121 = !DILocation(line: 123, column: 29, scope: !100)
!122 = distinct !{!122, !102, !123, !124}
!123 = !DILocation(line: 123, column: 37, scope: !100)
!124 = !{!"llvm.loop.mustprogress"}
!125 = !DILocation(line: 125, column: 15, scope: !100)
!126 = !DILocation(line: 125, column: 12, scope: !100)
!127 = !DILocation(line: 126, column: 2, scope: !100)
!128 = !DILocation(line: 127, column: 30, scope: !129)
!129 = distinct !DILexicalBlock(scope: !95, file: !8, line: 126, column: 9)
!130 = !DILocation(line: 127, column: 36, scope: !129)
!131 = !DILocation(line: 127, column: 14, scope: !129)
!132 = !DILocation(line: 127, column: 12, scope: !129)
!133 = !DILocation(line: 128, column: 15, scope: !129)
!134 = !DILocation(line: 128, column: 21, scope: !129)
!135 = !DILocation(line: 128, column: 12, scope: !129)
!136 = !DILocation(line: 132, column: 2, scope: !77)
!137 = !DILocation(line: 138, column: 2, scope: !77)
!138 = !DILocation(line: 138, column: 9, scope: !77)
!139 = !DILocation(line: 138, column: 56, scope: !77)
!140 = !DILocation(line: 139, column: 3, scope: !77)
!141 = distinct !{!141, !137, !142, !124}
!142 = !DILocation(line: 139, column: 15, scope: !77)
!143 = !DILocation(line: 142, column: 2, scope: !77)
!144 = !DILocation(line: 143, column: 2, scope: !77)
!145 = !DILocation(line: 145, column: 10, scope: !77)
!146 = !DILocation(line: 145, column: 16, scope: !77)
!147 = !DILocation(line: 145, column: 24, scope: !77)
!148 = !DILocation(line: 145, column: 22, scope: !77)
!149 = !DILocation(line: 145, column: 3, scope: !77)
!150 = !DILocation(line: 145, column: 8, scope: !77)
!151 = !DILocation(line: 146, column: 2, scope: !77)
!152 = distinct !DISubprogram(name: "ck_spinlock_anderson_unlock", scope: !8, file: !8, line: 150, type: !153, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !66)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !80, !44}
!155 = !DILocalVariable(name: "lock", arg: 1, scope: !152, file: !8, line: 150, type: !80)
!156 = !DILocation(line: 150, column: 58, scope: !152)
!157 = !DILocalVariable(name: "slot", arg: 2, scope: !152, file: !8, line: 151, type: !44)
!158 = !DILocation(line: 151, column: 41, scope: !152)
!159 = !DILocalVariable(name: "position", scope: !152, file: !8, line: 153, type: !12)
!160 = !DILocation(line: 153, column: 15, scope: !152)
!161 = !DILocation(line: 155, column: 2, scope: !152)
!162 = !DILocation(line: 158, column: 6, scope: !163)
!163 = distinct !DILexicalBlock(scope: !152, file: !8, line: 158, column: 6)
!164 = !DILocation(line: 158, column: 12, scope: !163)
!165 = !DILocation(line: 158, column: 17, scope: !163)
!166 = !DILocation(line: 158, column: 6, scope: !152)
!167 = !DILocation(line: 159, column: 15, scope: !163)
!168 = !DILocation(line: 159, column: 21, scope: !163)
!169 = !DILocation(line: 159, column: 30, scope: !163)
!170 = !DILocation(line: 159, column: 37, scope: !163)
!171 = !DILocation(line: 159, column: 43, scope: !163)
!172 = !DILocation(line: 159, column: 35, scope: !163)
!173 = !DILocation(line: 159, column: 12, scope: !163)
!174 = !DILocation(line: 159, column: 3, scope: !163)
!175 = !DILocation(line: 161, column: 15, scope: !163)
!176 = !DILocation(line: 161, column: 21, scope: !163)
!177 = !DILocation(line: 161, column: 30, scope: !163)
!178 = !DILocation(line: 161, column: 37, scope: !163)
!179 = !DILocation(line: 161, column: 43, scope: !163)
!180 = !DILocation(line: 161, column: 35, scope: !163)
!181 = !DILocation(line: 161, column: 12, scope: !163)
!182 = !DILocation(line: 163, column: 2, scope: !152)
!183 = !DILocation(line: 164, column: 2, scope: !152)
!184 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 26, type: !185, scopeLine: 27, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !66)
!185 = !DISubroutineType(types: !186)
!186 = !{!20}
!187 = !DILocalVariable(name: "threads", scope: !184, file: !3, line: 28, type: !188)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 192, elements: !212)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !190, line: 31, baseType: !191)
!190 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_t.h", directory: "", checksumkind: CSK_MD5, checksum: "086fc6d7dc3c67fdb87e7376555dcfd7")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_t", file: !192, line: 118, baseType: !193)
!192 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_pthread/_pthread_types.h", directory: "", checksumkind: CSK_MD5, checksum: "4e2ea0e1af95894da0a6030a21a8ebee")
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_t", file: !192, line: 103, size: 65536, elements: !195)
!195 = !{!196, !198, !208}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !194, file: !192, line: 104, baseType: !197, size: 64)
!197 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup_stack", scope: !194, file: !192, line: 105, baseType: !199, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__darwin_pthread_handler_rec", file: !192, line: 57, size: 192, elements: !201)
!201 = !{!202, !206, !207}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__routine", scope: !200, file: !192, line: 58, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !5}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__arg", scope: !200, file: !192, line: 59, baseType: !5, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !200, file: !192, line: 60, baseType: !199, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !194, file: !192, line: 106, baseType: !209, size: 65408, offset: 128)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 65408, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 8176)
!212 = !{!213}
!213 = !DISubrange(count: 3)
!214 = !DILocation(line: 28, column: 15, scope: !184)
!215 = !DILocalVariable(name: "i", scope: !184, file: !3, line: 29, type: !20)
!216 = !DILocation(line: 29, column: 9, scope: !184)
!217 = !DILocation(line: 31, column: 46, scope: !184)
!218 = !DILocation(line: 31, column: 11, scope: !184)
!219 = !DILocation(line: 32, column: 9, scope: !220)
!220 = distinct !DILexicalBlock(scope: !184, file: !3, line: 32, column: 9)
!221 = !DILocation(line: 32, column: 15, scope: !220)
!222 = !DILocation(line: 32, column: 9, scope: !184)
!223 = !DILocation(line: 34, column: 9, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !3, line: 33, column: 5)
!225 = !DILocation(line: 37, column: 38, scope: !184)
!226 = !DILocation(line: 37, column: 5, scope: !184)
!227 = !DILocation(line: 39, column: 12, scope: !228)
!228 = distinct !DILexicalBlock(scope: !184, file: !3, line: 39, column: 5)
!229 = !DILocation(line: 39, column: 10, scope: !228)
!230 = !DILocation(line: 39, column: 17, scope: !231)
!231 = distinct !DILexicalBlock(scope: !228, file: !3, line: 39, column: 5)
!232 = !DILocation(line: 39, column: 19, scope: !231)
!233 = !DILocation(line: 39, column: 5, scope: !228)
!234 = !DILocation(line: 41, column: 37, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !3, line: 41, column: 13)
!236 = distinct !DILexicalBlock(scope: !231, file: !3, line: 40, column: 5)
!237 = !DILocation(line: 41, column: 29, scope: !235)
!238 = !DILocation(line: 41, column: 13, scope: !235)
!239 = !DILocation(line: 41, column: 58, scope: !235)
!240 = !DILocation(line: 41, column: 13, scope: !236)
!241 = !DILocation(line: 43, column: 13, scope: !242)
!242 = distinct !DILexicalBlock(scope: !235, file: !3, line: 42, column: 9)
!243 = !DILocation(line: 45, column: 5, scope: !236)
!244 = !DILocation(line: 39, column: 32, scope: !231)
!245 = !DILocation(line: 39, column: 5, scope: !231)
!246 = distinct !{!246, !233, !247, !124}
!247 = !DILocation(line: 45, column: 5, scope: !228)
!248 = !DILocation(line: 47, column: 12, scope: !249)
!249 = distinct !DILexicalBlock(scope: !184, file: !3, line: 47, column: 5)
!250 = !DILocation(line: 47, column: 10, scope: !249)
!251 = !DILocation(line: 47, column: 17, scope: !252)
!252 = distinct !DILexicalBlock(scope: !249, file: !3, line: 47, column: 5)
!253 = !DILocation(line: 47, column: 19, scope: !252)
!254 = !DILocation(line: 47, column: 5, scope: !249)
!255 = !DILocation(line: 49, column: 34, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 49, column: 13)
!257 = distinct !DILexicalBlock(scope: !252, file: !3, line: 48, column: 5)
!258 = !DILocation(line: 49, column: 26, scope: !256)
!259 = !DILocation(line: 49, column: 13, scope: !256)
!260 = !DILocation(line: 49, column: 44, scope: !256)
!261 = !DILocation(line: 49, column: 13, scope: !257)
!262 = !DILocation(line: 51, column: 13, scope: !263)
!263 = distinct !DILexicalBlock(scope: !256, file: !3, line: 50, column: 9)
!264 = !DILocation(line: 53, column: 5, scope: !257)
!265 = !DILocation(line: 47, column: 32, scope: !252)
!266 = !DILocation(line: 47, column: 5, scope: !252)
!267 = distinct !{!267, !254, !268, !124}
!268 = !DILocation(line: 53, column: 5, scope: !249)
!269 = !DILocation(line: 55, column: 5, scope: !184)
!270 = !DILocation(line: 0, scope: !184)
!271 = !DILocation(line: 57, column: 10, scope: !184)
!272 = !DILocation(line: 57, column: 5, scope: !184)
!273 = !DILocation(line: 59, column: 5, scope: !184)
