; ModuleID = '/home/stefano/huawei/libvsync/thread/verify/cnd_test1.c'
source_filename = "/home/stefano/huawei/libvsync/thread/verify/cnd_test1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.vcond_s = type { %struct.vatomic32_s }
%struct.vatomic32_s = type { i32 }
%struct.run_info_t = type { i64, i64, i8, i8* (i8*)* }
%union.pthread_attr_t = type { i64, [48 x i8] }

@g_mutex = dso_local global %union.pthread_mutex_t zeroinitializer, align 8, !dbg !0
@g_cs_x = dso_local global i32 0, align 4, !dbg !48
@g_cond = dso_local global %struct.vcond_s zeroinitializer, align 4, !dbg !29
@g_cs_y = dso_local global i32 0, align 4, !dbg !51
@.str = private unnamed_addr constant [12 x i8] c"g_cs_x == 2\00", align 1
@.str.1 = private unnamed_addr constant [56 x i8] c"/home/stefano/huawei/libvsync/thread/verify/cnd_test1.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1
@.str.2 = private unnamed_addr constant [13 x i8] c"g_cs_y == -1\00", align 1
@signal = internal global %struct.vatomic32_s zeroinitializer, align 4, !dbg !53


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_mutex", scope: !2, file: !31, line: 16, type: !56, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !28, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/stefano/huawei/libvsync/thread/verify/cnd_test1.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "eb3f8278f0ededf0cd212775f3a04d8a")
!4 = !{!5, !6}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "run_info_t", file: !8, line: 38, baseType: !9)
!8 = !DIFile(filename: "utils/include/test/thread_launcher.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "b854c1934ab1739fab93f88f22662d53")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 33, size: 256, elements: !10)
!10 = !{!11, !15, !20, !23}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !9, file: !8, line: 34, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!14 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !9, file: !8, line: 35, baseType: !16, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "vsize_t", file: !17, line: 43, baseType: !18)
!17 = !DIFile(filename: "include/vsync/vtypes.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "80559d0ebc17bc1f9d7b60e2c36ee0f3")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 46, baseType: !14)
!19 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!20 = !DIDerivedType(tag: DW_TAG_member, name: "assign_me_to_core", scope: !9, file: !8, line: 36, baseType: !21, size: 8, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "vbool_t", file: !17, line: 44, baseType: !22)
!22 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "run_fun", scope: !9, file: !8, line: 37, baseType: !24, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_fun_t", file: !8, line: 30, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!5, !5}
!28 = !{!29, !0, !48, !51, !53}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "g_cond", scope: !2, file: !31, line: 15, type: !32, isLocal: false, isDefinition: true)
!31 = !DIFile(filename: "thread/verify/cnd_test1.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "eb3f8278f0ededf0cd212775f3a04d8a")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "vcond_t", file: !33, line: 32, baseType: !34)
!33 = !DIFile(filename: "thread/include/vsync/thread/cond.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "e12fe21b05a741b635af0d075e9acad7")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vcond_s", file: !33, line: 30, size: 32, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !34, file: !33, line: 31, baseType: !37, size: 32, align: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "vatomic32_t", file: !38, line: 34, baseType: !39)
!38 = !DIFile(filename: "atomics/include/vsync/atomic/internal/types.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "566b0c58af89e39a453b706e5dc4ad25")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vatomic32_s", file: !38, line: 32, size: 32, align: 32, elements: !40)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_v", scope: !39, file: !38, line: 33, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuint32_t", file: !17, line: 35, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !44, line: 26, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !46, line: 42, baseType: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "g_cs_x", scope: !2, file: !31, line: 17, type: !50, isLocal: false, isDefinition: true)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "g_cs_y", scope: !2, file: !31, line: 17, type: !50, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "signal", scope: !2, file: !55, line: 22, type: !37, isLocal: true, isDefinition: true)
!55 = !DIFile(filename: "thread/include/vsync/thread/internal/futex.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "dede791c10be6385ed442bbae7c7e9b0")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "vmutex_t", file: !57, line: 7, baseType: !58)
!57 = !DIFile(filename: "thread/verify/mock_mutex.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "1d2467bff755e8cb9dc5ea1e20429e30")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !13, line: 72, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !13, line: 67, size: 320, elements: !60)
!60 = !{!61, !81, !86}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !59, file: !13, line: 69, baseType: !62, size: 320)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !63, line: 22, size: 320, elements: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!64 = !{!65, !66, !67, !68, !69, !70, !72, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !62, file: !63, line: 24, baseType: !50, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !62, file: !63, line: 25, baseType: !47, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !62, file: !63, line: 26, baseType: !50, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !62, file: !63, line: 28, baseType: !47, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !62, file: !63, line: 32, baseType: !50, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !62, file: !63, line: 34, baseType: !71, size: 16, offset: 160)
!71 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !62, file: !63, line: 35, baseType: !71, size: 16, offset: 176)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !62, file: !63, line: 36, baseType: !74, size: 128, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !75, line: 55, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !75, line: 51, size: 128, elements: !77)
!77 = !{!78, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !76, file: !75, line: 53, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !76, file: !75, line: 54, baseType: !79, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !59, file: !13, line: 70, baseType: !82, size: 320)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 320, elements: !84)
!83 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!84 = !{!85}
!85 = !DISubrange(count: 40)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !59, file: !13, line: 71, baseType: !87, size: 64)
!87 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!88 = !{i32 7, !"Dwarf Version", i32 5}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{i32 7, !"PIC Level", i32 2}
!92 = !{i32 7, !"PIE Level", i32 2}
!93 = !{i32 7, !"uwtable", i32 1}
!94 = !{i32 7, !"frame-pointer", i32 2}
!95 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!96 = distinct !DISubprogram(name: "run", scope: !31, file: !31, line: 20, type: !26, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !97)
!97 = !{}
!98 = !DILocalVariable(name: "arg", arg: 1, scope: !96, file: !31, line: 20, type: !5)
!99 = !DILocation(line: 20, column: 11, scope: !96)
!100 = !DILocation(line: 22, column: 5, scope: !96)
!101 = !DILocation(line: 23, column: 15, scope: !102)
!102 = distinct !DILexicalBlock(scope: !96, file: !31, line: 23, column: 9)
!103 = !DILocation(line: 23, column: 18, scope: !102)
!104 = !DILocation(line: 23, column: 9, scope: !96)
!105 = !DILocation(line: 24, column: 9, scope: !106)
!106 = distinct !DILexicalBlock(scope: !102, file: !31, line: 23, column: 34)
!107 = !DILocation(line: 24, column: 16, scope: !106)
!108 = !DILocation(line: 24, column: 23, scope: !106)
!109 = !DILocation(line: 25, column: 13, scope: !110)
!110 = distinct !DILexicalBlock(scope: !106, file: !31, line: 24, column: 36)
!111 = distinct !{!111, !105, !112, !113}
!112 = !DILocation(line: 26, column: 9, scope: !106)
!113 = !{!"llvm.loop.mustprogress"}
!114 = !DILocation(line: 27, column: 15, scope: !106)
!115 = !DILocation(line: 28, column: 5, scope: !106)
!116 = !DILocation(line: 29, column: 16, scope: !117)
!117 = distinct !DILexicalBlock(scope: !102, file: !31, line: 28, column: 12)
!118 = !DILocation(line: 31, column: 5, scope: !96)
!119 = !DILocation(line: 32, column: 5, scope: !96)
!120 = !DILocation(line: 34, column: 5, scope: !96)
!121 = !DILocation(line: 34, column: 5, scope: !122)
!122 = distinct !DILexicalBlock(scope: !96, file: !31, line: 34, column: 5)
!123 = !DILocation(line: 34, column: 5, scope: !124)
!124 = distinct !DILexicalBlock(scope: !122, file: !31, line: 34, column: 5)
!125 = !DILocation(line: 34, column: 5, scope: !126)
!126 = distinct !DILexicalBlock(scope: !124, file: !31, line: 34, column: 5)
!127 = !DILocation(line: 35, column: 5, scope: !96)
!128 = distinct !DISubprogram(name: "vmutex_acquire", scope: !57, file: !57, line: 10, type: !129, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !97)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!132 = !DILocalVariable(name: "l", arg: 1, scope: !128, file: !57, line: 10, type: !131)
!133 = !DILocation(line: 10, column: 26, scope: !128)
!134 = !DILocation(line: 12, column: 24, scope: !128)
!135 = !DILocation(line: 12, column: 5, scope: !128)
!136 = !DILocation(line: 13, column: 1, scope: !128)
!137 = distinct !DISubprogram(name: "vcond_wait", scope: !33, file: !33, line: 54, type: !138, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !97)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !140, !131}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!141 = !DILocalVariable(name: "c", arg: 1, scope: !137, file: !33, line: 54, type: !140)
