; ModuleID = '/home/stefano/huawei/libvsync/thread/verify/cnd_test2.c'
source_filename = "/home/stefano/huawei/libvsync/thread/verify/cnd_test2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.vcond_s = type { %struct.vatomic32_s }
%struct.vatomic32_s = type { i32 }
%struct.run_info_t = type { i64, i64, i8, i8* (i8*)* }
%union.pthread_attr_t = type { i64, [48 x i8] }

@g_mutex = dso_local global %union.pthread_mutex_t zeroinitializer, align 8, !dbg !0
@g_shared = dso_local global i32 0, align 4, !dbg !51
@g_cond = dso_local global %struct.vcond_s zeroinitializer, align 4, !dbg !32
@.str = private unnamed_addr constant [15 x i8] c"g_shared == 2U\00", align 1
@.str.1 = private unnamed_addr constant [56 x i8] c"/home/stefano/huawei/libvsync/thread/verify/cnd_test2.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1
@signal = internal global %struct.vatomic32_s zeroinitializer, align 4, !dbg !53

; Function Attrs: noinline nounwind uwtable
define dso_local i8* @run(i8* noundef %0) #0 !dbg !97 {
  %2 = alloca i8*, align 8
  %3 = alloca i64, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_mutex", scope: !2, file: !34, line: 16, type: !56, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !31, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/stefano/huawei/libvsync/thread/verify/cnd_test2.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "3903e594d098a22285f4cb867826652f")
!4 = !{!5, !10, !13, !14}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "vsize_t", file: !6, line: 43, baseType: !7)
!6 = !DIFile(filename: "include/vsync/vtypes.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "80559d0ebc17bc1f9d7b60e2c36ee0f3")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 46, baseType: !9)
!8 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!9 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuintptr_t", file: !6, line: 37, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !12, line: 90, baseType: !9)
!12 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "run_info_t", file: !16, line: 38, baseType: !17)
!16 = !DIFile(filename: "utils/include/test/thread_launcher.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "b854c1934ab1739fab93f88f22662d53")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 33, size: 256, elements: !18)
!18 = !{!19, !22, !23, !26}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !16, line: 34, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !21, line: 27, baseType: !9)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!22 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !17, file: !16, line: 35, baseType: !5, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "assign_me_to_core", scope: !17, file: !16, line: 36, baseType: !24, size: 8, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "vbool_t", file: !6, line: 44, baseType: !25)
!25 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "run_fun", scope: !17, file: !16, line: 37, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_fun_t", file: !16, line: 30, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!13, !13}
!31 = !{!32, !0, !51, !53}
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "g_cond", scope: !2, file: !34, line: 15, type: !35, isLocal: false, isDefinition: true)
!34 = !DIFile(filename: "thread/verify/cnd_test2.c", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "3903e594d098a22285f4cb867826652f")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "vcond_t", file: !36, line: 32, baseType: !37)
!36 = !DIFile(filename: "thread/include/vsync/thread/cond.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "e12fe21b05a741b635af0d075e9acad7")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vcond_s", file: !36, line: 30, size: 32, elements: !38)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !37, file: !36, line: 31, baseType: !40, size: 32, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "vatomic32_t", file: !41, line: 34, baseType: !42)
!41 = !DIFile(filename: "atomics/include/vsync/atomic/internal/types.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "566b0c58af89e39a453b706e5dc4ad25")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vatomic32_s", file: !41, line: 32, size: 32, align: 32, elements: !43)
!43 = !{!44}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_v", scope: !42, file: !41, line: 33, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "vuint32_t", file: !6, line: 35, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !47, line: 26, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !49, line: 42, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!50 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "g_shared", scope: !2, file: !34, line: 17, type: !45, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "signal", scope: !2, file: !55, line: 22, type: !40, isLocal: true, isDefinition: true)
!55 = !DIFile(filename: "thread/include/vsync/thread/internal/futex.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "dede791c10be6385ed442bbae7c7e9b0")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "vmutex_t", file: !57, line: 7, baseType: !58)
!57 = !DIFile(filename: "thread/verify/mock_mutex.h", directory: "/home/stefano/huawei/libvsync", checksumkind: CSK_MD5, checksum: "1d2467bff755e8cb9dc5ea1e20429e30")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !21, line: 72, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !21, line: 67, size: 320, elements: !60)
!60 = !{!61, !82, !87}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !59, file: !21, line: 69, baseType: !62, size: 320)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !63, line: 22, size: 320, elements: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!64 = !{!65, !67, !68, !69, !70, !71, !73, !74}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !62, file: !63, line: 24, baseType: !66, size: 32)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !62, file: !63, line: 25, baseType: !50, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !62, file: !63, line: 26, baseType: !66, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !62, file: !63, line: 28, baseType: !50, size: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !62, file: !63, line: 32, baseType: !66, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !62, file: !63, line: 34, baseType: !72, size: 16, offset: 160)
!72 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !62, file: !63, line: 35, baseType: !72, size: 16, offset: 176)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !62, file: !63, line: 36, baseType: !75, size: 128, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !76, line: 55, baseType: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !76, line: 51, size: 128, elements: !78)
!78 = !{!79, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !77, file: !76, line: 53, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !77, file: !76, line: 54, baseType: !80, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !59, file: !21, line: 70, baseType: !83, size: 320)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 320, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!85 = !{!86}
!86 = !DISubrange(count: 40)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !59, file: !21, line: 71, baseType: !88, size: 64)
!88 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!89 = !{i32 7, !"Dwarf Version", i32 5}
!90 = !{i32 2, !"Debug Info Version", i32 3}
!91 = !{i32 1, !"wchar_size", i32 4}
!92 = !{i32 7, !"PIC Level", i32 2}
!93 = !{i32 7, !"PIE Level", i32 2}
!94 = !{i32 7, !"uwtable", i32 1}
!95 = !{i32 7, !"frame-pointer", i32 2}
!96 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!97 = distinct !DISubprogram(name: "run", scope: !34, file: !34, line: 20, type: !29, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !98)
!98 = !{}
!99 = !DILocalVariable(name: "arg", arg: 1, scope: !97, file: !34, line: 20, type: !13)
!100 = !DILocation(line: 20, column: 11, scope: !97)
!101 = !DILocalVariable(name: "i", scope: !97, file: !34, line: 22, type: !5)
!102 = !DILocation(line: 22, column: 13, scope: !97)
!103 = !DILocation(line: 22, column: 38, scope: !97)
!104 = !DILocation(line: 22, column: 26, scope: !97)
!105 = !DILocation(line: 23, column: 5, scope: !97)
!106 = !DILocation(line: 24, column: 13, scope: !97)
!107 = !DILocation(line: 25, column: 5, scope: !97)
!108 = !DILocation(line: 25, column: 12, scope: !97)
!109 = !DILocation(line: 25, column: 14, scope: !97)
!110 = !DILocation(line: 25, column: 19, scope: !97)
!111 = !DILocation(line: 25, column: 22, scope: !97)
!112 = !DILocation(line: 25, column: 31, scope: !97)
!113 = !DILocation(line: 0, scope: !97)
!114 = !DILocation(line: 26, column: 9, scope: !115)
!115 = distinct !DILexicalBlock(scope: !97, file: !34, line: 25, column: 44)
!116 = distinct !{!116, !107, !117, !118}
!117 = !DILocation(line: 27, column: 5, scope: !97)
!118 = !{!"llvm.loop.mustprogress"}
!119 = !DILocation(line: 28, column: 5, scope: !97)
!120 = !DILocation(line: 29, column: 5, scope: !97)
!121 = !DILocation(line: 30, column: 5, scope: !97)
!122 = distinct !DISubprogram(name: "vmutex_acquire", scope: !57, file: !57, line: 10, type: !123, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !98)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!126 = !DILocalVariable(name: "l", arg: 1, scope: !122, file: !57, line: 10, type: !125)
!127 = !DILocation(line: 10, column: 26, scope: !122)
!128 = !DILocation(line: 12, column: 24, scope: !122)
!129 = !DILocation(line: 12, column: 5, scope: !122)
!130 = !DILocation(line: 13, column: 1, scope: !122)
!131 = distinct !DISubprogram(name: "vcond_wait", scope: !36, file: !36, line: 54, type: !132, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !98)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !134, !125}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!135 = !DILocalVariable(name: "c", arg: 1, scope: !131, file: !36, line: 54, type: !134)
!136 = !DILocation(line: 54, column: 21, scope: !131)
!137 = !DILocalVariable(name: "m", arg: 2, scope: !131, file: !36, line: 54, type: !125)
!138 = !DILocation(line: 54, column: 34, scope: !131)
!139 = !DILocalVariable(name: "val", scope: !131, file: !36, line: 56, type: !45)
!140 = !DILocation(line: 56, column: 15, scope: !131)
!141 = !DILocation(line: 56, column: 41, scope: !131)
!142 = !DILocation(line: 56, column: 44, scope: !131)
!143 = !DILocation(line: 56, column: 21, scope: !131)
